[
{"title": "New low-cost electric cargo bike promises 200+ mile range and fast charging", "author": "Micah Toll", "text": "Which would you rather have, a fast-charging e-bike or one with 217 miles (350 km) of range? With the new Engwe LE20 electric cargo bike, apparently you can have both.\n\nIt’s a bold claim, but Engwe says that its newest cargo e-bike has significantly more range than just about any other e-bike out there.\n\nThe base model comes with a single 48V 19.2 Wh battery with 921 Wh of capacity, but riders can opt for the double battery option, which Engwe says offers that massive 217 mile range. \n\nIs it legit? Well, a quick math check shows that those figures work out to around 8 Wh/mile or 5 Wh/km, which is right around the most efficient a typical e-bike can be when operated on low-power pedal assist. So the answer is, “Theoretically, yes, but most people won’t ever see that much range.”\n\nEven so, that’s way more battery than you’ll find on most e-bikes these days, and even if riders end up getting a third of that range, that’s still farther than just about anyone needs to ride their cargo e-bike in most situations.\n\nThe newly released LE20 is designed specifically for cargo transport and long-range performance and claims to offer “fast-charging technology”, allowing for quicker recharge times to keep riders on the move.\n\nIn reality, that means the bike ships with a higher-power 8-amp charging brick that offers a claimed 2-3 hour recharge time. While not exactly revolutionary, it’s still a nice upgrade for those who don’t want to wait 4-6 hours for their e-bike battery to recharge.\n\nThe Engwe LE20 is said to offer a 440 lb (200 kg) weight capacity, enabling multiple riders or heavy cargo to be carried on the bike. A 1,300W peak-rated rear hub motor ensures the bike can operate with that much weight and still offer good performance. For the European version of the bike, the rear hub motor is swapped out for a 100 Nm mid-drive motor. Electric bikes in most of the EU are limited to 250W of power, and so higher-power electric bikes like this generally hide the true power output of the motor and instead report torque figures, which are not regulated and can be used to imply just how powerful the e-bike is without explicitly stating wattage figures that wouldn’t be allowed.\n\nOther components spotted on the bike include hydraulic disc brakes, LED lighting including turn signals, a front suspension fork, and rear wheel guards to prevent cargo or passengers’ feet from getting caught in the spokes.\n\nNow available for pre-order in the US, the LE20 comes with an early-bird price of\n\n. The EU version will become available for order on October 8th and feature an introductory price of €1,699.\n\nCargo e-bikes have increasingly become \n\n for last-mile deliveries and personal transportation, especially in urban environments where traffic congestion and emissions reduction are priorities.\n\nENGWE’s LE20 seems poised to cater to this market by offering a combination of high capacity, extended range, and quick charging—features that are vital for commercial users and highly sought after by private consumers.\n\n ", "url": "https://electrek.co/2024/09/24/new-low-cost-electric-cargo-bike-promises-200-mile-range-and-fast-charging/", "image": "https://electrek.co/wp-content/uploads/sites/3/2024/09/engwe-LE20-cargo-e-bike-header.jpg?quality=82&strip=all&w=1600"},
{"title": "XPeng launches a new variant of its X9 MPV complete with two LiDARs and XNGP capabilities", "author": "Scooter Doll", "text": "XPeng Motors has just launched a new advanced version of its X9 MPV, featuring LiDAR, XNGP ADAS, and 610km of all-electric range. This long-range variant is now on sale in China, and \n\n is offering a limited-time discount for customers who buy early.\n\nThe X9 Multi-Purpose Vehicle (MPV) is the sixth all-electric model from Chinese automaker XPeng \n\n, which made its public debut in September 2023 with \n\n. The MPV officially hit the market on January 1, 2024, with four variants, including two “Pro” versions and two “Max” options offering CLTC ranges between 610 and 702 km (379-436 miles).\n\nIn addition to being XPeng’s flagship MPV, the X9 was also the first model to debut on the automaker’s Smart Electric Platform Architecture (SEPA) 2.0 and its most expensive to date. When it launched, the four X9 variants cost RMB 359,800 ($51,213), RMB 379,800 ($54,060), RMB 399,800 ($56,906), and RMB 419,800 ($59,750) respectively.\n\nToday, however, XPeng Motors has launched a new variant of the X9 MPV called the 610 Max, which offers the same range as its base-level counterpart but with advanced driving features and LiDAR, thus pushing the price tag even higher.\n\nAccording to \n\n, the new X9 610 Max has officially launched in China and is available now. Unlike the previous base-level models, the 610 Max features not one but two LiDAR sensors that enable XPeng’s \n\n—some of the most advanced self-driving technology on the market today.\n\nThe decision to add LiDAR is an interesting one, as XPeng recently opted for pure-vision cameras on \n\n, following its global competitor, Tesla. \n\nIn addition to LiDAR, the XPeng X9 610 Max MPV has been equipped with more powerful intelligent driving hardware, including two NVIDIA Drive Orin chips that deliver 508 TOPS of computing power, compared to one Orin chip with 254 TOPS in the 610 Pro version.\n\nThe new X9 610 Max starts at RMB 379,800. That’s RMB 20,000 more than the 610 Pro and evenly priced with the X9 702 Max. XPeng shared that customers who purchase the new X9 MPV variant before October 4 will receive a RMB 20,000 ($2,850) discount.\n\n ", "url": "https://electrek.co/2024/09/25/xpeng-launches-new-variant-x9-mpv-two-lidars-xngp-capabilities/", "image": "https://electrek.co/wp-content/uploads/sites/3/2024/09/XPeng-X9-MPV-610-hero.jpg?quality=82&strip=all&w=1400"},
{"title": "REE kicks off US production of its P7 electric trucks with Roush as its contract manufacturer", "author": "Scooter Doll", "text": "Fresh off of news of a global manufacturing agreement that includes a new investment of tens of millions of dollars, \n\n has kicked off plans for US production this year with the help of contract manufacturer Roush Industries.\n\nREE Automotive \n\n is one of the more exciting startups in the commercial EV segment thanks to its unique technology and modular vehicle platforms. The Israeli-based startup’s early success has been led by its flagship commercial product – the P7 electric truck.\n\nThat journey began with REE’s \n\n, which started rolling out initial deliveries in January 2024 after receiving certification from the Federal Motor Vehicle Safety Standards (FMVSS) – the \n\n.\n\nSince then, Penske has signed on to \n\n. Those models are being built in at REE’s Integration Center at Coventry in the UK. However, the startup established a second, \n\n in 2021, and REE is now beginning US production in Michigan with the help of Roush Industries.\n\nAccording to \n\n from REE Automotive this morning, it has officially kicked off US production in Michigan with Roush Industries, a contract manufacturer with nearly 50 years of experience in several industries across advanced mobility, aerospace, defense, and theme parks.\n\nREE states that Roush will begin US production of the P7 electric trucks at its Detroit-area factory in Q4 2024, with an annual capacity of 5,000 units. The startup will continue to manufacture its proprietary REEcorner technology in Coventry, while Roush will handle US assembly.\n\nREE also has a strategic agreement with Motherson, which will handle the startup’s global supply chain and logistics to ” target cost reduction, improved unit economics, and higher margins.” REE Automotive’s chief operations officer, Josh Tech, spoke about the decision to choose Roush to handle its US production of the P7 electric trucks:\n\nWe chose to work with Roush because of their proven capabilities and expertise in the commercial EV market, their capacity to scale production, and their understanding of our unique business model, which is to build our vehicles to order, not for inventory. We want to get our trucks in the hands of our customers as soon as possible, while not sacrificing on quality, making sure our customers can count on us as they build their electric commercial fleets. By partnering with Roush, we can concentrate on our core technology and production of the REEcorners while optimizing production costs and reducing go to market times benefiting from their nearly 40-year track record of engineering and manufacturing spans from NASCAR, to lunar terrain vehicles, to the most innovative EVs.\n\nREE shared that its P7 already has a network of 78 service and sales locations through 24 authorized dealers across North America, who combine for potential access to over 200 fleets throughout the US and Canada.\n\nToday’s US production news follows a successful investment round last week, in which REE entered into definitive agreements with M&G Investments, Motherson, and Varana Capital to purchase Class A ordinary shares for gross proceeds of $45.35 million (before deducting applicable fees and expenses). At the time of that announcement, REE shared that it intends to use the proceeds to generate general working capital.\n\nWith US production now in place, REE looks poised to make an even more significant impact on the electrified commercial vehicle segment. As previously reported, the startup had already garnered \n\n As of May 30, 2024, the company crossed the $50 million mark.\n\nThe company intends to share its Q2 2024 financial results later this week. \n\n ", "url": "https://electrek.co/2024/09/24/ree-kicks-off-us-production-p7-electric-trucks-roush-contract-manufacturer/", "image": "https://electrek.co/wp-content/uploads/sites/3/2024/09/REE-US-production.jpg?quality=82&strip=all&w=1400"},
{"title": "Tesla Full Self-Driving v12.5 first impression: more natural but still dangerous", "author": "Fred Lambert", "text": "I finally got a chance to test out Tesla Full Self-Driving (supervised) v12.5 myself, and my first impression is that the system drives more naturally, but it is still dangerous.\n\nVigilance is paramount.\n\nYesterday, I finally received a software update on my Tesla Model 3 that read ‘v12.5’ (12.5.2.1, to be exact).\n\nI had been waiting for it for a while. You see, call me naive, but when Tesla CEO Elon Musk said last year that FSD updates on HW4 (newer Tesla vehicles) would lag about 6 months behind HW3 (older Tesla vehicles), I believed him:\n\nIt made sense. He promised unsupervised self-driving on millions of HW3 vehicles for years. It makes sense that Tesla focuses on delivering on the promise for these older vehicles with less computing power before starting to utilize the higher computing power on newer HW4 vehicles.\n\nHowever, that didn’t happen.\n\nEarlier this year, Musk promised significant improvements to FSD rolling every two weeks:\n\nBut I got FSD v12.3.6 on HW3 Tesla Model 3 at the time and didn’t receive any more FSD update for 6 months.\n\nWhile this situation has greatly reduce my hopes of Tesla ever delivering on its promise of achieving self-driving on millions of vehicles sold since 2016, I was still excited to see this in the release notes on my car after an update this week:\n\nYesterday, I had to drive from Shawinigan to Trois-Rivieres (25 miles) and back. It was a good opportunity to test out the system on both surface streets and highways.\n\nMy first impression is that there are significant improvements in driving comfort. It drives way more naturally; the auto speed mode feature helps a lot. It drives at a speed that makes sense for the road rather than sticking to the speed limits plus or minus what you tell it.\n\nThe new driver monitoring system, which is vision-based rather than sending alerts asking you to tug on the wheels even though you are holding it, also helps make the system feel more natural.\n\nNow, if you don’t look ahead to the road for a few seconds, you get an alert on the screen to pay attention to the road, which goes away if you bring your attention back to it or give inputs to the steering wheel.\n\nThese were the main changes. I didn’t see a significant improvement in performance, but the system is at least more enjoyable to use now. It makes using Tesla FSD less like a job and more like a feature, which is a welcomed change after more than two years of “FSD Beta” and now “Supervised FSD”.\n\nI had to disengage the system as I was approaching my destination because the car insisted on going into the right lane when I needed to be on the left to stop. This was a minor annoyance, but a disengagement nonetheless.\n\nOn the way back, the car slowed down from my set speed on the highway for seemingly no reason. It is a common problem with Tesla FSD that I had in almost every iteration of the system. it can be dangerous on highways, but this time, it only slowed down by about 5-8 km/h and went back to the set speed in a few seconds without having to disengage.\n\nHowever, shortly after, I had a more significant issue that resulted in a critical disengagement.\n\nI had to make a left turn here:\n\nA car was coming from the left, but it was pretty far and not coming fast. I would have done the turn without hesitation, but I wasn’t sure if FSD, which is often on the cautious side in those turns, would or if it would wait for the car to pass. \n\nIt decided to go, but it was almost as if it changed its mind a third of the way into the turn as it stopped, or at the least decelerated greatly into the turn; it’s hard to tell cause I had to react fast.\n\nThe front of the car was already in the way, so I had to take over and complete the turn faster to make sure the upcoming car didn’t crash into me. \n\nUp until that point, I was pretty impressed by FSD v12.5. It’s a good reminder that as the tech improves and feels better, especially more natural like this update, it is super important to remain hyper-vigilant. The smoothness of this update can induce overconfidence, but it is still prone to errors, as I was quickly reminded.\n\nI see 2 big problems.\n\nHW3 has cameras of 720p vertical resolution vs 1500aprox for HW4 - so 1/2 the pixels vertically (and horizontally). Makes it more difficult to recognise far off cars and then also judge their speed.\n\nThe wide angle field of view camera (which is not recorded into the dashcam and should be!) is too low resolution and too narrow to see left/right at 80 degrees to way car is facing (needed at these T junctions) - hence it guesses when it's safe to emerge (nothing visible in the imediate 150 degrees that it thinks is a car) - then reacts when it realises there IS a car coming! HW3 camera is too low resolution to see far off cars clearly and get the speed right!\n\nWhile I am impressed and I think it is an important step as FSD is now starting to feel like an actual feature rather than just homework for Tesla customers to train a system that Tesla sold to us years ago, I still find it hard to see a path from this to unsupervised self-driving, especially on HW3 cars.\n\nObviously, this was just my first drive, and I need to spend a bit more time with the system for a full review, but I had two disengagements, including a critical one, in about 50 miles. We are still very far from unsupervised.\n\nMy main fear is that as the system feels better, like with this update, more people will start getting complacent with it, which could lead to more accidents. I am hoping that Tesla’s new driver monitoring system will counter that potential complacency. \n\nWhat do you think? Let us know in the comment section below.\n\n ", "url": "https://electrek.co/2024/09/24/tesla-full-self-driving-v12-5-first-impression-more-natural-dangerous/", "image": "https://electrek.co/wp-content/uploads/sites/3/2024/09/Tesla-FSD-v12.5.jpg?quality=82&strip=all&w=1600"},
{"title": "KIA shares a timeline for rolling out free NACS adapters to new EV6 and EV9 owners", "author": "Scooter Doll", "text": "Just about a year after Hyundai Motor Group announced plans to adopt the \n\n (NACS), Kia America sits on the cusp of sending plug adapters out to its current customers while its umbrella company works to implement the universal charging inlets on new models.\n\nThe North American Standard (NACS) was initially introduced as American Automaker Tesla’s proprietary plug, giving its owners access to its Supercharger network across North America.\n\nAfter Tesla renamed the inlet NACS and shared intentions to open up access to other OEMs, legacy automakers like Ford and GM quickly announced the transition. In the past year, nearly every EV automaker has followed suit and adopted the North American Charging Standard, bringing hopes of a universal charging inlet that much closer to reality—even if it will take adapters to start.\n\nLast year, Hyundai Motor Group said it would need to examine the standard from “a customer’s perspective” before deciding whether to adopt NACS. However, the Korean automaker confirmed that a switch was in the works after we reported that an IONIQ 5 and Kia EV9 had been \n\n.\n\nHyundai and Kia are working on implementing native NACS ports on future EV models, including the EV9, but current owners and those who purchase one of the brand’s BEVs this year will still need an adapter.\n\nHowever, starting in early 2025, those EV owners can receive a NACS adapter from Kia, and some will get one for free.\n\nAccording to \n\n from Kia America this morning, it plans to begin sending NACS adapters to EV6 and EV9 owners on January 15, 2025. The automaker relayed that any customer who purchases and takes delivery of a new 2024 or 2025 Kia EV9 or 2024 Kia EV6 from September 4, 2024, onward will receive a complimentary NACS adapter.\n\nThe adapter will give those Kia owners access to over 16,500 Tesla DC fast chargers in the US. Kia America’s VP of sales operations, Eric Watson, spoke about the rollout of NACS adapters:\n\nAs a leader in electrified mobility, it’s important Kia provide our EV customers the best ownership experience possible, and offering NACS adapters is a great way to open up a vast number of charge points across North America, expanding Kia-accessible DC charge points by more than 83 percent. Kia EVs are known for their range, with the EV6 RWD Light Long Range traveling an EPA-estimated 310 miles on a full charge. Now, with access to this sprawling network of DC fast chargers, our EV owners can feel even more confident in their ability to reach far-flung destinations on electricity.\n\nThe Kias are 800v, when plugged into the 400v nacs system they slow charge at 100k. You get the reliability of the SC network but not the speed\n\nAccording to Kia, the NACS adapters will be available in three versions: NACS to CCS1, CCS1 to NACS, and J1772 to NACS. NACS to CCS1 enables existing Kia EVs to use Tesla-branded DC fast chargers. The CCS1 coupler to NACS port enables NACS-equipped Kia EVs to charge on existing CCS DC chargers, and the J1772 to NACS adapter allows NACS-equipped Kia EVs to AC-charge on existing Level 2 chargers.\n\nIf you took delivery of a Kia EV6 or EV9 before September 4 of this year, you can still get an NACS adapter, but you’ll have to pay for it. Kia says those owners will have the opportunity to purchase an adapter from an authorized Kia dealer “at a later date.” \n\nHow much that will cost remains uncertain at this point. For comparison, GM just started rolling out its approved NACS adapter to its customers, \n\n.\n\nLastly, Kia said it will roll out an OTA software update in early 2025 that will allow its EV owners to locate and pay for charging via the Kia Access app.\n\n ", "url": "https://electrek.co/2024/09/24/kia-shares-timeline-rolling-out-free-nacs-adapters-to-new-ev6-ev9-owners/", "image": "https://electrek.co/wp-content/uploads/sites/3/2024/09/Kia-NACS-Hyundai-Tesla.jpg?quality=82&strip=all&w=1400"},
{"title": "Jeep, Ram owner begins search for a new CEO as US sales crash", "author": "Peter Johnson", "text": "Stellantis, the parent company of \n\n, Ram, Dodge, and several others is searching for a new CEO to replace Carlos Tavares. The company is considering a leadership change after Taveres’ contract expires in 2026. The move comes as \n\n looks to revamp brand sales in the US, its biggest profit market, as it falls behind rivals.\n\nStellantis Chairman John Elkann confirmed to \n\n on Monday that the company is indeed searching for a new CEO. The company added that the decision is a regular part of its succession planning.\n\nSources familiar with the matter said the chairman is unhappy with performance in North America, where sales have slipped.\n\nStellantis’ US sales crashed 21% \n\n after falling 10% in the first three months of 2024. Ram (-26%) and Dodge (-16%) sales are both down by double-digits this year, while Jeep (-9%) and Chrysler (-9%) are also down significantly compared to last year. Total US brand sales are down 16% through the first half of 2024.\n\nSeveral Stellantis brands, including Jeep, Ram, and Dodge, are launching their first EVs in the US later this year, which will be key to turning around slumping sales.\n\nThe company\n\n that its Sterling Heights Assembly Plant (SHAP) will be the first Stellantis pant to build an all-electric vehicle, the Ram 1500 REV electric pickup, due out later this year.\n\nJeep will begin delivering its first EV, the Wagoneer S, later this year. It will be built at its Warren Truck Assembly Plant. Jeep will follow it up with plans to launch a Wrangler-inspired Recon EV next year and a new mainstream electric crossover. The company also confirmed it will introduce a \n\n for under $25,000.\n\nMeanwhile, Dodge \n\n for its first electric muscle car, the 2024 Charger Daytona R/T, last week. The electric muscle car starts at $59,995, while the high-performance Scat Pack model costs $73,190.\n\nI'd like to ask Chairman Elkann what he thinks of Chrysler's \"lineup\" consisting of one minivan, with zero future vehicles planned whatsoever. In all its bureaucracy, it seems like the auto company forgot about... autos.\n\nThey need an American CEO to run the American arm of Stellantis, separately. From across the pond, all they could see the value in was the Jeep brand, so all their focus has been on the Jeep brand (but also, in the process, sort of watering down what made it what it is), and the other brands have been left to wither.\n\nAs part of its \n\n, Stellantis aims for 50% of US passenger and light-duty truck sales to be electric by 2030.\n\nStellantis CFO Natalie Knight said fixing issues, including falling profits, bloated inventory, and slumping sales in the US, will be the “top priority” going into the end of the year. The company’s board of directors is set to meet in the US starting on October 9 to devise a plan to revamp brand sales in the region.\n\nA Stellantis spokesperson said it was “normal” to start succession planning given the importance of the CEO position. The spokesperson added that despite its search, Tavares could still remain at the helm.\n\n ", "url": "https://electrek.co/2024/09/23/jeep-ram-owner-looking-for-new-ceo-us-sales-crash/", "image": "https://electrek.co/wp-content/uploads/sites/3/2024/09/Jeeps-first-EV-delayed.jpeg?quality=82&strip=all&w=1400"},
{"title": "Jeep’s Wrangler-inspired Recon EV spotted for the first time in transit", "author": "Peter Johnson", "text": "With deliveries of its first all-electric SUV in the US right around the corner, \n\n second EV is almost ready for its official debut. The upcoming Recon EV, inspired by the legendary Wrangler, was spotted in transit for the first time. At first, the electric SUV looks a bit like a Ford Bronco Sport or a Toyota Land Cruiser.\n\nJeep shook the internet after revealing plans to \n\nback in September 2022. Its first global electric SUV, \n\n, will reach US dealers in the coming weeks.\n\nHowever, Jeep’s upcoming Recon EV may be an even bigger hit with the rugged SUV maker’s loyal followers. The Recon is “inspired by the legendary Wrangler,” according to Jeep. Like the Wrangler, it will feature options like removable doors and windows.\n\nFormer Jeep North American boss Jim Morrison claimed the off-road electric SUV “has the capability to cross the mighty Rubicon Trail.” More importantly, it can “reach the end of the trail with enough range to drive back to town and recharge,” Morrison added.\n\nJeep brand CEO Antonio Filosa \n\nthat the Recon EV will likely launch by the end of 2024 ahead of sales next year.\n\nWe caught a \n\n a dealer event in Las Vegas last March.\n\nWe are now getting our first look at the preproduction models as the official debut approaches. \n\nThe new images from \n\n (\n\n) show the 2025 Jeep Recon EV in transit near Laredo, Texas. According to the report, the models were being shipped from Stellantis’ Toluca, Mexico, assembly plant.\n\nYou can see the Recon features a more aggressive design, as you would expect from a “Wrangler-inspired” EV.\n\nThe vehicle is unmistakably a Jeep with the brand’s classic grille design. However, at a quick glance, it could also pass as a Ford Bronco Sport.\n\nAlthough prices and specs have yet to be revealed, Filosa confirmed the Recon EV will ride on the STLA Large Platform, which also underpins the Wagoneer S.\n\nUgh, $60K and up. Yah that is \n\n going to turn things around for the brand. Not when the R2 is shooting for $45K. Even at $50K, I'd take a Rivian product over Jeep's first attempts. I could have sworn I read all these promises from Stellantis about being competitively priced. So much for that.\n\nThe Wagoneer S is expected to arrive at dealerships in the US this fall, although Filosa recently told \n\n that the electric SUV must be in “perfect quality” to launch.\n\nJeep’s first electric SUV starts at $71,995 with over 300 miles range and 600 hp. The Trailhawk edition is expected to cost about $5,000 to $10,000 more with off-road upgrades like Rock Mode and added rugged design elements.\n\nThe Recon EV is expected to start at around $60,000, but more capable (Rubicon) or premium (Sahara) trims could cost upwards of $80,000. Stay tuned for more as Jeep prepares to launch its second EV in the US.\n\n ", "url": "https://electrek.co/2024/09/24/jeeps-wrangler-inspired-recon-ev-spotted-in-transit-first-time/", "image": "https://electrek.co/wp-content/uploads/sites/3/2023/12/Jeep-cheapest-vehicle-EV.jpeg?quality=82&strip=all&w=1400"},
{"title": "Tesla Model Y has a shot at becoming best-selling car in the US", "author": "Fred Lambert", "text": "Tesla Model Y has a real shot at becoming the best-selling passenger vehicle of 2024 in the US. Only the Toyota Rav4 stands in its way.\n\nLast year, \n\n made\n\n despite launching in 2020 – three years prior.\n\nThe Model Y improved between 2020 and 2023, but that’s not really why we made it the ‘car of the year’. It was always a great vehicle, but its impact alone, as the best-selling car in the world and the first electric vehicle to do so, made it deserving of the title.\n\nWhile Model Y became the best-selling vehicle in the world, it did not have this honor in Tesla’s home market: the US.\n\nIt might get it this year.\n\nAccording to registration data from Experian and gathered by \n\n, the Model Y is just a hair short of catching up to the Toyota Rav4 after the first half of 2024:\n\nOf note, the Model Y is the only all-electric vehicle in the top 10. Although, there are all-electric versions of the Silverado and Equinox, and it’s not clear whether or not they are included in their market shares.\n\nToyota also has a plug-in hybrid version of the Rav4.\n\nThe question is whether or not Model Y can outpace the Rav4 enough in the second half of the year to catch up.\n\nIt’s a real possibility. As we recently reported, Tesla’s sales are doing OK in China, but they are significantly down in Europe. \n\n and buyers have been showered with incentives lately, which should boost Tesla’s performance in the US.\n\nI would never have guessed the MY was so close to #1 in the US. It's a great start to electrification. The next few years will be really exciting to watch the adoption rates, and new EVs coming to market.\n\nWith strong performances in Q3 and Q4, there’s a real chance Model Y could come out on top by the end of the year.\n\nHowever, Model Y is Tesla’s only best-seller in the US right now as Model 3 has dropped off.\n\nAs a brand, Tesla holds a 4% market share in the US and would need to more than double its overall sales in the US to break into the top 5:\n\nHowever, Tesla should still be commended for being in the top 10, considering most of these other brands have a 50—to 100-year start on the young electric automaker.\n\n ", "url": "https://electrek.co/2024/09/24/tesla-model-y-shot-best-selling-car-us/", "image": "https://electrek.co/wp-content/uploads/sites/3/2021/07/Model-Y-Hero-2021.jpg?quality=82&strip=all&w=1600"},
{"title": "Sublue Vapor electric seascooter review: Silently cruises above and below the water", "author": "Micah Toll", "text": "I’ve always enjoyed electric watersports devices, and have a long history with everything from \n\n. But it’s the category of electric sea scooters that likely offers the most accessiblity to the average person, providing fast and fun water excitement without the larger upfront cost and complexity of larger vessels. The Sublue Vapor is the latest in a string of electric sea scooters I’ve tested over the years, and it’s the fanciest one yet.\n\nOf course, fancy features come with higher prices, which are already higher than you’d expect, thanks to the law of nature where anything marine-related costs significantly more than it should.\n\nThis sucker is no different, carrying an exorbitant \n\n. \n\nSure, there’s some important waterproofing going on here, necessitated by the device’s ability to operate at depths down to an impressive 40 meters (131 feet). But that’s still a lot of cash.\n\nDespite the 40 meter rating, I was testing this on a Florida beach and I couldn’t get much more than a meter or two before I ran into sand. However, the Sublue Vapor is just as much fun on the surface, towing you (or your nephews, who helped me test it out) across the surface of the water at speeds of up 10 km/h (6 mph).\n\nThe impeller and nozzle work together to output some serious force, as I discovered the first time I pulled the throttle trigger while standing in waist-height water and holding the device directly in front of me. You only do that once, at least if you’re a male.\n\nThe better way to get started is laying out in a swimming position and then engaging the throttle to rocket forwards. \n\nThat also puts you in the best position to begin steering right away.\n\nThe Vapor uses a 385 Wh battery stored inside the nose, which can easily be swapped out for a second battery. There’s even room for two batteries in the carrying case, which is quite nicely designed.\n\nI felt like I was walking onto the beach with a nuclear football, and opening the foam briefcase up didn’t immediately change that picture.\n\nSpeaking of the battery, I found that a single battery lasts a bit less than the 60 minutes they claim, though we were mostly keeping it in the highest of the three power levels to take advantage of the 21 kg (46 lb) of thrust in high power mode. If you’re using lower power modes, you can likely make it to the full 60-minute run time.\n\nIt was really hard to capture any good photos of the screen for some reason, perhaps due to a coating on the display, but it actually does show up quite vibrantly in the water. \n\nIt’s a bright, well-lit display and easy to read even while twisting and turning underneath the waves.\n\nAs you can see from the marketing image below, a big part of the hard sell here appears to be in the form of “keep a couple of these on your yacht!”, which makes sense to me. If you’ve got yacht money, you can definitely afford the fun shenanigans that come with a sea scooter (and you’re likely out in some deeper water to enjoy exploring even further down).\n\nIf any of you have seen \n\n, you’ll know this is not something I’d likely be buying for my own vessel (especially since it costs over twice what my boat costs!).\n\nWhen it comes to controlling the device, it doesn’t take very much athletic ability at all to use the Sublue Vapor. That helps overcome the higher barriers to entry with electric surfboards and other electric watersports.\n\nAs long as you can hold on to the handles and pull the trigger to start the motor, you’ll pretty much be able to get the hang of it. There is some arm strength and core strength involved in steering the device, especially if you want to get more acrobatic at higher speeds, but low speed is quite gentle and won’t require much strength from the user. My five-year-old niece gave it a try and ended up with a faceful of waterjet (don’t worry, she’s a trooper), so there may be a minimum age at which this device is advisable. She’s fine on our lower-power sea scooters, but this one is more of a beast.\n\nAll told, the Sublue Vapor is an impressively powerful, nicely designed electric water scooter that would be great for diving, snorkeling, or just playing around at the beach. This is way more than a pool toy, but it also carries an ‘open water’ price. \n\nIt’s definitely priced out of the general recreation ballpark, but if you’ve got boat money, you’ve probably got high power electric seascooter money too. And hey, it’s a lot more portable than a jet ski!\n\n ", "url": "https://electrek.co/2024/09/24/sublue-vapor-electric-seascooter-review-silently-cruises-above-and-below-the-water/", "image": "https://electrek.co/wp-content/uploads/sites/3/2024/09/sublueleadimage-1.jpg?quality=82&strip=all&w=1600"},
{"title": "Kia is recalling 12,400 EV9 SUVs over faulty remote parking assist that may not stop", "author": "Peter Johnson", "text": "Kia issued a recall for 12,400 \n\n models due to a software glitch that could cause the remote smart parking feature to fail to stop as intended.\n\nThe \n\n(RSPA) feature is designed to park your EV9 or summon it when parked with the press of a button (learn more in the video below).\n\nKia’s RSPA uses sensors to remotely control the vehicle’s steering wheel, speed, and gearshifts to maneuver it to and from a parking space. However, a recently discovered error with the Integrated Electronic Brake (IEB) software can cause a glitch.\n\nAs a result, the system may fail to apply enough brake pressure during frequent stops or traveling at less than 2 mph.\n\nKia first noticed the issue earlier this month after an EV9 model in Korea using the feature collided with a parked car. Kia \n\n of the recall on September 17, 2024, which potentially affects 12,400 2024 EV9 models.\n\nOwner notification letters are expected to be mailed out on October 18, 2024. Kia dealers will update the IEB software with “improved logic” free of charge.\n\nYou can contact Kia’s customer service at 1-800-333-4542 with questions. Kia’s recall number is SC324. EV9 owners can also contact the NHTSA Vehicle Safety Hotline at 1-888-327-4236 or visit \n\n for more information. The NHTSA campaign number is 24V693000.\n\nKia’s first three-row electric SUV has helped it achieve \n\n months. Through the first eight months of 2024, nearly 13,900 EV9s have been sold in the US.\n\nStarting at $56,395, Kia calls the electric SUV’s price tag a “wake-up call to the industry.” Although the first EV9 rolled off the production line at Kia’s GA plant, the company may wait until next year to scale production.\n\n Kia America COO and executive vice president Steven Center told \n\n that the decision comes as Kia awaits US-assembled batteries to unlock access to the $7,500 federal tax credit.\n\n ", "url": "https://electrek.co/2024/09/24/kia-recall-12400-ev9-suvs-faulty-remote-parking-assist/", "image": "https://electrek.co/wp-content/uploads/sites/3/2023/10/Kia-EV9-reservations.jpeg?quality=82&strip=all&w=1400"},
{"title": "Rare EVOLV Terra e-scooter discount to $1,079, Save $3,300 on 6,128Wh Jackery bundle ahead of Prime Day, Hiboy, more", "author": "Reinette LeJeune", "text": "Leading today’s Green Deals is a rare chance at savings on \n\n. Right behind it is Jackery’s pre-Prime Day sale that has cut 50% off its \n\n which comes bundled with two extra batteries and two 200W solar panels for a \n\n, among others. We also spotted some more budget-friendly e-mobility solutions in the form of \n\n with regenerative braking back at its \n\n, while \n\n is down during its fleeting sale at \n\n. Plus, all the other hangover Green Deals in the links at the bottom of the page, like yesterday’s multiple discounts on the \n\n and its bundles, as well as \n\n, and more.\n\nHead below for other New Green Deals we’ve found today and, of course, \n\nand \n\n. Also, check out the new \n\n.\n\nEVOLV has an ongoing \n\n that is taking \n\n three of its electric scooters. While two models are usual inclusions in EVOLV’s sales, for the first time in 2024 we’re seeing the \n\n benefit from a price cut at \n\n, after using the promo code SEPTEMBER-SALE at checkout for $150 off. This higher-end e-scooter normally fetches $1,229 most of the time, with the last time we saw it discounted being 2023 Black Friday sales to $1,129. This a rare chance today to score some savings on a powerful commuter solution, while also getting it at the lowest price we have tracked. Learn more about this model below or in \n\n.\n\nOn the more affordable end of the brand’s e-mobility lineup and becoming increasingly popular here in NYC, \n\n pulls up sporting dual 600W motors (1,200W together) that peak at 2,200W for more torque as you tackle steep inclines. It maxes out at speeds of 31 MPH when utilizing both motors together, or it instead offers lower 15 MPH speeds when put into its eco mode, which alternates between the motors to conserve energy and extend travel distances up to 34 miles.\n\nAlong with its impressive performance capabilities, EVOLV’s Terra electric scooter shows up with a nice collection of add-ons and features, like the front and rear shocks for full-suspension support, maintenance-free front and rear drum brakes, the twin LED headlights, twin LED taillights, and the in-deck lights too. It’s been given an IP54 waterproof rating for days you just can’t help but battle the elements, a rear kick plate with a built-in carry handle, a foldable frame to help you carry/store it when not in use, and the LED display with built-in trigger throttle.\n\nJackery has launched its own \n\n that is taking \n\n a selection of power stations, bundles, and accessories, with some added bonus savings in the form of free gifts over $2,000 and member benefits too. One of the biggest deals of the bunch is on the brand’s \n\n which comes bundled \n\n. This massive bundle would normally cost you $6,599, with many of the sales we’ve seen not offering it at lowered rates or occasionally dropping it to a higher $3,599. Today though, as the sale’s name suggests, Prime Big Deal Days is coming early with a 50% markdown that saves you $3,300 and lands it at a new all-time low.\n\nIf home backup is your concern, \n\n is certainly one of the best options to take up the task as it provides a combined 6,128.4Wh LiFePO4 capacity, with even further expansion possibilities up to 24kWh with additional equipment. You can reach 12,000Wh with five extra batteries, or connect two power stations (each with five batteries) to reach its maximum capacity size.\n\nThe station alone can take up to 1,200W of solar input, recharging its battery to full in up to two hours, or you can plug it into a standard wall outlet for the same rate – plus, there’s also car charging that takes much longer at up to 25 hours. Keep in mind these charging rates do not account for the expanded setups. You’ll have 10 output ports to cover devices and appliances (five ACs, two USB-As, two USB-Cs, and one car port), plus complete control to monitor and adjust settings through the Jackery app via Bluetooth or Wi-Fi.\n\nBe sure to check out all that Jackery is offering during this sale \n\n, with plenty of other options for home backup and trips out of the house – all at some of the best prices we’ve seen and two weeks ahead of the upcoming Prime Big Deal Days.\n\nHiboy has several of its \n\n, with plenty of options for high-performance and entry-level models alike, including the \n\n. Normally fetching $806 at full price, this model is often included in most of the brand’s sales, often falling between $430 and $470. Today though, you’re looking at a 50% markdown that cuts $406 off its tag and gives you a chance to add it to your commute at the all-time lowest price we have tracked – with it even \n\n right now too.\n\nHiboy’s \n\n is one of the best entry-level models under the brand’s flag, arriving with a 350W motor paired alongside a 36V battery to reach top speeds of 19 MPH for up to 22 miles – all on a single five-hour charge. One of its most notable features is the included regenerative braking that recycles energy as you come to a stop for extended and more efficient travel distance. It also features an LED headlight and taillight for improved visibility at night, an IPX4 waterproof rating, cruise control settings, and an integrated digital display. You can adjust settings through the display or use its emote smart controls via the companion app, which also gives you the added security benefit of locking your scooter after you’re finished riding or when just hopping off for a break.\n\nYou can check out the entire lineup of e-scooter and e-bike discounts \n\n.\n\nHoverfly has an ongoing \n\n that is offering cash savings on a selection of e-scooters, e-bikes, and more. One of the best options among the offerings for those looking to jump into the e-bike market is the \n\n. Normally priced at $530 direct from Hoverfly, with a higher $600 starting price at other sites, we haven’t seen many discounts on this particular model, with most of late summer seeing it keep to its full price. Amazon did lower its rates a few weeks ago to match for a short period, but otherwise, you’re looking at the lowest price we have tracked at a 20% markdown that saves you $105 off this beginner-friendly model.\n\nThe \n\n arrives at a modest, but still convenient 15.5 MPH top speed thanks to its 350W brushless hub motor that peaks at 500W, with a removable 280.8Wh battery powering the entire thing and three simplified riding modes. It has a traditional bike mode to get yourself mobile with some cardio, a pure electric mode that lets the bike carry you without effort, and a pedal assistance mode that supports you with boosts up to its maximum 25-mile travel distance.\n\nThe handlebars and saddle come fully adjustable to better fit the different height ranges of riders and also includes dual disc brakes, front shock absorbers, an integrated rear cargo rack, a headlight and taillight, 16-inch wheels, and a foldable bike frame that makes storage and transport far easier when you’re not cruising around. You’ll also be getting a gift along with your purchase, with an included carrying bag, phone holder, mirror, and basket.\n\nThe savings this week are also continuing to a collection of other markdowns. To the same tune as the offers above, these all help you take a more energy-conscious approach to your routine. Winter means you can lock in even better off-season price cuts on electric tools for the lawn while saving on EVs and tons of other gear.\n\n ", "url": "https://electrek.co/2024/09/24/evolv-terra-e-scooter-1079-jackery-bundle-hiboy-more/", "image": "https://electrek.co/wp-content/uploads/sites/3/2024/09/EVOLV-Terra-Electric-Scooter.png?w=1600"},
{"title": "Kia secures a new partner to sell its first electric PBV vans in another key overseas market", "author": "Peter Johnson", "text": "Kia is taking its electric PBV vans to a new overseas market after securing a local sales contract in Japan. The fit-for-purpose EV vans are part of \n\n plans to become a leading total mobility solutions provider. Kia’s first electric PBV van was recently spotted in the wild ahead of its official launch.\n\nKia unveiled its new \n\n (PBV) business plans at the 2024 CES in Las Vegas. The new PBVs are designed as total mobility solutions or fit-for-purpose EVs loaded with advanced software.\n\nAccording to Kia’s CEO, Ho Sung Song, the PBVs are tailor-made electric vans that “go beyond the traditional concept of automobiles.”\n\nKia \n\n, with their spacious, flexible interiors, “open the door to new businesses and lifestyles.” The electric vans can be used for business or personal use. Ideal clients would include delivery or transport services or even someone looking for a custom van to travel around in.\n\nWith three models (PV1, PV5, and PV7), Kia plans to cover all segments. The first due to hit the market is the mid-size PV5.\n\nThe PV5 will be available in different configurations, including basic (passenger van), van (for transport and delivery), and chassis (think of a pickup truck bed).\n\nWe already knew Kia was planning to launch PBVs in Europe. Last week, Kia’s electric vans made their \n\n at IAA Hanover.\n\nOn Tuesday, Kia announced plans to launch electric vans in another key overseas region. After signing a new \n\n with Sojitz, Kia said it will sell PBVs in Japan starting in 2026.\n\nThe agreement comes as demand for small and medium-sized EV vans is expected to continue rising in Japan. Japan’s carbon-neutral policy calls for 30% of new car sales to be electric by 2030, and vans will play a significant role.\n\nKia will sell electric vans in Japan through its partnership with Sojitz, a leading local trading company.\n\nLike in other markets, Kia’s PV5 will be the first PBV to hit the market. The partnership kicks off Kia’s plans to expand Japan’s electric van market by working with local companies to create a “PBV ecosystem” with bidirectional charging technology and more.\n\nKia will introduce new EV van models in Japan in the future, including the PV7, as it looks to secure global leadership.\n\nAhead of its official debut, Kia’s PV5 electric van was \n\n last week. Despite the camouflage, the video from \n\n shows the boxy PV5 design. The prototype shown in January features a bold design to stand out in the electric era.\n\nThe electric van will challenge Volkswagen’s ID.Buzz in Europe. Although prices have not been officially revealed, the PV5 is expected to start at around $39,000 (€35,000) in Europe.\n\nIn comparison, the \n\n starts at around $70,000 (€64,581) in Germany, including VAT. In the US, VW’s electric van starts at $61,545.\n\nAll PBV models will be built at Kia’s new dedicated Autoland Hwaseong plant in Korea. Set to open next year, the plant is expected to have up to 150,000 annual unit capacity. By the end of the decade, that number could double to around 300,000.\n\nSeveral automakers and startups, including Ford, GM, VW, Rivian, and others, are looking to enter the growing EV van market.\n\n ", "url": "https://electrek.co/2024/09/24/kia-secures-partner-sell-electric-vans-another-overseas-market/", "image": "https://electrek.co/wp-content/uploads/sites/3/2024/07/Kias-first-electric-van-1.jpeg?quality=82&strip=all&w=1400"},
{"title": "Tripling renewables globally by 2030 is doable, says new IEA report", "author": "Michelle Lewis", "text": "A new International Energy Agency (IEA) report roadmaps how it’s feasible to triple renewables and double energy efficiency globally by 2030 “with the right enabling conditions.” \n\nAt last year’s COP28 in Dubai, nearly 200 countries set ambitious goals to accelerate the transition away from fossil fuels, aiming for net-zero emissions by 2050. The UAE Consensus, as it’s called, includes tripling global renewable energy capacity and doubling the rate of energy efficiency improvements by 2030. According to the IEA, if these goals are met, global emissions could drop by 10 billion tonnes by the end of the decade.\n\nBut hitting these targets isn’t automatic. Countries need to make key policy changes to make the renewable transition a reality. The new IEA report, “\n\n,” calls for an aggressive push to build and modernize 25 million kilometers of electricity grids by 2030. That’s enough to wrap the globe 600 times. It also highlights the need for 1,500 gigawatts (GW) of energy storage, including a 15-fold increase in battery storage.\n\nFatih Birol, executive director of the IEA, stressed that the focus must shift rapidly to implementation. “The COP28 energy goals are the North Star for what the energy sector needs to do. We need fit-for-purpose grids, energy storage, and faster electrification to ensure the clean energy transition happens quickly and securely.”\n\nEfficiency is another crucial pillar of the strategy. Doubling energy efficiency would reduce emissions by 6.5 billion tonnes and cut global energy costs by nearly 10%. The report emphasizes that advanced economies must focus on electrification, especially through electric vehicles and heat pumps. Emerging economies, on the other hand, need to adopt stronger efficiency standards for cooling equipment, while also expanding access to clean cooking supplies. This would significantly lower energy demand and improve quality of life in developing regions.\n\nThe IEA’s report serves as a roadmap for turning climate pledges into real action. Countries will now need to translate the UAE Consensus into updated Nationally Determined Contributions (NDCs) under the Paris Agreement. If governments get this right, the next decade could be a tipping point for clean energy, with renewables becoming the dominant source of power globally.\n\n \n\n ", "url": "https://electrek.co/2024/09/24/tripling-renewables-globally-by-2030-is-doable-says-new-iea-report/", "image": "https://electrek.co/wp-content/uploads/sites/3/2024/08/1619px-Solar_farm_in_Gallup_NM.jpg?quality=82&strip=all&w=1200"},
{"title": "You can score $14,000 off the 2024 Hyundai IONIQ 5 with a new lease cash incentive", "author": "Peter Johnson", "text": "With a new lease cash incentive in September, Hyundai offers up to $14,000 in savings on the 2024 IONIQ 5. With leases starting under $199 a month, the \n\n is one of the most affordable electric cars in the US. Perhaps even more important, it has a range of over 300 miles and can fast charge in 18 minutes.\n\nAfter the IONIQ 5 went on sale in the US in December 2021, Hyundai’s electric SUV quickly rose up the sales charts.\n\nLast year, the IONIQ 5 was the \n\n in the US, up from seventh in 2022. Through the \n\n, Hyundai has sold nearly 27,000 IONIQ 5 models in the US, up 26% from last year.\n\nThe IONIQ 5 just had its best \n\n, but Hyundai is not shying away from the discounts.\n\nAccording to online vehicle research firm \n\n, the 2024 IONIQ 5 SEL features up to $14,000 in lease cash incentives (you can see offers in your area below).\n\nThe 2024 Hyundai IONIQ 5 SEL is available for lease starting at $199 for 24 months. With $3,999 due at signing, the monthly effective rate is $366, which is still a great deal for a +300-mile range electric SUV.\n\nHyundai’s 2024 IONIQ 5 SEL RWD model has an EPA-estimated range of up to 303 miles, while the RWD model is rated at up to 260 miles.\n\nWith an added $7,500 lease bonus, the $48,795 MSRP results in net capitalized costs of $31,751. However, Hyundai’s deal only runs until September 30, 2024.\n\nThe 2024 IONIQ 5 SE Standard Range is available for $159 for 24 months. With $3,999 due at signing, the effect monthly rate is $326.\n\nThe discounts come after Hyundai revealed the \n\nearlier this month. Later this year, it will be the first vehicle built at its new Metaplant America plant in Georgia.\n\n ", "url": "https://electrek.co/2024/09/24/hyundai-offers-14000-off-2024-ioniq-5-new-lease-cash/", "image": "https://electrek.co/wp-content/uploads/sites/3/2024/06/Hyundai-IONIQ-5-lease-cheapest.jpeg?quality=82&strip=all&w=1400"},
{"title": "Rare earth element recycler Cyclic Materials to expand after $53M Series B funding round", "author": "Scooter Doll", "text": "A Canadian company called Cyclic Materials is working to create a circular supply chain for rare earth elements (REEs) using \n\n. The company just secured $53 million via a Series B equity round to accelerate its global expansion and recycling infrastructure.\n\nCyclic Materials was founded in Toronto in the fall of 2021 following a successful seed round. From there, the Rare Earth Element (REE) recycling specialist began developing and scaling its proprietary technology capable of economically and sustainably recovering critical raw materials from end-of-life EV motors, wind turbines, MRI machines, and other electronic waste.\n\nRather than focus on one particular component, such as batteries, the company specializes in recycling rare earth magnets – a type of permanent magnet made from alloys of rare earth elements, which are part of a set of seventeen chemical elements in the periodic table. To do so, Cyclic Materials has already introduced its “Mag-Cycle” (Spoke) and “REEPure” (Hub) processes and has proven their capabilities at the bench scale. \n\nFollowing a REEPure pilot in the fall of 2022, Cyclic Materials has proven its continuous magnet processing capacity of 10 Tons per year, which is plausible. This milestone caught the attention of several outside investors who joined a successful series A funding round in the spring of 2023, including BMW i Ventures (BiV), Energy Impact Partners (EIP), as well as government funding from the Sustainable Development Technology Council of Canada (SDTC).\n\nSince then, the company has launched a Mag-Cycle pilot facility with a design capacity of 8,000 tons per year, as well as a REEPure commercial demonstration facility with a magnet processing design capacity of 100 tons of rare earth elements per year.\n\nToday, Cyclic Materials announced another successful round of funding totaling $53 million.\n\nAccording to a release from Cyclic Materials this morning, it has completed an oversubscribed Series B equity round totaling $53 million. The latest round was led by ArcTern Ventures and welcomed new investors such as BDC Capital’s Climate Tech Fund, Hitachi Ventures, and Microsoft’s Climate Innovation Fund. Existing investors like Fifth Wall, BMW i Ventures, Energy Impact Partners, and Planetary Technologies also participated.\n\nWith its Series B round now complete, Cyclic Materials has raised $83 million to date. It intends to use the capital to establish rare earth element recycling infrastructure in the US and Europe and grow its internal team. Company co-founder and CEO Ahmad Ghahreman elaborated:\n\nWe’re energized to partner with the world’s top sustainability-focused infrastructure and corporate investors to scale our technology’s impact. This funding underscores the confidence in our ability to create the circular economy for rare earths needed for the clean energy transition. Not only is our technology essential for supporting sustainable domestic production of rare earths, but it will also play a critical role in re-establishing North American and European leadership in the rare earths industry.\n\nMuch like benefits touted by other rare earth element recyclers like Redwood Materials, for example, Cyclic Materials’ magnet recycling process delivers significant environmental benefits compared to traditional mining processes, including a reduced carbon footprint and “unparalleled water efficiency.”\n\nCyclic Material’s successful Series B funding joins a recent $3.6 million grant awarded by Natural Resources Canada. Both combine to support the continued operation of Cyclic Materials’ \n\n (seen above), which produces high-purity rare earth elements from recycled magnet material.\n\n ", "url": "https://electrek.co/2024/09/25/rare-earth-element-recycler-cyclic-materials-expand-53m-series-b-funding/", "image": "https://electrek.co/wp-content/uploads/sites/3/2024/09/Rare-earth-element-Cyclic-Materials.jpg?quality=82&strip=all&w=1400"},
{"title": "Lyft partners with Smartcar to help its EV drivers work without range anxiety", "author": "Scooter Doll", "text": " continues to empower its gig economy drivers by tackling a significant pain point for its current base of EV drivers: range anxiety. With the help of the API platform Smartcar, Lyft has introduced a new feature that only enables ride requests within a driver’s available EV range. \n\nAs one of the world’s leading rideshare networks, Lyft’s entire business is built upon its drivers and the dependability of their vehicles. On \n\n, we promote EV adoption across all segments and have reported on several benefits of EV adoption in the gig economy and rideshare segment in particular.\n\nLyft recognized these advantages early on and has made strides to help promote EV adoption by incentivizing its drivers to go electric while simultaneously implementing incentives to alleviate some of the pains that currently plague the industry.\n\nFor instance, Lyft partnered with EV charging network Electrify America, which \n\n for the rideshare company’s drivers across all of its stations. Lyft also introduced a “suite of offerings” to potential EV drivers, including \n\n and other charging discounts.\n\nToday, API specialist \n\n announced it has partnered with Lyft to help provide the latter’s EV drivers with a handy new tool to keep their rides going without worrying about running out of battery during a trip.\n\nAccording to \n\n today, it has partnered with Lyft to implement its API platform with the goal of alleviating range anxiety for EV drivers while they are out driving “on the clock.” \n\nSmartcar’s API technology enables a new feature called “Rides in Range,” which ensures EV drivers only receive ride requests within their vehicle’s current battery range. \n\nThe new tool is now available for Lyft EV drivers and has a 20-mile buffer on the driver’s given range to accommodate different driving styles or route obstacles that may entail a longer, more energy-heavy journey.\n\nLyft states that range anxiety remains the top concern for EV drivers on its platform since those individuals want to avoid interrupting trips to charge, being unable to find a charger during a ride, or worse, running out of battery altogether. Lyft product manager Ciara Chow elaborated:\n\nAt Lyft, we’re all about making life easier for drivers on our platform, and we know that range anxiety is a big deal for those with electric vehicles. That’s why we’re so excited about our new ‘Rides in Range’ feature, thanks to our partnership with Smartcar. Now, our drivers can take on rides without constantly worrying about their battery levels. It’s a game changer that helps them focus on what they do best – providing great rides for people who need them. \n\nSmartcar says its API retrieves EV battery level data from Lyft drivers in real-time, enabling the “Rides in Range” feature to alert drivers to charge after completing a trip if their battery level is expected to fall below 20%. Per the release:\n\nBy combining automatic trip-matching and proactive EV charging reminders, Lyft aims to build an efficient and convenient experience for EV drivers and passengers using the platform.\n\nWith Rides in Range, EV drivers on Lyft don’t have to deal with the cognitive burden of evaluating battery range for each request. Accurate and automated ride assignments with EV battery data retrieved via Smartcar help Lyft drivers take on more trips with confidence, boost ratings, and increase tips from customers.\n\nThe companies state that this new EV-centric feature is automatically enabled for future rides once a driver connects their electric car to the Lyft app via Smartcar. The API is consent-based and ready for immediate onboarding after that, so there is no need for any technical upgrades or security concerns. \n\nSmartcar states that the one-time API setup ensures drivers only share the necessary data permissions with Lyft, maintaining privacy while improving the electric vehicle owners’ user experience. \n\n.\n\n ", "url": "https://electrek.co/2024/09/24/lyft-partners-with-smartcar-to-help-its-ev-drivers-work-without-range-anxiety/", "image": "https://electrek.co/wp-content/uploads/sites/3/2024/09/Lyft-EV-tool.jpg?quality=82&strip=all&w=1400"},
{"title": "Best lease-to-own EV deals", "author": "Neal Gaborno", "text": "Still think that buying a new car is always much cheaper than leasing if you’re playing for keeps? Not true, particularly when it comes to electric vehicles. We found that current factory lease offers on 22 different EV models dispel that myth with terms that pass the entire \n\n to the lessee, enabling the lessee to eventually own the vehicle for thousands of dollars less than paying cash upfront or taking out a loan.\n\nCash: $51,448; Lease-to-own: $34,063. Lease-to-own savings: $17,385\n\nWith an average monthly cost of just $218/month, the 36-month, zero-down, $199/month lease deal on the Vinfast VF8 Eco tops our \n\n and is currently by far the cheapest EV lease in the nation, made possible by a total of $18,500 in lease incentives. According to the Vinfast website, the lease comes with an option to purchase the vehicle at $21,712 after its three-year term is up. Adding 36 payments of $199 to the $21,712 residual, plus the $695 acquisition fee due at signing and $350 fee to exercise the purchase option (which is unusual – Vinfast and Nissan are the only ones I’ve seen that charge for this) adds up to $29,921. Assuming a 9% state tax rate on all payments as well as on the $18,500 lease incentive results in a total after-tax lease-to-own cost of $34,063. That’s over $17K less than the after-tax cost of buying the $47,200 SUV outright.\n\nCapable of sprinting from zero to 60mph in five seconds, the VF8 can carry five passengers along with a conservatively measured 13.2 cubic feet of cargo behind the rear seats for up to 264 miles on a full charge. \n\nCash: $54,195; Lease-to-own: $37,801. Lease-to-own savings: $16,394\n\nSubaru is now advertising a three-year, zero-down, $379/month lease on the 2024 Solterra in very-well-equipped Limited trim, which is $50/month more than the basic (albeit well-appointed) Premium trim that Subaru has been offering at $329/month since early spring. That extra fifty bucks a month buys additional safety features and amenities such as a 360-degree camera system, parking assistance, 20-inch rims and tires, LED fog lights, power folding mirrors, power front seats, a heated steering wheel, heated rear seats, digital key, power tailgate, wireless phone charger, Harmon Kardon audio, and a huge 12.3-inch center display that replaces the Premium’s 7-inch display along with its annoyingly thick bezel.   \n\nAccording to Subaru’s website, the Solterra Limited lease comes with an option to buy for $20,385 (a 42% residual value) after making 36 monthly payments of $379, resulting in an after-tax lease-to-own cost of just $38,342, assuming a 9% state tax rate. That’s over sixteen grand six grand less than either paying cash up front or taking advantage of Subaru’s 72-month 0% financing offer, both costing $54,195 after adding a 9% tax on its $49,720 MSRP.\n\nVisually, the Solterra bears an uncanny resemblance to the Toyota bZ4X, as the two are built on the same dedicated modular EV platform and share quite a bit of sheet metal. Currently available only in all-wheel-drive, the Subaru carries 29 cubic feet of cargo behind its rear seats, accelerates from standstill to 60mph in 6.5 seconds, and travels up to 222 miles on a full charge in Limited trim. \n\nFolks that can live without the bells and whistles of the Limited trim might opt for the $46,340 Solterra Premium, which ekes out another 6 miles from a full charge for a total of 228 miles, thanks to rolling on a lighter 18-inch wheel and tire setup. The end-of-term buyout on its 3-year, $329/month lease is $20,390, yielding a tax-included lease-to-own cost of $35,840, which is $14,671 less than a cash-up-front after-tax cost of $50,511.  \n\nDespite offering enticing factory lease terms on the 2024 Solterra for most of the year, Subaru dealers in some areas are advertising \n\n, many of them at $7K or more, to attract customers. Any discount from MSRP will drive a vehicle’s lease-to-own cost even lower, perhaps in this case to an after-tax outlay that may approach $30K. \n\nCash: $49,067; Lease-to-own: $33,701. Lease-to-own savings: $15,366.\n\nIn New York, New Jersey, and Connecticut, an all-wheel-drive 2024 Toyota bZ4X XLE (MSRP $47,309) can be leased at $219/month for 36 months, $3999 due at signing, with the option to buy for $17,977 at the end of the lease. These attractive terms are due in large part to a $16,250 lease incentive that significantly reduces the capitalized cost of this five-seat SUV with a 228-mile range, zero to sixty time of 6.5 seconds, and 29 cubic feet of cargo space behind the rear seats.\n\nDuring the three-year lease term, tallying up the $3999 plus 35 payments of $219 (the first month is paid for at signing) adds up to $23,464. After an assumed 9% tax rate on the up-front capitalized cost reduction, down, and first payment ($1732) as well as on each subsequent payment ($20/month), the total cost to lease the bZ4X is $14,106.\n\nAt the end of the lease term, buying the three-year-old bZ4X at its incredibly low 38% residual value will cost $17,977 plus $1618 tax for a total of $19,595. All-in, the lease-to-own cost adds up to just $33,701.\n\nIn comparison, paying cash up front at delivery or opting for Toyota Financials’ 0% APR loan instead of the lease will cost a whole lot more, even with a current $2500 purchase incentive: $47,309 MSRP plus $4,258 tax minus the $2500 incentive equals $49,067. That’s a whopping $15,366 more than taking the lease-to-own route!\n\nIn California, Toyota is featuring a cheaper bZ4X XLE lease, but the terms apply to a $45,699 front-drive model in XLE trim that can travel up to 252 miles on a full charge. At $219/month for 36 months, $2999 due at signing, and an option to buy for $17,823 after three years, the tax-included lease-to-own cost is $33,149, which is $14,671 cheaper than a $47,312 tax-included cash purchase at MSRP.\n\nThe bZ4x has been selling quite well this year, thanks to Toyota clearing out dealer lots last April in a matter of weeks by dropping the average monthly lease costs of 2023 and 2024 bZ4X XLE models down to bottom-testing $191/month and $227/month respectively. By May, dealers were taking reservations for allocated and in-transit vehicles, some of them charging a premium over MSRP. Toyota has been gradually ratcheting up lease prices in the months that followed, and at a current effective lease cost of $323/month, supply and demand seems to be balancing out as the number of bZ4X sitting on dealer lots slowly increases. Although most dealers are still asking for MSRP or more, we did find \n\n between $1000 and $2000.  \n\n  \n\nCash: $53,731; Lease-to-own: $42,370. Lease-to-own savings: $11,361\n\nLexus currently has a lease offer on its $56,175 RZ450e Premium that includes an $18,500 incentive, resulting in an incredible $429/month for 27 months, $1999 due at signing. The option to buy at lease end with a residual value of 43% (per data from the Leasehackr.com “Rate Findr” tool) is $24,155. Summing the $1999 with 26 subsequent payments of $429 plus the $24,155 buyout, then applying an assumed 9% tax rate calculates to a tax-included lease-to-own cost of $42,370. Built on the same EV platform as the aforementioned Subaru Solterra and Toyota bZ4X, the RZ distinguishes itself from its two siblings with a more upscale look and feel inside and out. The five-seat all-wheel-drive luxury SUV capable of 220 miles on a full charge is slightly longer and wider, which accommodates a more spacious passenger volume and larger 34.9 cubic foot cargo hold behind the rear seats. It’s also much faster than the bZ4X and Solterra, blasting from zero to 60mph in 4.6 seconds.\n\nNeed to spend less as well as go further between charging sessions? The front-wheel-drive RZ300e (MSRP $51,475) has a lease offer of $399/month with $1999 at signing and a lease-end buyout of $22,134, which works out to an after-tax lease-to-own cost of $39,134, over $3K less than the RZ450e and just $1333 more than the Solterra Limited. Capable of 0-60mph runs of about seven seconds and going 266 miles on a full charge, the RZ300e sacrifices the RZ450e’s muscle car straight-line performance in favor of 46 more miles of range.\n\nThe RZ seems to be selling briskly, thanks to huge lease incentives and a bit of dealer participation, with \n\n ranging from $500 to $3,326. \n\nCash: $59,836; Lease-to-own: $52,360. Lease-to-own savings: $7,476\n\nVolvo currently has a lease offer on a rear-wheel-drive C40 in Core trim that is $459/month for 36 months and $3949 due at signing. According to lease calculators on Leasehackr.com and Edmunds.com, the residual on a 3-year, 10K mi/year lease is 50%, which calculates to an option to buy for $27,448 at lease end, resulting in a lease-to-own deal that’s over $7K less than an all-cash transaction at a 9% tax rate.\n\nThis four-door five-seater with 15 cubic feet of cargo space aft of its rear seats goes from zero to 60mph in 6.9 seconds and runs for 297 miles on a full charge in rear-drive configuration. Those yearning for more performance can opt for the all-wheel-drive twin-motor configuration that rockets from standstill to 60mph in 4.5 seconds and travels 257 miles on a full charge. The C40 in either form may seem a bit pricey compared to its competition, but \n\n to compensate. \n\nCash: $45,251; Lease-to-own: $39,023. Lease-to-own savings: $6,228\n\nNissan is currently running a $10,000 incentive on the 2024 Ariya, which translates into some of the most alluring lease terms since its introduction last year. In its most basic form, which is the Ariya Engage in front-drive, standard battery configuration with an MSRP of $45,515, leases at $289 per month for 24 months and $4119 at signing. Leasehackr.com and Edmunds.com lease calculators show a 56% residual on a two-year, 10K mi/year lease, which when multiplied by the MSRP, calculates to an option to buy for $23,548 at lease end after adding a $300 fee that Nissan charges to exercise that option. With an assumed 9% tax rate, its lease to-own cost comes out to $39,203, which is over $6K less than a tax-included all-cash purchase of this five-passenger SUV that carries 22.8 cubic feet of cargo behind its second-row seats, goes 216 miles on a charge, and accelerates from standstill to 60mph in 7.5 seconds.\n\nThose that have more of a need for speed, range, and amenities might want to consider a $56,565 Ariya Platinum+ e-4ORCE, which is a decked-out all-wheel-drive Ariya equipped with a larger battery that hustles from zero to 60mph in five seconds flat and travels up to 257 miles on a full charge. At $419/month for 24 months, $4249 at signing, and an option to buy at $34,239 at lease end, its after-tax lease-to-own cost is $58,874. That’s a $2,781 savings from a tax-included all-cash purchase, but it seems a bit expensive at almost $20K more than the lease-to-own cost of the base model. However, there are a number of dealers offering \n\n that makes the well-equipped Ariya worth considering. \n\nBelow is a list of EVs included in this study, sorted from highest to lowest lease-to-own (LTO) savings. Here are a few random thoughts/observations after staring at the list for too long:\n\nOne final note: Although some manufacturer lease offers conveniently state a residual value, most ads don’t make mention of it or contain weasel words like “Option to purchase at lease end for an amount to be determined at lease signing.” In any case, if you’re playing for keeps, ask for the residual value during negotiations to set expectations and verify that it’s not inflated, then check what’s written in the contract before signing on the bottom line. \n\n ", "url": "https://electrek.co/2024/09/24/best-lease-to-own-ev-deals/", "image": "https://electrek.co/wp-content/uploads/sites/3/2023/09/Honda-first-electric-SUV-1.jpeg?quality=82&strip=all&w=1400"},
{"title": "Rivian R1S now available for rent in the UK ahead of planned overseas expansion", "author": "Peter Johnson", "text": "Rivian’s electric SUV is headed overseas. The \n\n electric SUV is now available to rent in the UK. Although Rivian does not sell vehicles in Europe (not yet, anyway), the brand already has a growing presence overseas.\n\nRivian’s \n\n states that it only accepts reservations in the US (excluding offshore territories) and Canada, but its vehicles are hitting the streets overseas anyway.\n\nYou can now rent the Rivian R1S in the UK from rental firm \n\n. The company announced, “The Rivian R1S has arrived at EVision,” adding it can be rented for one day to three years. \n\nThe “American Beauty,” as the firm called it, can be rented for around $1,300 (£990) per day. That includes VAT. \n\nA week with the Rivian R1S will cost you roughly $4,200 (£3114). Longer-term options include: +1 month (£5994/ $8,000 per month), +1 year (£5274/ $7,000 per month), +2 years (£5034/ $6,750 per month), and 3 years (£4794/ $6,500).\n\nRivian’s R1S is more than an EV. It’s an electric adventure vehicle, as Rivian refers to it. The electric SUV features a range of up to 400 miles with enough room for seven passengers. It can also plow through 3 feet of water with up to 15 inches of ground clearance, rock crawl a 100% grade, and tackle almost any terrain.\n\nTo rent your R1S in the UK, \n\n. It starts at a slightly lower $1,280 (£954) daily rate.\n\n is the UK’s first and largest pure electric vehicle rental company. It offers  several popular EVs including Tesla models, the Porsche Taycan, Kia EV6, and Volkswagen ID.Buzz.\n\n225,000 USD for 3 years rental....\n\nSomeone is making some money!\n\nRivian’s current R1S and R1T are not available to purchase in Europe, but the company confirmed its next-gen R2 will be.\n\nAfter revealing the \n\n in March, Rivian confirmed it will launch in Europe as the EV maker expands overseas. R2 deliveries are expected to begin in the US in early 2026, with starting prices around $45,000.\n\nIn the US, Rivian is offering R1S leases for as low as $649 per month, and the R1T is available for $651 per month.\n\nCheck back soon for more on Rivian’s expansion into Europe as the R2 gets closer to launch. Although its electric delivery vans (EDVs) are already \n\n through its partnership with Amazon, passenger vehicles are coming over the next few years.\n\n ", "url": "https://electrek.co/2024/09/24/rivian-r1s-now-available-rent-uk/", "image": "https://electrek.co/wp-content/uploads/sites/3/2024/09/Rivian-R1S-UK.jpeg?quality=82&strip=all&w=1400"},
{"title": "It begins: Bollinger B4 medium duty EV enters series production", "author": "Jo Borrás", "text": "This week marks the birth of a new American OEM as Bollinger Motors’ B4 medium duty electric truck begins series production and customer-ready vehicles roll off the line.\n\nFor Robert Bollinger, it’s been a nearly decade-long journey to get from his first idea to production — and the party kicking off the B4’s production was as much a celebration of perseverance as anything else, \n\n.\n\n“Robert Bollinger and his team made a gutsy call two years ago to pivot to an entirely different market segment,” said Bollinger Motors’ CEO Jim Taylor. “The commercial vehicle segment is ready for electrification and Bollinger Motors has developed a world-class truck that will meet the fleet needs for companies across the country. \n\n.”\n\nThe new B4 and upcoming B5 electric work trucks feature 158-kwh battery packs sending power to an energy efficient, 323 hp electric motor that produces 675 lb-ft of torque at 0 rpm, giving the big trucks surprising off-the-line performance that put a lot of smiles on a lot of faces at this year’s ACT Expo in Las Vegas, where the trucks were made available for test drives.\n\nBuilt to a spec, not a price, Bollinger’s team aimed to deliver a world-class truck — and, if you ask them, they’ve delivered. “Our team has listened to customers and created a world-class electric truck to fill an important segment of the Class 4 commercial fleet market,” explains Jim Connelly, chief revenue officer, Bollinger Motors. “(We) are bringing a versatile and valuable truck to market at a competitive price point. When combined with the variety of incentives available to potential customers, we believe the B4 makes the fleet transition to electric a no-brainer.”\n\nConnelly was able to join us earlier today to record a quick interview announcing Bollinger production and CARB certification, \n\n.\n\nWe’ll post that episode, below, as soon as it’s available.\n\n: \n\n, via \n\n.\n\n ", "url": "https://electrek.co/2024/09/24/it-begins-bollinger-b4-medium-duty-ev-enters-series-production/", "image": "https://electrek.co/wp-content/uploads/sites/3/2024/09/bollinger_MAIN.jpg?quality=82&strip=all&w=1600"},
{"title": "Stellantis-backed Leapmotor teases new B10 SUV before it launches in EU markets", "author": "Scooter Doll", "text": "Chinese EV automaker Leapmotor is teasing its latest SUV model and the first to arrive on its new “B Platform” architecture. The company posted initial images of its B10 compact SUV before the new EV model makes its debut at the Paris Auto Show alongside joint venture partner \n\n. \n\nZhejiang Leapmotor Technology Co., Ltd., better known as Leapmotor is a publicly traded EV automaker in China founded in 2015. During its current run, Leapmotor has brought five New Energy Vehicles (NEVs) to market, including the T03 city car and the C01, C10, C11, and C16 SUVs. The company offers all its models as both (BEV) and extended-range electric vehicle (EREV) variants, except the T03, which is fully electric only.\n\nLeapmotor is unique in that it was one of the first Chinese automakers to establish a strategic partnership with a European automaker in Stellantis. In October 2023, Stellantis took \n\n, forming a joint venture to sell its vehicles in Europe.\n\nBy March of this year, \n\n as Leapmotor International, giving Stellantis exclusive rights to build and sell its new partner’s EVs outside China. By June, Stellantis had \n\n in Europe before officially launching alongside the C10 this week.\n\nToday, Leapmotor began teasing its next generation of SUV, which will make its official debut with Stellantis in Paris next month before entering markets in China and Europe.\n\nLeapmotor shared the three images of its new B10 SUV on \n\n earlier today, teasing the new model ahead of its debut at the Paris Auto Show, which begins on October 14, 2024.\n\nThe B10 will be the first electric model to debut on Leapmotor’s new B Platform. This platform features the automaker’s latest Leap 3.5 Technology Architecture, designed to “provide young people around the world with top-notch new energy products.” The B10 will be the first of several new models on the platform to hit the market by 2025.\n\nAccording to Leapmotor, the B10 is classified as a compact SUV similar in size to the BMW X1. It is expected to compete against other BEV models like \n\n from NIO.\n\nLeapmotor’s JV partner Stellantis will also have a prominent presence at the Paris Auto Show next month, and \n\n detailing its premieres included a blurb about its Chinese partner and the new B10 SUV:\n\nLeapmotor will present its tech-centric, affordable electric mobility solutions. Leapmotor Founder, Chairman and CEO Zhu Jiangming, together with Stellantis CEO Carlos Tavares, will unveil the all-new B10, a C-segment SUV, expanding its product line-up in Europe’s core segment through this unique partnership in the automotive industry. This highly anticipated model is the first global model based on Leapmotor’s new B platform, marking a significant step in Leapmotor’s strategic growth in the region by bringing its advanced technology to an even broader audience. \n\nLeapmotor will also present the C10, a fully equipped, family-oriented D-segment electric SUV, and the Leapmotor T03, a compact A-segment urban EV with B-segment interior space. The Leapmotor C10, built on the LEAP3.0 technology architecture, features central integrated electronic and electrical architecture, cell-to-chassis (CTC) technology, and a flagship intelligent cockpit.\n\nPer Stellantis, Leapmotor International is launching operations in Europe now, beginning with T03 and C10 models through 350 sales points globally by the year’s end. The Leapmotor B10 SUV will follow after it makes its official debut in Paris.\n\nWe will be sure to report back when we learn more about the B10’s specs and pricing.\n\n ", "url": "https://electrek.co/2024/09/25/stellantis-leapmotor-teases-new-b10-suv-before-it-launches-in-eu/", "image": "https://electrek.co/wp-content/uploads/sites/3/2024/09/Leapmotor-SUV-B10-hero.jpg?quality=82&strip=all&w=1400"},
{"title": "Tesla progresses on Giga Berlin expansion, workers snuck in the middle of the night with police", "author": "Fred Lambert", "text": "Workers have reportedly snuck with police in the middle of the night in the forest around Gigafactory Berlin to cut trees for Tesla’s expansion.\n\nTesla has been trying to expand its Gigafactory Berlin, but it has been facing some opposition.\n\nEarlier this year, \n\n of the plant, which requires more than 100 hectares of forest to be cleared.\n\nLocal officials have given their approval nonetheless.\n\nActivists have occupied the forest to try to stop the expansion from happening. They call themselves ‘Stop Tesla’ and set up camp in the forest, a classic “treehugger” strategy.\n\nHowever, the worst has been \n\n temporarily in March.\n\nSince then, the main concerns have been ‘Stop Tesla’ and \n\nand needing removal.\n\nAccording to a local report from \n\n, Tesla has now managed to make some progress. They needed to cut some trees down for a construction road in preparation for the railway (translated from Gerrman):\n\nTrees were felled around the Tesla protest camp in Grünheide early Tuesday morning. A three-kilometer-long construction road is to be built for this purpose. The police secured the felling.\n\nAbout three thousand trees were taken down.\n\n‘Stop Tesla’ says that they came in the middle of the night under police protection:\n\nAccording to members of the “Stop Tesla” initiative, the work started at around 2 a.m. In the middle of the night, railway employees in safety vests and police officers appeared. A spokeswoman for the initiative said: “They started fencing off the assembly area, setting up floodlights and construction machinery and clearing the first trees.\n\nThe group believes that the start in the middle of the night was “provocation” as the police presence and the heavy machinery moving around the camp in the middle of the night was scary.\n\nHowever, the railway company Deutsche Bahn denied the allegation – saying that they needed to move in the middle of the night to have to site ready for workers the next day.\n\nTesla is looking to expand the plant to support the production of future vehicles at Gigafactory Berlin, which currently only produces Model Y.\n\nCEO Elon Musk recently said that\n\n.\n\n ", "url": "https://electrek.co/2024/09/25/tesla-progresses-on-giga-berlin-expansion-workers-snuck-in-the-middle-of-the-night-with-police/", "image": "https://electrek.co/wp-content/uploads/sites/3/2021/12/Tesla-Gigafactory-Berlin-Hero.jpg?quality=82&strip=all&w=1600"},
{"title": "Ford exec says most drivers don’t realize the major perks of EVs like charging at home", "author": "Peter Johnson", "text": " Marin Gjaja explained that most drivers don’t realize the major perks of driving an EV. Not only is it more efficient, but it also offers extra benefits like skipping the lines at the gas station with the ability to charge at home.\n\nAt the \n\n, Marin Gjaja, COO of Ford’s Model e EV business, said one of the company’s main priorities is tackling false beliefs about electric vehicles.\n\n“That’s the conundrum for us as an industry,” Gjaja said in Michigan on Tuesday. He added, “We have customers who are fearing loss and misperceive the value” of EVs.\n\nFord is working with its dealers to educate customers with tools like \n\n to counter EV misperceptions. Introduced in May, Ford’s new tool is a digital and video-based dealer training platform with games and AI to educate employees and buyers.\n\nAccording to Gjaja, automakers must address the “economic challenges” as the industry shifts to electric vehicles. To do so, educating customers about the true perks of driving an EV is key.\n\nGjaja explained that EVs come with additional benefits, like waking up with a full charge every day and the ability to charge at home. Many electric vehicles, like \n\n, can also act as portable generators with added functions like vehicle-to-home (V2H) charging with bidirectional capabilities.\n\nLightning drivers have \n\n to power home appliances and other electronics during hurricanes, earthquakes, blizzards, and other extreme weather events. It can also be used to power up your next camping trip or work site.\n\nFord sold \n\n in the US last month. Through the \n\n, Ford’s EV sales reached 61,366, up 57.6% from the same period last year.\n\nHowever, Ford has delayed several EV projects, citing “slower-than-expected” adoption. Ford also scrapped plans to launch its three-row electric SUV and is focusing on smaller, more profitable models.\n\nFord has a dedicated team of ex-Tesla, Rivian, Lucid, and Apple employees in California developing its \n\n. The first vehicle, a mid-size electric pickup, is expected to launch in 2027.\n\n“Being affordable is great, but there are two other requirements,” Gjaja explained. One is that it has to be unique, or “you’re going to get commoditized,” and the other is that “you also have to make money.”\n\nFord’s EV unit \n\n in the first half of the year and is on track to lose between $5 and $5.5 billion in 2024.\n\nThe company is betting on more affordable EVs and a software-defined experience to turn things around over the next few years.\n\nMany drivers don’t realize the actual benefits of driving an EV until they own one. However, the first time you drive it, you will notice the significant upgrade it offers over gas-powered vehicles.\n\nThe ride is nearly silent and much smoother. With instant torque, you don’t have to worry about lagging when pulling out into traffic.\n\nMost EVs have superior software and connectivity and are much smarter than traditional gas-powered cars. And that’s not even including the lower cost of ownership with less maintenance and not being subject to fluctuating gas prices. Plus, waking up with a full charge every day is worth it alone. And the best part is you can roll your windows down on a nice day and not smell constant fumes (only if you’re next to a gas-powered car).\n\n ", "url": "https://electrek.co/2024/09/25/ford-drivers-dont-realize-ev-perks-charging-at-home/", "image": "https://electrek.co/wp-content/uploads/sites/3/2024/08/Ford-UAW-Discount-2025.jpeg?quality=82&strip=all&w=1400"}
]