[
{"title": "Global solar growth is on track for another record-breaking year", "author": "Michelle Lewis", "text": "Global solar installations are set to beat most industry forecasts, with 593 gigawatts (GW) expected to be added by the end of 2024, according to a new report by energy think tank Ember. \n\nThis is a 29% increase compared to the previous year, maintaining strong growth following an estimated 87% surge in 2023. \n\n“Yet again, solar power is growing faster than people expected, as it establishes itself as the cheapest source of electricity globally,” said Euan Graham, electricity data analyst at Ember. “Strong growth in established markets is combining with rapid acceleration elsewhere to make solar additions higher than ever before. Countries need to plan for a solar-powered future to make the most of the cheap power this technology can provide.”\n\nBased on the data up to July 2024, Ember’s analysis is in line with forecasts made by Bloomberg New Energy Finance (\n\n). \n\nBut interestingly, it’s also almost 200 GW higher than the International Energy Agency’s (\n\n) main case outlook released in January 2024. Solar’s better-than-expected growth has led to forecast revisions – for example, SolarPower Europe increased its 2024 global forecast from 401 GW in June 2023 to 544 GW in June 2024. \n\nEmber’s analysis also finds that solar capacity additions in 2024 will likely surpass the entire global increase – 540 GW – in \n\n since 2010. This accelerating pace brings ambitious climate targets closer, but continued rapid progress is still needed to meet the Paris Agreement’s 1.5C goal. \n\nChina, the US, India, Germany, and Brazil will account for 75% of global solar additions in 2024, according to Ember’s estimates. \n\nChina continues to dominate in global solar capacity installations. In the first seven months of the year, it was up by 28% year-over-year. At this pace, China is expected to install 334 GW of solar capacity, making up 56% of global capacity additions for 2024. \n\nAdditions in India in the first seven months of 2024 were 77% higher year-over-year. By May 2024, India had already surpassed its total solar installations for all of 2023. At its current pace, India is on track to install 23 GW by the end of this year.\n\nIn the US, solar additions totaled 20 GW from January to June 2024, a 55% increase year-over-year. Meanwhile, Germany has already exceeded its \n\n for all of 2024, and is on track to meet its new target for 2026, which is set out in its \n\n.\n\nEmber’s data on \n\n reveals significant growth is also emerging in new markets such as Pakistan and Saudi Arabia, as well as the Philippines, the UAE, Thailand, and Oman. \n\nAs solar becomes more affordable and accessible, ensuring sufficient grid capacity and developing battery storage is crucial for handling power distribution and supporting solar outside of peak sunlight hours. By addressing these challenges and sustaining growth, solar power could continue to exceed expectations for the remainder of the decade.\n\n \n\n ", "url": "https://electrek.co/2024/09/19/global-solar-growth-is-on-track-for-another-record-breaking-year/", "image": "https://electrek.co/wp-content/uploads/sites/3/2024/06/China-solar-CGTN.jpg?quality=82&strip=all&w=1600"},
{"title": "Volkswagen to halt ID.4 production in the US following nearly 100,000 vehicle recall", "author": "Peter Johnson", "text": "Volkswagen plans to temporarily halt \n\n production at its Chattanooga, TN, plant following a nationwide recall involving nearly 100,000 models. According to a VW statement, roughly 200 workers will be furloughed at the plant.\n\nThe first ID.4 \n\n at VW’s Chattanooga, TN, plant in July 2022. At the time, Volkswagen said it was looking to hire 1,000 new workers to ramp up production.\n\nA little over two years later, Volkswagen is temporarily suspending production with a recall potentially impacting around 100,000 ID.4 models nationwide.\n\nVolkswagen said in a statement that the temporary ID.4 production halt will result in about 200 workers at the Chattanooga plant being furloughed. The company plans to support the workers with supplemented state unemployment and 80% of their base compensation during the furlough, which starts on September 23.\n\nThe company explained, “While we address the issue, we are focused on doing right by our employees, dealers, and consumers through this disruption.”\n\nAccording to Volkswagen, the production halt could last until the beginning of next year as it works to resolve the issue. \n\nVolkswagen is working with dealers to find a quick fix. The recall, which was reported earlier this month, could potentially impact 98,806 ID.4 models in the US due to malfunctioning door handles.\n\nThe \n\n to the National Highway Traffic Safety Administration (NHTSA) stated the door handles could allow water to enter the circuit board assembly, which may lead to the doors opening unexpectedly.\n\nVW dealers will inspect the vehicle, replace the parts, and update the software if necessary. The service will be free of charge.\n\nOwner notification letters are expected to be mailed on November 1, 2024. If you have questions, you can contact VW’s customer service at 1-800-8930-5298. Volkswagen’s number for the recall is 57J9. Vehicles previously repaired (23V-312 and 23V-213) will still need the new remedy.\n\nVolkswagen said the disruption “In no way changes our commitment to the ID.4 and our growing BEV portfolio.”\n\nI don't understand why so many EVs have to reinvent the door handle. I get that it gives a marginal aero advantage, but most people just want to have a normal car with normal handles that happens to be an EV. If it gets 5 miles less range, so what?\n\nThe company added that the ID.4 “remains one of America’s bestselling electric vehicles.” In the \n\n, Volkswagen sold 5,690 ID.4 models in the US, down 15% YOY. VW ID.4 sales fell 28% in the first half of 2024, with 11,857 models sold in the US, down from 16,448 last year.\n\nVolkswagen is also set to begin contract negotiations with the UAW on Thursday as President Shawn Fain \n\n at the Chattanooga facility this week. “Are you ready to move another mountain?” Fain asked the 400 workers who attended the event.\n\nVolkswagen’s Chattanooga plant employs around 5,500 workers. Fain is calling for workers to “earn a record contract and make history again.”\n\n ", "url": "https://electrek.co/2024/09/18/volkswagen-halt-us-id-4-production-100k-vehicle-recall/", "image": "https://electrek.co/wp-content/uploads/sites/3/2024/09/Volkswagen-halt-ID.4-production.jpeg?quality=82&strip=all&w=1400"},
{"title": "GM releases its approved NACS adapter, giving its drivers access to Tesla’s charging network", "author": "Scooter Doll", "text": "More than a year after legacy automakers announced a transition from the CCS charging port to Tesla’s \n\n, GM EV customers are finally able to purchase an approved adapter and gain access to hundreds of thousands of Tesla chargers.\n\nToday’s news has been a long time coming for GM-branded EV drivers. It is another massive step in the American auto industry’s adoption of a truly universal charging plug.\n\nIn June 2023, GM was one of the first OEMs to announce a transition from the CCS plug to Tesla’s NACS. It shared that future BEV models will feature the port natively, and existing BEVs could access the charging network via an adapter.\n\nSince then, we’ve seen virtually all automakers adopt NACS and begin sourcing approved Tesla adapters, including Ford, Hyundai, BMW, \n\n, to name a few. \n\nUS charging networks like ChargePoint have also begun rolling out \n\nof all makes and models, helping increase the versatility of local networks and alleviate some of the stressors EV drivers currently face when they need a charge and don’t have the correct plug or aren’t certified to access a specific charging network.\n\nWhile we await future GM models with Tesla NACS plugs built in, the American automaker has begun selling an approved adapter that gives its EV drivers immediate access to many Level 2 and DC fast chargers on Tesla’s current network.\n\nAccording to a release from GM today, its approved NACS adapter is on sale now through GM vehicle brand apps, offering those drivers access to Tesla’s Supercharger network – one of the largest and most dependable in the US right now.\n\nFinally!!\n\nGM Access to supercharging has been incoming for months now.\n\nThere are a lot of Bolts out there. Be interesting to see if they start rolling up to superchargers in the coming months.\n\nThe NACS adapter allows GM customers to access nearly 232,000 public chargers, including 17,800 Tesla Superchargers. GM Energy vice president, Wade Sheffer, spoke:\n\nGM’s ongoing efforts to help accelerate the expansion of public charging infrastructure is an integral part of our commitment to an all-electric future. Enabling access to even more publicly available fast chargers represents yet another way GM is focused on further improving the customer experience and making the transition to electric more seamless.\n\nPer GM, EV drivers of its portfolio of marques will be able to purchase the Tesla adapter through their respective apps for $225. They can then use that same app to locate the nearest available Tesla Superchargers, check station status, initiate a charge and pay for their session.\n\nGM states that each Tesla adapter has been developed to ensure customers can charge their EV at any charger that offers the North American Charging Standard. The American automaker is leveraging several suppliers to produce them to ensure everyone who wants one can get one.\n\nThe automaker states that the adapters will begin rolling out in the US immediately, followed by Canada later this year. You can \n\n.\n\n ", "url": "https://electrek.co/2024/09/18/gm-releases-approved-nacs-adapter-givingaccess-tesla-charging-network/", "image": "https://electrek.co/wp-content/uploads/sites/3/2024/09/GM-Tesla-adapter-Chevy.jpg?quality=82&strip=all&w=1400"},
{"title": "NIO begins revamped EL8 SUV deliveries in Europe, despite imposed tariffs", "author": "Scooter Doll", "text": "Three months after opening up sales of its ES8 SUV in Europe, \n\n has begun customer deliveries. The refreshed all-electric SUV, renamed the EL8 for the European market, is the sixth NIO model to enter Europe, and the Chinese automaker is showing no signs of slowing down, even as the EU Commission imposed tariffs on imports.\n\nEarlier this summer, NIO \n\n off its Hefei assembly line. That milestone build was the Chinese automaker’s ES8 SUV, which started it all. That model has become a cornerstone of NIO’s expansion into Europe, which \n\n in 2021.\n\nPreviously, NIO sold five all-electric models in the EU, including ET7, ES7, ET5, ET5T, and ES6. However, due to nameplate disputes with Audi, the Chinese automaker had to change the model badges of its SUVs to “L” instead of “S.”\n\nIn December 2022, NIO announced a refresh for the ES8 (EL8), initially built on the automaker’s NT 1.0 platform. The refresh included the newer NT 2.0 platform and LiDAR, plus later updates to the 2024 models, such as a chip upgrade to the cockpit.\n\nIn June, NIO announced that its flagship ES8 SUV had officially launched in Europe as the EL8, despite \n\n on Chinese imports. Today, the Chinese automaker is celebrating initial deliveries of the SUV to customers in Europe.\n\nNIO shared images of its first EL8 SUV deliveries to customers around Europe via its \n\n earlier today, imploring local customers to seek out more information about the Chinese brand to promote EV adoption and sustainable travel. Per the post:\n\nOn September 16, NIO EL8 (ES8 in the Chinese market) started delivering the first batch of users in Europe. We welcome more friends to join the NIO family and start a new journey of “calmness and moderation” together to create a sustainable and better future. Follow NIO and repost the comment about which landmark in Europe you most want to see ES8 go to. We will randomly select 3 friends to give away NIO Life coffee mugs.\n\nThe EL8 SUV on the NT 2.0 Platform is now the sixth NIO model to officially enter the Europe and is currently available in Denmark, Germany, Norway, Sweden, and the Netherlands. The persistence to expand comes at a tumultuous time overseas, as the EU has imposed tariffs on Chinese-built EVs by up to 48%. \n\nNIO, which has cooperated with the EU Commission’s investigation, is currently facing a \n\n imported into the region. Despite the cooperation, NIO has publicly opposed the tariffs, and its founder and CEO, William Li, has stated that the automaker’s stance remains unchanged and will continue to sell its imported BEVs. \n\nPart of that expansion also includes battery swap stations, which had tallied 43 locations as of June 2024, alongside 45 regional superchargers and over 600,000 third-party chargers available to its customers. Today, NIO says it has 56 battery swap stations in operation throughout Europe, including 19 in Norway, 18 in Germany, and 10 in the Netherlands.\n\nThe NIO EL8 SUV is on sale in Europe now.\n\n ", "url": "https://electrek.co/2024/09/18/nio-begins-revamped-el8-suv-deliveries-in-europe-despite-imposed-tariffs/", "image": "https://electrek.co/wp-content/uploads/sites/3/2024/09/NIO-SUV-Europe-EL8-family.jpg?quality=82&strip=all&w=1400"},
{"title": "Revel just added Juice’s ‘face ID for EVs’ to its DC fast chargers", "author": "Michelle Lewis", "text": "Revel has added Juice’s groundbreaking AI and computer vision-powered automatic charging and payments system to its DC fast charging stations in New York City.\n\nComputer vision uses AI and machine learning to process visual data to identify objects and then react to what it sees.\n\nSunnyvale, California-based \n\n uses computer vision to identify a user’s unique EV, initiate charging sessions, and complete payments without needing to interact with physical payment devices or apps. Unlike Plug & Charge or Autocharge, Juice’s technology doesn’t require OEM integrations to work with different types of EVs.\n\nBrooklyn-based \n\n asserts that this is the first deployment of this kind of computer vision technology in the US. \n\nThe new Juice technology is now available on all Revel DC fast chargers and is compatible with all makes and models of EVs. Revel says it will integrate Juice’s computer vision technology at future sites opening later this year. \n\nRevel has 54 DC fast chargers open to the public across three sites in Brooklyn and Queens and plans to quadruple that network by mid-2025 with new locations, including a mega 60-stall station in Maspeth, Queens, and a 48-stall station outside LaGuardia Airport. Revel is opening its first downtown Manhattan charging station later this year on Pier 36. \n\nBecause Revel has a charging \n\n, rideshare drivers make up the majority of Revel’s public charging activity.\n\n“Revel is the perfect fit for our platform, with high usage at all of their charging locations, combined with the sheer size of their expanding network in America’s densest city,” said James Murfin, CEO & cofounder of Juice. “This partnership demonstrates how EV charging can be as seamless as unlocking your phone with your face. Only experiences that are truly this easy will help the world move to sustainable transport at scale.”\n\nThe company also has seven sites in development across the Bay Area and recently announced its first lease in downtown Los Angeles. \n\nYou pull up. The charger recognizes your EV the way your iPhone recognizes your face, and once you plug it in, it begins to charge. It takes payment. You unplug. You leave. It doesn’t matter which EV you drive. It just works for everyone.\n\nIf this actually works as it’s supposed to, this could change everything about the fast charging experience. Prior to Revel’s Juice launch, xCharge launched the first Juice-enabled public charger at their Austin headquarters in August. This company and this technology are definitely one to watch. \n\n ", "url": "https://electrek.co/2024/09/18/revel-just-added-juices-face-id-for-evs-to-its-dc-fast-chargers/", "image": "https://electrek.co/wp-content/uploads/sites/3/2024/09/Revel-DC-fast-charger-Bed-Stuy-NYC.jpg?quality=82&strip=all&w=1600"},
{"title": "Lotus’ wild 200mph ‘Theory 1’ EV signals return to form for the brand", "author": "Jameson Dow", "text": "Lotus has unveiled a new EV concept which it calls “Theory 1,” a lightweight(-ish) electric sportscar concept inspired by the Lotus Esprit with nearly 1,000hp and capable of speeds up to 200mph.\n\nHere at \n\n, we see and report on a \n\n \n\n \n\n \n\n \n\n. These concepts are often accompanied by long treatises on how the design incorporates various “core principles,” unnecessary branding of things that will never make it to production, and \n\n.\n\nIn a way, the Theory 1 is no different. My eyes glazed over at the 2,000+ words in Lotus’ \n\n before reaching the table of technical specs.\n\nAnd yet, there is still something here, because this is Lotus – a company with an incredibly significant motorsport heritage… and a significant electric car heritage too.\n\nLotus is the company that provided the lightweight “gliders” on which the original Tesla Roadster, the car that started the modern electric vehicle era, was built.\n\nAnd lately, Lotus has gotten into electric cars on its own, with the \n\n and the consumer-focused \n\n and \n\n.\n\nBut you’ll notice – one of those things is not like the others. Despite being a company famous for its focus on small cars, owing to founder Colin Chapman’s theory to “simplify, then add lightness,” the Eletre and Emeya are both over 5,500lbs, more than twice the weight of the original Tesla Roadster.\n\nAnd so, Lotus’ new Theory 1 – packed full of probably-unrealistic concept features, but also clearly going downmarket from the Evija’s eyewatering $2million pricetag – could signal somewhat of a return to form for the wayward small-car maker.\n\nThat’s because its curb weight is listed at a much more reasonable 1600kg, or 3,527lbs. This is still hefty compared to the absolute lightest vehicles on the road right now, but it’s on the lower end of most powerful sportscars available today (including lighter than the Evija), quite low compared to other EVs, and significantly less than some \n\n.\n\nIt’s also a lot more than the original Lotus Esprit which the Theory 1 takes inspiration from, which began at around 2,000lbs. But later versions of the same vehicle weighed as much as around 3,000lbs, not too far off from the Theory 1.\n\nIn that relatively small package, Lotus claims it has fit some great performance specs.\n\nIts 986hp powertrain is capable of sprinting 0-100km/h (62mph) in less than 2.5 seconds, with a top speed of 320km/h (198mph).\n\nEnergy comes from a 70kWh battery with a 250 mile range. This is a little smaller than some of the larger batteries we’ve seen around (the Eletre has a 112kWh battery, for example), but that’s the benefit of having a light, low-slung vehicle.\n\nBut specs don’t tell everything about how a vehicle feels to drive. And Lotus is promising to bring exceptional driving dynamics to this vehicle, through methods like including the motor and battery as stressed members and mounting the rear wing directly to the suspension assembly.\n\nIt also wants to use steer-by-wire, a technology which has been thought about for a long time but only recently has made its way into production vehicles, like the Lexus RZ and Cybertruck.\n\nBut perhaps the most striking part of the driver experience on the Theory 1 is its 3-seat design, seating the driver in the center of the vehicle, similar to the famed McLaren F1.\n\nThe car’s light weight comes from extensive use of advanced materials like carbon fiber and titanium, which are sure to boost the price of this vehicle if they make it to production. In that previously-mentioned 2,000 words, there’s plenty of talk about 3D printing and recycled materials as well.\n\nBut Lotus says that it wants to reduce the amount of “A-surface materials” – those you can touch – down to 10 or fewer, compared to the 100-or-so in most cars.\n\n“There’s been this period of maximalism, and people having to do one-upmanship and go above, above, above. And I think we’ve reached that point where it plateaus in stylistic terms, and also in the demonstration of tech. We’re not in a crazy numbers race with this car.”\n\n -Lotus design VP Ben Payne, as \n\nSo the original Lotus philosophy of “simplify, then add lightness” is certainly present in this concept, signaling a return to form for the brand after a few years of wandering in the desert.\n\nWell I'll say this... It looks built electric. And that has always mattered to me when it comes to EV design. A lot. You can see it. Not so much the body. That's just aerodynamics with flair. Great as it may be. I'm talking about the proportions. Plus I'm a fan of lean design. Not minimalist... Fit. A minimalist design, though nice looking, can still be poorly executed. Not the case here. So even the interior speaks to me. Fit AF.\n\nI think it does them proud.\n\nFinally, while we are just talking about a concept here, we’ve certainly seen plenty of EV concepts \n\n in some way or another. Even particularly wild ones like the \n\n ended up being made into the \n\n sportscar.\n\nSo we might even see this Theory 1 show up on the road at some point. But, even if we don’t, at least it shows that Lotus is back to thinking about \n\n (as they should have been all along…), and we’ll hopefully get a real EV sportscar out of them in a few years.\n\n ", "url": "https://electrek.co/2024/09/17/lotus-wild-200mph-theory-1-ev-signals-return-to-form-for-the-brand/", "image": "https://electrek.co/wp-content/uploads/sites/3/2024/09/Theory-1_EXT-SIDE-A-e1726607699878.jpg?quality=82&strip=all&w=1600"},
{"title": "Tesla throws cold water on Supercharger extension cords", "author": "Fred Lambert", "text": "A Tesla engineer is throwing cold water on Supercharger extension cords – an idea that is gaining traction to solve the charge port location issues as Tesla onboard other EVs on the Suercharger network.\n\nThe opening of the Supercharger network to non-Tesla electric vehicles has created a problem where some of those EVs don’t have their charge port at the same position as Tesla vehicles: back on the driver’s side.\n\nIt results in awkward parking positions.\n\nTesla’s new Supercharger V4 stalls solve that with longer charging cables, but most Superchargers are still V3s, which are problematic and can result in some EVs blocking another charging station.\n\nThe idea of using extension cords for Superchargers has been brought up as a temporary solution and \n\nearlier this year.\n\nBut now Wes Morrill, Tesla’s lead Cybertruck engineer, has thrown some cold water on the idea. (via \n\n):\n\nI would recommend AGAINST using an extension cord on a supercharger (or any DC charging station with a liquid cooled cable). Have seen multiple instances of the cable overheated and shorting DC +/-.\n\nTo be fair, he is recommending against using existing extension cables for the Supercharger, which are made by third parties.\n\nHe added about the problem with extension cables:\n\nThere’s a temperature measurement in the handle and the supercharger derates based on that temperature. With the extension cable that safety goes away. On top of adding an additional junction which generates heat making matters worse.\n\nDon't want people to use extension cords? Swap more v3 stations to v4 and add more pull through charging.\n\nTesla could possibly fix those things with its own solution, especially by adding temperature measurements on the new handle on the extension cord.\n\nMorrill said that he would discuss directly with a third-party Supercharger extension cable manufacturer to explain his concerns.\n\nHowever, temperature management would remain an issue as it is hard to imagine how they could make the extension liquid-cooled like the regular cable. \n\nSome did speculate that a Tesla extension cord would come with charge rate limitations to counter this issue. What do you think? Let us know in the comment section below.\n\n ", "url": "https://electrek.co/2024/09/18/tesla-throws-cold-water-on-supercharger-extension-cords/", "image": "https://electrek.co/wp-content/uploads/sites/3/2024/03/Tesla-supercharger-extension-cable.png?w=1456"},
{"title": "BYD’s $10,000 Seagull EV was the top-selling car in China last month", "author": "Peter Johnson", "text": "BYD’s cheapest electric car, the Seagull, was the top-selling car in China last month, with nearly 41,000 models sold. Starting at under $10,000, the \n\n Seagull even has US automakers worried.\n\nBYD has been on a roll, launching lower-priced, updated models of its best-selling models. In March, BYD launched the \n\n with a “shocking price” starting at just 69,800 yuan, or less than $10,000.\n\nJust five months later, BYD launched the 2025 Seagull with the same starting price. The Seagull is already sitting atop the sales charts in China.\n\nAfter a \n\n, BYD topped one million EV sales in 2024. The company sold a record over 373,000 new energy vehicles (including PHEVs) in August. Of them, 148,470 were all-electric.\n\nBYD’s Seagull was the top-selling vehicle in China in August, with 40,949 models sold. The company said the Seagull is now China’s best-selling A00 class model and pure electric car for the sixth consecutive month.\n\nThe Seagull EV is available in three trims in China with two \n\n options (30.08 kWh or 38.88 kWh), providing up to 252 miles (405 km) CLTC range.\n\nBYD’s low-cost EV has earned the nickname “mini Lamborghini” as former Lamborghini designer Wolfgang Egger led the Seagull’s design.\n\nInside, the Seagull is loaded with BYD’s latest tech and software, including a 10.1″ rotating infotainment with DiLink intelligent network connection.\n\nBYD is selling the Seagull EV overseas as the Dolphin Mini. In Brazil, the Dolphin Mini (Seagull) starts at around $20,000 (99,800 BRL). It’s roughly the same in Mexico at 358,800 pesos, or around $19,000.\n\nBYD’s cheapest EV is \n\n in and outside of China. Even Ford’s CEO Jim Farley called the Seagull a “pretty damn good” car, warning rivals of BYD’s low-cost EV. In comparison, Ford only sold 8,944 EVs combined last month.\n\nThe Seagull is expected to launch as one of the most affordable EVs in Europe, starting at under 20,000 euros ($21,500).\n\nAlthough several automakers have promised to launch lower-priced EVs, will they be able to keep up with BYD? And, more importantly, still earn a profit?\n\nBYD has control over almost every part of the manufacturing process for their vehicles. Legacy auto has no chance against this advantage. China has been gearing up for the EV world adoption for over a decade now. If BYD can sell it's cars at 100% markup and still be lower priced than the others, how are they going to compete with that?\n\nAccording to AutoForecast Solutions CEO Joe McCabe, BYD’s Seagull would still be \n\n at under $25,000, even with a 100% tariff.\n\nNorth American CEO Stella Li has already said BYD has no plans to launch passenger EVs (they already sell electric buses) in the US. However, that won’t stop the Chinese auto giant from taking market share in other markets like Mexico, Southeast Asia, Europe, and \n\n.\n\nBYD, which started as a battery maker, already has a significant advantage with an established supply chain. The company’s “liberation battle” against gas-powered vehicles appears to be working so far. BYD said its main goal is to take market share from ICE vehicles while promoting electric cars.\n\n ", "url": "https://electrek.co/2024/09/18/byds-10k-seagull-ev-top-selling-car-china-last-month/", "image": "https://electrek.co/wp-content/uploads/sites/3/2024/04/BYD-cheapest-electric-car.jpeg?quality=82&strip=all&w=1400"},
{"title": "Hyundai’s $23K Casper EV is getting a new XRT variant: Here’s our first look [Video]", "author": "Peter Johnson", "text": " low-cost Casper Electric (also known overseas as the Inster EV) is getting a rugged new XRT variant. The new Casper EV XRT trim was spotted for the first time in Korea ahead of its official debut.\n\nHyundai \n\n in June at the Busan International Mobility Show in South Korea.\n\nThe new low-cost EV stole the show with a compact but still functional design. Despite its small size, Hyundai expects it to have a significant impact with its “potential to accelerate the popularization of electric vehicles.”\n\nHyundai \n\n in its home market with starting prices at just $22,800 (31.5 million won).\n\nWith government incentives, Hyundai said the entry-level “Inspiration” model can be bought for as little as $14,500 (20 million won).\n\nThe new EV is “the most attractive choice” for many buyers looking to go electric, according to Hyundai. With a 49 kWh battery, Hyundai’s Casper Electric has up to 195 miles (315 km) range on a single charge.\n\nAt 3,825 mm long, the all-electric Casper is even smaller than the \n\n, but Hyundai says it’s perfect for city travel. It’s actually bigger than the gas-powered Casper (230 mm longer and 15 mm wider), with more room for rear passengers.\n\nHyundai’s Casper EV is already getting a new XRT variant. The off-road-focused model was spotted in Korea ahead of its official launch.\n\nDespite the camouflage, the video from \n\n reveals aggressive new design elements. The reporter notes Hyundai’s new trim “felt a bit strong” and gives “a hint like the GT.”\n\nThe turn signals and headlights remain the same, but the front bumper appears completely redesigned.\n\nHyundai’s Casper Electric is being shipped overseas as the Inster EV. In Europe, the Inster starts at $27,000 (25,000 euros) and has a WLTP range of up to 220 miles (355 km).\n\nFor those in the US, There’s good and bad news. The bad news is that Hyundai is not expected to launch the Casper (Inster) EV in the US. However, the good news is that the upgraded 2025 IONIQ 5 will begin arriving at US dealerships this fall.\n\nThe \n\n has more range and features, and it comes with an NACS port to access Tesla’s Supercharger network. It will also be available in a new XRT trim.\n\nHyundai’s IONIQ 5 XRT was spotted out in public for the first time this week, revealing aggressive new design elements (\n\n).\n\nWhat do you think of the new XRT variants? Will Hyundai’s rugged new EVs live up to the hype? Let us know your thoughts below.\n\n ", "url": "https://electrek.co/2024/09/18/hyundais-23k-casper-ev-spotted-new-xrt-variant-video/", "image": "https://electrek.co/wp-content/uploads/sites/3/2024/08/Hyundai-Casper-EV-price.jpeg?quality=82&strip=all&w=1400"},
{"title": "Rare $1,090 bundle discount on Xtracycle Stoker off-road cargo e-bike, Anker SOLIX C800 $399 low, Segway Max G30LP, more", "author": "Reinette LeJeune", "text": "We’ve got another day of low prices on popular Green Deals, with EVs and the means to keep them juiced for riding – especially if you’re away from home on trips. Leading the group is a rare $1,090 bundle discount on \n\n that is down at \n\n. We have a new low price on \n\n. The only scooter in today’s lineup, \n\n is back down at \n\n, while \n\n prepares for autumn adventures at \n\n. At the tail-end we have Amazon’s best price on the \n\n. Plus, all the other hangover Green Deals in the links at the bottom of the page, like yesterday’s exclusive discount on the \n\n, and more.  \n\nHead below for other New Green Deals we’ve found today and, of course, \n\nand \n\n. Also, check out the new \n\n.\n\nCoinciding with the pre-order launch special being offered by Xtracycle on its \n\n, which we were quite excited by in our\n\n (with a review coming soon), the brand is offering a bundled discount on its \n\n that drops costs to \n\n. Normally this higher-end e-bike would run you $4,499 on most days, with far less frequent discounts across the brand’s entire lineup than its competitors. You’re looking at a $500 markdown on its usual going rate, but what makes this deal all the better is the inclusion of a free Everyday Rider Bundle that you’ll get free of charge. The bundle includes an everyday bike pack, a 40L cargo bag that goes right onto the bike, a magic carpet padded cushion for passengers, and a Hooptie rail system for when those passengers may be on the younger sides of life – all valued at $590 for a total of $1,090 in savings.\n\nXtracycle’s \n\n cruises streets, trails, and more – all while hauling your most precious cargo along with you, whether that be packages, groceries, or even children. The chromoly steel frame houses a 630Wh battery that juices the Shimano STEPS EP-8 motor to reach up to 20 MPH with its pedal assistance support (but there are no throttles here). This model boasts a 400-pound payload overall, with it able to carry the weight 30 to 60 miles on a single charge, depending on conditions.\n\nXtracycle has given the Stoker e-bike a pair of 24-inch NICA’GNAR Cargo Tires to tackle terrain, with fenders over both and 4-piston hydraulic disc brakes for ensured stopping power. Its integrated cargo rack (which is only bolstered for added support with all the free goodies) comes along with other features like the Sram NX11 X-HORIZON derailleur, integrated LED headlights and taillights, and an E-series cycling computer that gives you easy handlebar access to controlling your settings as you ride.\n\nRunning alongside its ongoing \n\n, Anker’s official Amazon storefront is offering its \n\n, \n\n. This model is normally priced at $599, with discounts often dropping parallel to the C800 Plus model, most often down to $449, which has been ousted today with this 33% markdown that lands it at a new all-time low price. It also happens to \n\n.\n\nThe \n\n is a reliable camp support that you’ll be happy to have and not need over needing it and not having one. It delivers a reliable 768Wh LiFePO4 battery capacity, pumping out up to 1,600W of power at a time, and comes ready to recharge your devices and small appliances with its 10 output ports: a single car port, two USB-C, two USB-As, and five ACs. It features the usual array of smart controls you expect from an Anker station, accessed through the companion app so you can keep an eye on its levels or adjust settings as you prefer them. Recharging takes as little as 58 minutes when you plug it into a standard wall outlet, or you can connect up to 300W of solar input to take advantage of solar charging when the sun is out.\n\nIt’s \n\n sibling is also down at the lowest rate we’ve tracked for \n\n, \n\nThe difference here is that the extra $50 gets you two water-resistant LED camping lights with three different lighting modes to choose from – plus, they stow away right inside the top of the unit to be recharged while not in use. It also comes with a retractable pole arm that you can use as a hanger, tripod, or even a selfie stick. There are also some discounted bundle options on the same landing page, which add either a 100W or 200W solar panel to the mix, as well.\n\nYou can check out all the \n\n while they last through September 22.\n\nOver at Amazon, we’ve just spotted Segway’s popular \n\n. Normally priced at $700, after falling from a higher $750 tag back at the top of 2024, we’ve been seeing a consistent slashing of prices throughout the year so far, with prices mainly keeping between $600 and $615, while occasionally falling further to $550, as well as the $500 low. Even during Prime Day sales we only saw it drop to $613, with today’s deal coming in with an even larger 29% markdown, saving you $200 and returning it back to its all-time lowest price that we have tracked. It also \n\n, which also lists it at a higher $800 MSRP.\n\nI know several people who have made this model and the \n\n their primary means of travel around NYC, and not one has complained nor replaced the scooter in the last few years. \n\n makes a great starter EV or even an upgrade from older models with its 350W motor and the 36V 367Wh battery that gives you up to 25 miles of travel while topping out at 18.6 MPH. It can even handle inclines up to 20% which may not seem like much, but it’s double a lot of other models under the brand’s flag.\n\nThere are three riding modes with this model – speed limit, standard, and sport – with mileage varying based on which of these settings you choose. Things are balanced more here with this model as the smart battery management system not only monitors battery functions for safety purposes but also utilizes regenerative braking to recycle energy and extend travel times. There’s dual braking and a foldable frame here, much like other Ninebot models, a built-in LED headlight, smart controls via the companion app, and an LED digital dashboard too.\n\nThrough its official Amazon storefront, Goal Zero is giving folks the best rate we’ve seen on its \n\n,\n\n. This model was listed at $5,000 at the start of 2024 (still is direct from Goal Zero), with the first few rounds of discounts through March bringing costs down to $2,999, which seems to have become its new going rate since. From April on, we’ve only seen occasional falls by $500 to the former $2,500 low, but today’s 17% markdown has come in to usurp the title as the lowest price we have tracked.\n\nWith so many friend groups and families gearing up to enjoy outdoor autumn experiences, Goal Zero has provided \n\n to run appliances and keep most everyday devices charged – even EVs you’ve brought along! You’ll get 6,071Wh of battery capacity with this unit, which also provides up to 2,000W of output power (peaking at 3,500W when needed) that can tackle emergency black-outs alongside trips away from home. There are plenty of versatile output port options as well: two 120V AC ports that support a combined load of 2,000W, a fast-charging 60W USB-C port, three USB-A ports, a regulated 12V port, and a bonus 12V car charger.\n\nThe Yeti 6000X’s battery can be fully recharged in 12 hours when plugged into a standard wall outlet, meaning you can plug it in the day before you’re departure and have plenty of time to spare. It can also refuel the battery with a maximum 600W solar input within 18 to 36 hours, depending on conditions – plus, there’s the full array of smart controls accessed through its companion app, letting you monitor and adjust settings.\n\nThrough its official Amazon storefront, GoTrax is offering its \n\n, \n\n. Normally this newer model would run you $600 lately, which it has largely remained at since releasing during the summer of last year. We saw its first discount in August 2023 bring costs down to this same amount, which was repeated three times in the first four months of 2024, before a later drop to $612 in mid-August. Today, costs are getting brought back down to the best rate that we’ve seen on Amazon since it first hit the market, saving you a solid $60 on this affordable commuting solution.\n\nThis \n\n provides plenty of support to get you where you need to be, without burning a hole through your finances like some higher-end solutions. It arrives with a 350W motor (peaking at 500W) and a removable 36V 7.8Ah battery that will have you zipping around at 15.5 MPH, perfect for leisurely rides around the neighborhood or your daily to commutes to work – plus, it features a folding design so where ever you end up, storage is far less of a hassle.\n\nThere are two riding modes here to choose from, aside from just riding it like any other bike – you can either go full electric with the throttle for up to 15.5 miles or you can be supported by the pedal assistance that extends that range up to 28 miles. It also comes stocked with dual-mechanical disc brakes, an LED headlight, 16-inch one-piece rims, a rear shock absorber, and simple controls on the handlebars to switch between settings.\n\nThe savings this week are also continuing to a collection of other markdowns. To the same tune as the offers above, these all help you take a more energy-conscious approach to your routine. Winter means you can lock in even better off-season price cuts on electric tools for the lawn while saving on EVs and tons of other gear.\n\n ", "url": "https://electrek.co/2024/09/18/xtracycle-stoker-e-bike-solix-c800-segway-max-g30lp-more/", "image": "https://electrek.co/wp-content/uploads/sites/3/2024/09/Xtracycle-Stoker-Off-Road-Cargo-e-bike.webp?w=1200"},
{"title": "Tesla Semi partner PepsiCo says electric truck helps with driver retention", "author": "Fred Lambert", "text": "PepsiCo, Tesla’s first customer for the Tesla Semi electric truck, gave an update on how its deployment of the electric truck is going and it is going “smoother than expected”.\n\nIt even helps with driver retention.\n\nTruck driving is a difficult, thankless job that pays well, but like many other difficult jobs, it has had serious staffing issues for a long time now.\n\nCould electric trucks help?\n\nThis is a bit counter-intuitive as many truck drivers are petrolheads who are not your typical electric vehicle buyers. It’s hard to imagine a bunch of truckers excited to drive an electric truck, but that’s exactly what PepsiCo claims.\n\nYesterday, we reported on \n\n.\n\nAt the same conference today, Priestley sat down with Dejan Antunović, PepsiCo’s head of electriciation for a “case study” of the brevage and snack company’s deployment of Tesla Semi trucks:\n\nFor a “case study”, they didn’t dive too deep into details, but they did push the message that the deployment is going great.\n\nAntunović insisted that the program is going “smoother than expected” and especially with the drivers who are giving positive feedback. The manager went as far as saying that the electric truck helps with driver retention.\n\nFirst off, Antunović explained what are the company’s trucking needs and how Tesla Semi electric trucks are used in that fleet.\n\nPepsiCo is using the Tesla Semi across three of its fleets:\n\nCurrently, PepsiCo’s Tesla Semi trucks are based at three depots in California: Modesto, Sacramento, and Fresno. The Modesto depot operates 15 Tesla Semis, all used for regional long-haul routes. In Sacramento, there are 21 Tesla Semis, with 18 assigned to local routes and 3 to regional long-haul routes. The Fresno depot manages 50 Tesla Semis, 45 of which run local routes, while 5 handle regional long-haul routes.\n\nThat’s 89 Tesla Semi trucks.\n\nPepsiCo is believed to be a good test partner for electric truck deployment due to their needs for both short and long haul as well as their lighter snack loads and heavier brevage loads.\n\nGiven how much nicer I've found driving an EV to be for the few hours a week I do: I'm not at all surprised that commerical drivers (who spend a whole workweek behind the wheel) don't want to go back to a conventional truck.\n\nQuieter, better torque and responsiveness, not smelly, etc. Sounds great to me.\n\nWithout going into the details about cost, PepsiCo appears to back Tesla’s claims that Tesla Semi can replace a diesel truck one-for-one in term of capacity and cost.\n\nThe purchase cost is expected to be much more expensive. However, Tesla says that its focus is on Total Cost of Ownership (TCO), which benefits EVs thanks to fuel savings.\n\nDuring the talk, Priestley said that efficiency has the biggest impact on Tesla Semi’s TCO as the more efficient Tesla makes the truck, the bigger the difference in fuel savings.\n\nYesterday, Tesla claimed that the electric truck is achieving \n\n, which is better than originally expected. Previously, third-party testing proved that PepsiCo’s Tesla Semi had \n\n.\n\n ", "url": "https://electrek.co/2024/09/18/tesla-semi-partner-pepsico-says-electric-truck-helps-with-driver-retention/", "image": "https://electrek.co/wp-content/uploads/sites/3/2022/12/Tesla-Semi-PepsiCo-truck-uTutrifor.jpg?quality=82&strip=all&w=1600"},
{"title": "Gazelle launches three new lower-cost Bosch mid-drive e-bikes in US", "author": "Micah Toll", "text": "Bosch-powered electric bikes rarely get to share the same sentence as the word “low cost,” but Gazelle has a history of bringing quality Dutch-made mid-drive e-bikes to US customers at reasonable prices. The brands’ latest launches in the US keep that legacy alive, delivering new 2024 versions of the \n\n.\n\nThese aren’t the same Gazelles we’ve seen in the US for the last few years, but rather newly designed updates that feature novel frames, updated looks, and a focus on serving a wider range of riders.\n\nOne major difference in the frame is the inclusion of a true step-through design, which is becoming more common among e-bike makers with several recently released models of purely step-through bikes, eschewing the once common strategy of building both step-over and step-through frames.\n\nProper frame geometries and welding techniques, which you’d better believe a 130-year-old Dutch bicycle company has mastered, have largely made that top tube obsolete for many frame styles. Case in point: the new Gazelle Medio T9 and Medio T9 City models.\n\n“A re-engineered frame with improved stiffness and stability makes it easier to step on and off, especially in urban environments or for older riders,” explained the company.\n\nThe new T9s are some of the most affordable Bosch-powered mid-drive e-bikes available in the US, starting at US $2,299 for the T9 City and US $2,599 for the all-road T9.\n\nBoth models sport similar step-thru frames that come in four sizes, including a new XS size to fit shorter riders of 4’9″ to 5’2″ (145 to 157 cm). Both models can also reach 20 mph (32 km/h) on pedal assist, making them Class 1 e-bikes. The pair of bikes include 75mm-travel spring suspension forks from Suntour, dual-piston hydraulic disc brakes from Shimano, and come with commuter-focused standard components such as fenders, rear rack, LED lighting, and frame locks that secure the rear wheel to the bike.\n\nThe T9, which is designed for more all-road conditions than the urban-centric T9 City, gets an upgraded Shimano Alivio 9-speed drivetrain and a more powerful Bosch Active Line Plus motor with 50 Nm of torque, compared to the Bosch Active Line’s 40 Nm of torque on the T9 City. The more powerful motor is paired with a larger 545 Wh battery, upping the 400 Wh battery that comes with the T9 City.\n\n, the switch to an on-tube battery helps lower the center of gravity of the bikes.\n\nFor riders who want to go a bit more premium, the new Gazelle Ultimate C8 might be the better choice. The Ultimate C8 combines its step-thru frame with a Gates Carbon Drive belt-drive system and a Shimano Nexus 8 internally geared rear hub.\n\nThe bike features a mono-integrated suspension stem in the fork offering 40mm of travel, higher-end LED lighting, an MIK-compatible rear rack for mounting a wide range of accessories, \n\nThe drivetrain on the Class 1 Ultimate C8 consists of a Bosch Active Line Plus motor and a 500Wh Bosch battery.\n\nPriced at US $3,999, the Ultimate C8’s higher end components and drivetrain price it a bit higher, yet without reaching the upper end of Gazelle’s more European-leaning flagship models with flagship prices.\n\n“We’re thrilled to bring high-quality ebikes to the North American market at a price that makes them accessible to more riders,” said Mark Danhof, General Manager for Gazelle North America. “With our latest models, consumers don’t have to compromise on safety, reliability, or features. Our ebikes are designed to offer top-notch performance and convenience, ensuring every ride is enjoyable and worry-free.”\n\nGazelle’s expansion into the US market and the updated designs that accompany it are great news for riders who want the more robust, premium European-style electric bikes common across the pond but don’t want to spend an entire paycheck or two to get there. \n\nThese updates help bring Gazelle’s best-selling e-bikes in the US to a more modern look (no one will miss the rack batteries!) while retaining what keeps them Dutch. Oh, and the new smaller frame size option is going to be quite welcome, as well. \n\na couple of years ago and spent much of the time with a stiff neck from looking up at the friendly Gazelle staff towering above me. Let’s just say they’re built differently, and so a smaller frame size for shorter Americans couldn’t come soon enough.\n\nWhile these aren’t going to be the flashiest models out there, they offer great production quality and the peace of mind that comes from having one of the oldest bicycle companies in existence standing behind these products.\n\n ", "url": "https://electrek.co/2024/09/18/gazelle-launches-three-new-lower-cost-bosch-mid-drive-e-bikes-in-us/", "image": "https://electrek.co/wp-content/uploads/sites/3/2024/09/gazelle-t9-head.jpg?quality=82&strip=all&w=1600"},
{"title": "Volkswagen weighs another plant closure, this time in China as domestic EVs take control", "author": "Peter Johnson", "text": " is facing another possible plant closure, this time in China, the company’s largest market. Although China is VW’s biggest market, domestic EV makers, like \n\n, are squeezing out the competition.\n\nDue to slowing demand, Volkswagen and its Chinese joint venture partner, SAIC Motor, plan to close a factory or slow production.\n\nAccording to a \n\n from \n\n, SAIC Volkswagen is preparing to close a plant in Nanjing. Sources familiar with the matter said it could happen as early as next year.\n\nThe site makes VW Passat and Skoda vehicles with up to 360,000 annual production capacity. SAIC Volkswagen has already halted production at one plant, and a second is slowing production, with a possible closure in sight.\n\nLast year, production across VW’s (39) plants in China was still a quarter below its peak before the pandemic.\n\nAs domestic automakers gain market share with low-cost EVs, gas-powered vehicles, especially from foreign brands, are quickly falling out of favor.\n\nVolkswagen’s Skoda brand is among those whose sales are sinking in China. Sources said production at a plant in Ningbo that builds Skoda models has been halted for several months at a time and could also face closure.\n\nVW China responded to \n\n, saying, “All SAIC Volkswagen factories are operating normally according to the market requirements and our forecast.”\n\nThe emailed statement added, “We are also transforming vehicle production and the components plants step by step” for smart electric vehicles.\n\nAccording to the sources, the plant could be due for an overhaul. Volkswagen hopes to reverse the sales slump by partnering with domestic automakers like XPeng and SAIC to launch more competitive models for Chinese buyers.\n\nThe news comes as domestic EV makers, including BYD, are taking control of the market with aggressive price cuts and new lower-priced models.\n\nSales of electric and hybrid models climbed 43% last month in China compared to August 2023, topping the 1 million mark (1.03 million).\n\nThe surge of lower-priced models is fueling China’s rapid shift to electric. For example, BYD’s cheapest electric car, \n\n, starts at under $10,000 (69,800 yuan) in China.\n\nVolkswagen’s struggles are not limited to China. The company is also struggling in its home market. For the first time in its 87-year history, VW is \n\n in Germany. VW’s CFO, Arno Antilitz, said the problem was overcapacity as Europeans are buying fewer vehicles.\n\n ", "url": "https://electrek.co/2024/09/18/volkswagen-weighs-another-plant-closure/", "image": "https://electrek.co/wp-content/uploads/sites/3/2023/11/Volkswagen-ID.7-pre-orders-China.jpeg?quality=82&strip=all&w=1400"},
{"title": "Kia EV5 shows promise in the world’s largest EV market as brand sales top 20,000 again", "author": "Peter Johnson", "text": "Kia is growing in China as most foreign automakers are rapidly losing market share. Foreign automakers like Toyota, Volkswagen, and GM are struggling to keep up with aggressive price cuts and an influx of new competition. After launching its new low-cost electric SUV, the EV5, \n\n is already seeing the results, as brand sales in China topped 20,000 for the third straight month in August.\n\nKia officially \n\n at the Chengdu Motor Show last August, claiming it “brings a new era of electric mobility to the compact SUV sector.”\n\nThe EV5 shares much of the design and tech from Kia’s larger EV9 but in a smaller, more affordable package. At 4,615 mm long, 1,875 mm wide, and 1,715 mm tall, the EV5 is roughly the size of Tesla’s Model Y (4,760 mm long x 1,921 mm wide x 1,624 mm tall).\n\nPowered by a 64.2 kWh BYD Blade Battery, the EV5 gets up to 329 miles (530 km) CLTC driving range. The longer-range (88.1 kWh battery) model is rated with up to 447 miles (720 km) driving range.\n\nKia \n\n in China last November, starting at just $21,000 (149,800 yuan). The price undercuts the Model Y, which starts at around $35,000 (249,900 yuan).\n\nAccording to Kia’s Chinese joint venture partner, Jiangsu Yueda Kia, the EV5 is already making an impact.\n\nThe company announced it sold 22,498 vehicles in August, up 36% from last year. August was Kia’s best month so far in 2024 and its third straight month of topping 20,000 in brand sales.\n\n“By sustaining monthly sales of over 20,000 units, Kia has shown it’s on the right path in China,” Kim Sung-rae, a Hanwha Investment & Securities market analyst said.\n\nKia’s sales in China, including exports, reached 154,243 through the first eight months of 2024, a 61% jump from last year.\n\nAccording to \n\n, Kia is now a top-selling brand among joint venture automakers in China.\n\nKia expects to sell over 230,000 vehicles by the end of 2024 at its current pace. If Kia hits its mark, it would be the first time it has crossed the 200,000 sales mark since 2020.\n\nThe EV5 has been a key factor as Kia revamps sales in China. Kia sold nearly 6,000 EV5 models in China through July.\n\nKia exports in China are also surging. As of August, its Yancheng plant exported over 300,000 vehicles, the highest among joint venture partners in China.\n\nWhile many foreign automakers have struggled to keep pace in China’s fast-moving EV market, Kia is taking advantage.\n\nEarlier today, \n\n reported (based on a \n\n report) that Volkswagen’s Chinese joint venture with SAIC is \n\n due to overcapacity.\n\nKia’s new low-cost EV5 is helping the brand compete with domestic automakers like BYD, which dominate the market. BYD’s Seagull EV, which starts at under $10,000 (69,800 yuan), was China’s \n\n, with nearly 41,000 models sold\n\nI don’t understand why they don’t offer the EV5 in the US.  Seems like it would be the perfect size for the US market. \n\nKia is launching the EV5 in new markets like Australia and New Zealand later this year, likely boosting sales further.\n\nChina is not the only market in which Kia’s sales are surging. Last month, Kia sold more vehicles in the US than it ever has. With over 75,200 cars sold in August, Kia \n\n for the third consecutive month.\n\nKia’s first three-row electric SUV, the EV9, is helping drive growth in the US. Through August, Kia has sold nearly 13,900 EV9 models in the US this year.\n\nWith a series of low-cost EVs, including the EV3 and EV4, rolling out globally, Kia will be a brand to watch over the next few quarters as it takes on market leaders.\n\n ", "url": "https://electrek.co/2024/09/18/kia-ev5-shows-promise-china-brand-sales-top-20000-again/", "image": "https://electrek.co/wp-content/uploads/sites/3/2023/09/Kia-EV5-video.jpeg?quality=82&strip=all&w=1400"},
{"title": "BioLite launches home backup battery you can install yourself", "author": "Micah Toll", "text": "Depending on where you live in the US, electrical outages can be anything from a rare occurrence to near certainty. While some only last a few minutes or hours, longer ones can end up spoiling everything in your fridge and lead to an uncomfortable day or two with no air-conditioning or fans. Backup by BioLite is a new home backup battery launched by electronics company BioLite that makes it easy to install your own redundancy before the next storm or power outage.\n\nThe solution provides up to a claimed 60 hours of backup and is meant to power a homeowner’s most important devices (like a refrigerator, fans, computers, etc.) instead of backing up the entire house.\n\nThe concept works like a modern take on a UPS, or uninterrupted power supply. To put it simply, it’s a big LiFePO\n\n battery in a sleek-looking shell that charges itself from the grid in your home and then feeds that power back out to your most important devices when it senses that the power has gone out. \n\nThere are multiple versions of the product that offer different capacities. The 3 kWh Backup Complete is the full monty, and it includes both the main 1.5 kWh Core unit and a 1.5 kWh Extend panel to add even more energy storage. Alternatively, a 1.5 kWh Core unit can be run independently or connected to up to five more Extend panels for the largest energy storage capacity.\n\nThe system can output 1,800W continuously and surges up to 3,000W peak.\n\nYou can get a better idea of how it works in the overview video below.\n\nOne of the main advantages of the system isn’t just its lower cost, but also the ability to be installed by the homeowner instead of needing an electrician to wire it into the house. The device simply plugs into a wall outlet and runs independently of the house, meaning it doesn’t need to be tied into the home’s grid.\n\n“Traditional home backup power typically costs upwards of $15,000 and can take months of coordination with contractors and electricians to install,” shares CEO and Co-Founder, Jonathan Cedar. He continues, “Backup by BioLite offers homeowners and renters alike a more affordable alternative that they can install themselves in under an hour and build resiliency back into their home.”\n\nCompared to more expensive systems, the promotional pre-order prices for BioLite’s 1.5 kWh and 3 kWh systems start at US $1,299 and $1,999, respectively.\n\nThe backup system has now \n\n. Yep, Kickstarter.\n\nFirst, to address the Kickstarter-shaped elephant in the room. My regular readers will know that I rarely cover Kickstarters or other crowdfunding campaigns, and only make an exception under one of two cases. Either I’ve been able to test the product myself in advance, or it’s coming from a well-established company with a good standing record for delivering products. In this case, it’s the second. I’ve tested several products from BioLite before, and the company has a long reputation in the energy storage and electronics industry. This is also the company’s fifth Kickstarter campaign, with the last four all going quite well.\n\nThis isn’t some fly-by-night startup trying to raise the cash to make their oddball idea a reality; this is a company that knows how to build electronics and has been doing it for a while. \n\nThat being said, crowdfunding inherently always comes with risks (even when it’s being leveraged largely for marketing purposes), and there’s no guarantee these things will ever get delivered, so proceed accordingly.\n\nEven so, I can absolutely see the need for a product like this. Whole-home backup systems are great, but most people don’t need everything in their home to be powered. In the case of a sudden storm or other outages that last for a day or two, just being able to prevent all the things in your fridge from spoiling is a nice benefit, as well as being able to charge up your phones or run some cooling fans. So I can definitely see the benefit of a simple, easy-to-install system like this.\n\nSure, it’s largely a modern repacking of a conventional UPS, but it’s a pretty slickly done repackaging that looks like it benefits from BioLite’s experience and brand reputation.\n\n ", "url": "https://electrek.co/2024/09/19/biolite-launches-home-backup-battery-you-can-install-yourself/", "image": "https://electrek.co/wp-content/uploads/sites/3/2024/09/biolite-head.jpg?quality=82&strip=all&w=1600"},
{"title": "Aventura-X review: Classic Vespa vibes in a modern electric scooter", "author": "Micah Toll", "text": "The Aventura-X EV29 has much of the feel-good charm that comes along with nostalgic Vespa rides, yet without any of the exhaust noise, smell of gasoline, or oily rag on your workbench. I spent a few enjoyable weeks riding this fun little runabout and felt almost like I was cheating, getting the fun vibes without paying the normal entry price of muss and fuss that goes with classic ICE scooters.\n\nFirst of all, I probably shouldn’t call it a Vespa, even though it looks and feels like one. Aventura-X probably walks a fine line as it is, conjuring up old-timey Vespa vibes while maintaining just enough differentiation to avoid legal issues. It’s a \n\n, giving us old-school feels without blatantly ripping off a decades-old brand. \n\nBut those kinds of issues aside, this scooter still brings with it a classic-inspired ride that feels oh-so-good.\n\nCheck it out in my video review below, then keep reading for all of my thoughts on this fun ride!\n\nYou probably want to know the numbers right off the bat, so let’s hop to it.\n\nThe version I tested is the Aventura-X EV29. It has a 2,900 watt motor fed by a 72V 20Ah battery. There are actually two battery slots under the seat, so you could add an extra battery to double the range from 35 miles up to 70 miles (56 km to 112 km). If you don’t have an extra battery, like mine, then you’ve got some extra storage under the seat! \n\nThe current sale price of \n\ndoesn’t include the extra battery, which is an additional US $799. You do get the keyless start from a wireless keyfob included for free though as part of a promotional add-on, so at least you’ve got that going for you!\n\nObviously this scooter is built for looks, though that doesn’t mean it doesn’t have some decent utility baked into it as well.\n\nThere is a small storage area in front of the battery compartment, but it’s more of a phone/wallet/keys/sunglasses-sized storage compartment. There’s also a larger storage compartment in the right rear fender that I was able to squeeze three of my riding cameras into as well as my microphone setup. \n\nI know that’s not a normal unit of measure unless you’re a YouTuber, but I’d guess that the wheel well storage is around 1.5 liters or so. It’s also roughly in the shape of a water bottle. So for the Americans in the room, picture a 2L soda bottle and subtract a bit.\n\nThen you’ve got the wicker basket on back, though that’s an add-on accessory. It’s also not exactly a high-security solution, but it does give you some extra storage and definitely looks classy. In fact, it’d be right at home riding to a picnic in your local park.\n\nNow I think most people will agree that the scooter looks great, which is nice since it isn’t terribly fast. At 30 mph (51 km/h), people will get a good long look at you as you cruise by. Aventura-X also has 50 mph (80 km/h) models, but the one I’m riding is built for looks, not for speed.\n\nConsidering I was testing this in Florida, where 50 mph roads are just how you exit your neighborhood, that lower speed was a bit of an issue. I mostly stuck to smaller streets where I could and stayed in the right lane when I had to take faster streets.\n\nI can absolutely see the wisdom in having more speed for keeping your options open in terms of road choice. Obviously a 30 mph top speed is going to impact where you can ride, and so I see this model being better for cruising along the beach roads than commuting on the highway, if that wasn’t clear.\n\nBut I guess that’s the beauty of multiple options. You can get the 50 mph scooter that Aventura-X offers if you want to ride on faster roads, or can save some dough on the slower scooter if you’re sticking to neighborhood streets.\n\nAnd as a quick note on safety: You’ll notice in the video at the top of this article that I’m wearing my motorcycle jacket and usually my riding gloves on the scooter (though admittedly I did forget my gloves a couple of times). I’m also in full pants and boots. While I’m not going to be anyone’s mother here, I try to never get on a motorcycle without all of my protective riding gear, and that’s how I recommend riding. When it comes to scooters, the more laissez-faire nature of the ride makes it easy to accidentally (or purposely) push the thought of riding gear to the back of your mind. “I’m just going for a little cruise,” is a common enough thought, and I’ll admit that I’ve often heard the siren’s call of a romantic scoot alongside the lapping waves in nothing but a t-shirt and shorts. But ultimately, this is still technically a motorcycle and you can still technically cheese grater the skin off various parts of your body in a crash. So just consider that when choosing your ride outfit. \n\nWhile I’m wearing my Dianese mesh motorcycle jacket in this video since I was travelling, I’ve been more frequently wearing my Beyond Riders motorcycle gear \n\n since it has all the protective qualities I’m looking for but looks like typical street clothes. I just got a new \n\nfrom them that has hidden armor and a pair of \n\n that get the same treatment. \n\nSo I’m not saying you \n\n suit up, but I am saying I’d recommend it. Ok, safety rant over.\n\nI’m glad to see both a side stand and a center stand included on the scooter, since they’re useful in different situations. The side stand is great for quick stops like hopping off and running into a store, while the center stand gives more stable parking, especially when parking on a hill or looser terrain like grass. It’s rare to see motorcycles or scooters that offer both. My daily rider – a Gogoro – has both, and I use them both often.\n\nWith cute little 10″ wheels and a faux leather seat, the scooter definitely looks the part of a vintage getup. Even the handlebars almost look like they could be from several decades past, skipping the big gaudy plastic molded parts of today’s scooters and putting as much metal as possible on those bars instead. I have a ’69 Honda Sports Cub and the bars/switches/mirrors, etc. all actually look quite similar to those on the Aventura-X. The rubber end grips take away from the retro vibe a bit, but not too much.\n\nHowever, the body panels don’t get the same classic treatment. While they look the part, they’re actually plastic. That is fine from a few steps back since you’d never know from a glance. But if you grab hold of the front shield and shake it, it feels like a plastic panel. \n\nThat’s not really an issue per se, but it means you might want to be careful with your parking so you don’t crack a panel that would have merely dinged if it had been steel or aluminum.\n\nAs for the ride, I’ve long been a scooter fan. I’m a \n\n. Since my wife and I went car-less a while back, an electric seated scooter is our main form of conveyance. And so the wide foot area of the Aventura-X feels at home to me, as does the convenient bag hook for carrying various odds and ends along for the ride. \n\nIn fact, as much as I like my motorcycles, I generally opt for my scooters when I’m actually commuting or running errands since the extra foot space makes it easier to carry things with me or do the occasional shopping trip.\n\nThe feel will be familiar to any scooter rider, even if the wheels are a tad bit smaller than on some of my other rides. The long bench seat is comfortable, the large front shield keeps you largely weather protected from splashes and road debris, and you get all the joy of being part of the environment (instead of watching it go by through a window) yet without the complex feelings that many people have towards true motorcycles. Basically, it’s all of the fun without the baggage.\n\nUltimately, I’m not exactly sure what I expected of the Aventura-X, but it definitely left me smiling and satisfied. It’s a fun, retro ride that seems to bring joy to just about everyone who sees you go by.\n\nAt the same time, though, you’re paying a premium for those feel-good rides.\n\n, this is obviously not the most affordable way to cruise around at 30 mph. And speaking of which, that 30 mph speed is definitely limiting, leaving you barely faster than an electric bicycle yet on a vehicle that looks very out of place in the bike lane.\n\nIn fact, you almost certainly shouldn’t be using it in the bike lane, unless your local laws allow it. When I spent a year in Boston back in 2018, I actually could legally ride my 30 mph electric moped (a Genze 2.0, RIP) in the bike lane. Yet even with the law on my side, cyclists who saw me were \n\n about it. That meant I rarely actually used the bike lanes unless it was to briefly skip a line of traffic, and even then I was always extra cognizant of any \n\n cyclists around me. I’m not sure many places would allow an Aventura-X in the bike lanes these days, or if Boston even still allows mopeds in, and so you’ll need to plan your own local trips accordingly.\n\nThere’s definitely a place for a ride like this, and I’m glad vintage-inspired electric scooters exist. I would certainly consider springing for the extra 20 mph though, as it opens up many more possibilities for where you can ride. But if you’re in a sleepy neighborhood or laid-back beach town, zipping down to that sea breeze coast at 30 mph on a scooter that looks like a blast from the past might be the perfect ride indeed.\n\n ", "url": "https://electrek.co/2024/09/19/aventura-x-review-classic-vespa-vibes-in-a-modern-electric-scooter/", "image": "https://electrek.co/wp-content/uploads/sites/3/2024/09/Aventura-X-electric-scooter-header.jpg?quality=82&strip=all&w=1600"},
{"title": "NIO Onvo L60 launches with cheaper prices than expected starting at just $21,200", "author": "Peter Johnson", "text": "On Thursday, \n\n officially launched its new Tesla Model Y rival, the Onvo L60. Starting at just $21,200 (149,900 yuan), NIO’s new electric SUV hits the market with cheaper prices than expected.\n\nNIO officially launched the L60 electric SUV in China on September 19, 2024, marking the first of its new mass-market Onvo brand. \n\nThe Onvo L60 is NIO’s answer to Tesla’s top-selling \n\n as it enters new segments. NIO’s new electric SUV starts at just 149,900 yuan, or roughly $21,200.\n\nStarting under $22,000, the new mid-size “family smart electric SUV” is even cheaper than the \n\n, which opened at $30,500 (219,900 yuan) in May. The low starting price tag is for the battery subscription model.\n\nWith the battery included, the NIO Onvo L60 starts at $29,300 (206,900 yuan), still cheaper than pre-sale prices. That’s for the 60 kWh battery model with up to 341 miles (555 km) CLTC range.\n\nThe larger (85 kWh) battery model is available starting at $33,400 (235,900 yuan) and has a CLTC range of up to 454 miles (730 km).\n\nDuring the launch, NIO said a 621-mile (1,000 km) range model with an expected 150 kWh battery pack will be launched.\n\nFor those who choose the battery subscription model, rentals are $85 (599 yuan) for the 60 kWh and $125 (899 yuan) for the 85 kWh battery per month.\n\nAt 4,828 mm long, 1,930 mm wide, and 1,616 mm tall, NIO’s electric SUV will directly compete with Tesla’s Model Y (4,750 mm long x 1,921 mm wide x 1,624 mm tall). NIO claims the Onvo L60 sets “a new standard for family cars.”\n\nTo prove it, NIO claims its electric SUV has better energy consumption than the Model Y (12.1 kWh/100km vs. 12.5 kWh/100km).\n\nInside, the Onvo L60 closely resembles Tesla’s top-selling model. The 17.3″ infotainment is the center of the display, and the interior is otherwise minimalistic. NIO also included an 8″ screen for rear passengers.\n\nWith a wheelbase of 2,950 mm, the Onvo L60 is longer than Tesla’s Model Y (2,890 mm), meaning slightly more interior room.\n\nOn September 1, NIO’s Onvo \n\n in 55 cities across China as it prepared to launch its first electric SUV.\n\n ", "url": "https://electrek.co/2024/09/19/nio-onvo-l60-cheaper-starting-21200/", "image": "https://electrek.co/wp-content/uploads/sites/3/2024/08/NIOs-Model-Y-electric-SUV.jpeg?quality=82&strip=all&w=1400"},
{"title": "Range Energy’s electric trailer helps CA egg farm improve mpg by ‘up to 70%’", "author": "Jameson Dow", "text": "Range Energy’s electric trailer, which allows fleets to effectively hybridize by adding a battery and motor to the trailer, has been put into service by Petaluma Egg Farm to improve efficiency of its diesel shipping fleet by 50-70%.\n\nThe concept behind Range Energy’s trailer is relatively simple. Instead of the diesel-engine tractor having to do all the work to pull the trailer, Range adds a battery and motor to the trailer to help it push its own weight forward, effectively cutting the amount of weight the diesel engine has to pull and therefore increasing efficiency.\n\nIt sounds like a bit of a hack, but the purpose behind it is that electric tractors are quite expensive and are still ramping up in production. Meanwhile, trucking companies already have working diesel tractors that could be expected to have many years of life left, and aren’t necessarily excited to scrap their expensive tractors for an expensive new electric one.\n\nWhile the swap works out for many companies, especially if it fits into the fleet buying timeline and a company is ready to replace its diesel trucks, there are other fleets that might benefit from an easier, more short-term drop-in solution.\n\nAnd that’s what Range Energy’s trailer provides, because it doesn’t require any sort of retrofitting of the diesel engine, it’s just a pick-up-and-go solution.\n\nIt works with what Range calls the “smart kingpin,” which is packed with sensors to tell the trailer how hard the tractor is pulling. It then adds its own torque proportional to the amount the tractor is asking for, making loads feel lighter.\n\nWe got a chance to see a \n\n, and let me say, it was one of the coolest demos I’ve experienced.\n\nSince then, Range has had its trailer validated through independent testing, which said it can \n\n in average use cases. Given that fuel costs are a large part of any trucking company’s outlays, and that diesel fuel burned in heavy duty vehicles creates an outsized portion of smog-forming pollutants, this is a quick way to get some real improvements.\n\nThe trailer can also be used on electric trucks as an impromptu “range extender,” essentially just adding a larger battery carried by the trailer, in addition to whatever amount of energy storage the tractor has onboard.\n\nThere are some other companies with a similar solution, including a company called \n\n. But the US and European markets are different, so there’s room for both in this realm.\n\nThe news today is that Range Energy’s trailer has been put into service in a real-world test, including taking advantage of its large battery for refrigeration. Refrigerated or “reefer” trucks are used widely throughout the industry, but this is the first order Range has gotten for its electrified reefer solution.\n\nThe company in question is Petaluma Egg Farm, a family-owned business that serves Northern California grocery stores. It ordered and will deploy 10 of Range’s trailers over the next 12-18 months.\n\nThe order follows a successful pilot by the farm which it ran in July, testing the trailer on routes between 100 and 440 miles, and also on city distribution routes consisting of more than 15 delivery stops.\n\nDuring the trial, the trailer had 100% uptime, and did not need any additional time for charging beyond typical downtime. Range says it delivered “up to 70%” mpg improvements. We followed up on that (since it sure seems like “up to” is doing a lot of heavy lifting there), and were told that “average” improvements tallied between 50-70% – but this is highly dependent on a number of factors, so take it with a grain of salt, especially given that the third-party test above showed 36% improvements on a standardized route.\n\nNevertheless, it shows that in this real-world circumstance, the trailer has worked well to reduce fuel costs for the company in question. And on routes that are perhaps easier-than-average, improvements better than 36% are possibly.\n\nWe’ve been quite interested in Range Energy ever since demoing their system at ACT Expo and talking to their leadership.\n\nWhile the system isn’t fully electric – the Range trailer is electric, but is still driven by a diesel tractor – it’s still a great way to drop in to a fleet and get an improvement right away.\n\nWe’d rather have everyone go all electric, which they will in the longer term. But in the short and medium term, this will still reduce pollution quickly.\n\nThe one thing we’re worried about is what Range will do once every truck already is electric. There’s still some use for these trailers in those circumstances, as they might fit into an ecosystem where tractors can be sold with a relatively smaller amount of energy storage for shorter routes that don’t need much energy, and then Range trailers can be added to those tractors for longer routes.\n\nBut this does feel like a more niche application. However, Range’s leadership seems to have good heads on their shoulders, and they’re a quickly moving company, so we think they’ll be able to figure something out.\n\nRegardless, in the short term, this is quite a boon and we’d love to see more of these out there in the wild. Good on Petaluma Egg Farm for taking the initiative here.\n\n ", "url": "https://electrek.co/2024/09/18/range-energys-electric-trailer-helps-egg-farm-improve-mpg-by-up-to-70/", "image": "https://electrek.co/wp-content/uploads/sites/3/2024/09/Screenshot-2024-09-18-at-1.56.07PM.jpg?quality=82&strip=all&w=1600"},
{"title": "Here’s how to find all the free money you qualify for when you buy an EV", "author": "Jameson Dow", "text": "A new tool is out that lets you search for EV incentives in your area, covering not just the federal $7,500 incentive, but any other local incentives to help you save money when buying an EV.\n\nThe incentive tool is available at \n\n, and is powered by \n\n, an EV advocacy nonprofit.\n\nIt’s simple enough – you just \n\n and it tells you all the incentives that you might qualify for.\n\nThe site covers incentives for 49 states, every metro area with a population of 50k or more, and all the Justice40 communities identified by the Biden administration. The one state that has no available incentives other than the national one is Montana.\n\nAnd it’s not just the\n\n, but state, regional, local, utility, and other regulatory incentives like those that might be granted by your local air quality management district.\n\nThe site also has a \n\n to filter through available EV brands and see what’s available, in case there might be a model out there you aren’t aware of. The site gives price estimates for each car, but the price estimates are post-incentive – and you can click through to see which incentives are being applied in the site’s calculations.\n\nYou can even \n\n and some of the best places to find them. Some incentives apply to used EVs as well.\n\nIn testing out the tool for my own area, I found a number of incentives that even I didn’t know existed. Which is interesting, given that I \n\n.\n\nFor example, in Southern California where I live, the South Coast Air Quality Management district has an \n\n for replacing dirty old vehicles, California has a \n\n to replace old vehicles for low-income drivers in certain counties, and Southern California Edison has a \n\n.\n\nThere are also a number of incentives for home charger installs, including the \n\n, a \n\n from Southern California Edison, and an \n\n for upgrading your home’s electrical panel, also from SCE.\n\nI live in a spot where lots of incentives are available, but there are likely to be incentives you don’t know about in the area you live as well. So put your zip code into the website’s \n\n and have a look at the money you can get back for buying an EV.\n\n ", "url": "https://electrek.co/2024/09/19/heres-how-to-find-all-the-free-money-you-qualify-for-when-you-buy-an-ev/", "image": "https://electrek.co/wp-content/uploads/sites/3/2024/04/EVSE_Garage_Charging_Cabinet-1.jpg?quality=82&strip=all&w=1600"},
{"title": "Tesla (TSLA) rises on deliveries in China, but can it save its Q3?", "author": "Fred Lambert", "text": "Tesla’s stock (TSLA) is up this morning on delivery data from China showing a strong end-of-quarter performance, but is this enough to save its Q3?\n\nInsurance registration data in China shows that Tesla delivered 15,600 vehicles in the country last week, down 3.7% from the prior week, which had a strong performance with 16,200 registrations.\n\nThis is a strong start for September, with 31,800 registrations. That only accounts for Tesla’s vehicles built at Gigafactory Shanghai and sold domestically—though that’s generally most of its Shanghai production at the end of quarters to limit vehicles in transit.\n\nTesla tends to end quarters strong with a push in deliveries over the last few weeks.\n\nAccording to the China Passenger Car Association (CPCA), Tesla China delivered 86,697 electric vehicles made in China in August and just over 74,000 vehicles in July.\n\nTesla is on pace to deliver over 230,000 electric vehicles in and from China in Q3.\n\nTesla introduced 0% financing in China this year in order to boost demand in its most important market and it is clearly working.\n\nHowever, other markets are not doing as well.\n\nAccording to \n\n, Tesla’s deliveries in Europe are way down this year:\n\nTesla is down more than 70,000 vehicles in its biggest EU markets compared to last year. The difference is \n\n.\n\nIt looks like China is going to be able to compensate for some of Tesla’s troubles in the EU, but not all of it.\n\nThe difference maker in Q3 could end up being the US market, where Tesla has been having its own issues, but it recently introduced strong incentives to try to boost sales.\n\nThe new referral program basically results in a $1,000 discounts on all cars except Cybertruck. Speaking of Cybertruck, it’s not a high volume program, but the recent ramp-up in production does point to it contributing a few tens of thousands of units to Tesla’s total deliveries in Q3.\n\nFinally, Tesla recently \n\n that are likely going to be impactful at the end of the quarter.\n\nAt this point, I think Tesla is likely going to beat deliveries from last quarter, 443,956 units, which would actually mean a return to year-over-year growth for Tesla since it delivered 435,000 units during the same period in 2023.\n\nHowever, I believe that Tesla will be far short of the 585,000 vehicles it needs to be deliver in order to be on pace for its original goal of 2 million deliveries in 2024. It might even be short of the 485,000 vehicles it needs to be on pace so as not to be down year-over-year in deliveries for the whole year.\n\nWhat do you think? Let us know in the comment section below.\n\n ", "url": "https://electrek.co/2024/09/19/tesla-tsla-rises-on-deliveries-in-china-but-can-it-save-its-q3/", "image": "https://electrek.co/wp-content/uploads/sites/3/2023/01/Best-selling-electric-vehicles-5.jpeg?quality=82&strip=all&w=1400"},
{"title": "i-charging unveils new 1.5 Megawatt EV charging system with six simultaneous outputs", "author": "Scooter Doll", "text": "EV infrastructure developer i-charging has introduced a new Megawatt Charging System designed for \n\n to make the replenishing process faster and more efficient. Its latest “i-light” system offers up to 1.5 MW of power and 98-99% efficiency, and it can recharge several vehicles simultaneously.\n\ni-charging is a Portugal-based EV infrastructure specialist with US offices in Georgia. According to its website, it has tasked itself with developing innovative hardware and software solutions that optimize its customers’ operations, user experiences, and use of the power grid.\n\nThe company’s flagship lineup of products is its blueberry chargers, which can offer rates between 50 kW and 900 kW (DCFC), in addition to the blueberry CLUSTER for fleets. All come complete with i-charging’s blueberry FUSION user interface and cable management systems (CMS) and are supported by My i-charging web platform for operational monitoring and management.\n\nJust recently, at IAA Mobility in Europe, i-charging introduced its latest charger called i-light, offering the power capabilities of up to 1.5 MW to support up to six heavy-duty EVs at a time. Check it out.\n\nThe company \n\n of its new i-light Megawatt Charging System (MCS) following its official unveiling at IAA Mobility this week. Per i-charging, the MCS can charge at a maximum rate of 3.75 Megawatts (3,000 A at 1,250 V DC). \n\nHowever, ultra-fast charging at speeds of up to 1+ MW is currently all that is required since current CCS technology is limited to 500 kW. The company believes the current rate is insufficient to expedite the electrification of heavy-duty trucks and commercial vehicles. However, it believes its new MCS technology can soon become the standard for the battery-electric commercial vehicle segment. i-charging CEO Pedro Moreira da Silva elaborated:\n\nWith i-light, we are making a statement about the future of heavy-duty transport. Our goal is to provide a solution that addresses the critical need for faster, more efficient charging while supporting the broader transition to sustainable energy. The i-light is an important step in this journey, and we are incredibly proud to bring this technology to market.\n\nThe i-light MCS can deliver up to 1.5MW of power, divided into 250kW increments for up to six electric trucks simultaneously while maintaining 98-99% efficiency. Each pile features 3-meter, liquid-cooled cables with the option for longer lengths and a 37″ glass display (seen above) that remains visible from the driver’s seat, enabling fleet operators to monitor their session easily.\n\nThe i-light was designed to utilize energy from low—or medium-voltage grids and convert a significant amount of that available electricity into usable energy. This saves customers money compared to the pricing of high-voltage substations, footprints, and cabling.\n\ni-charging says its MCS standards will be published by ISO, IEC, and SAE later this year. After that, its i-light system will seek certification before deliveries begin in 2025. The company shared that it will also roll out a version of i-light in 2024 to support electric trucks with CCS inlets.\n\n ", "url": "https://electrek.co/2024/09/19/i-charging-unveils-1-5-megawatt-ev-charging-system-six-simultaneous-outputs/", "image": "https://electrek.co/wp-content/uploads/sites/3/2024/09/i-charging-megawatt-i-light-hero.jpg?quality=82&strip=all&w=1400"},
{"title": "US Treasury released EV charger tax credit guidance – here’s how to find out if you qualify", "author": "Michelle Lewis", "text": "US Department of the Treasury has \n\n EV charger tax credit eligibility for individuals and businesses – here’s what you need to know.\n\nWhen the Inflation Reduction Act became law in August 2022, it provided a tax credit for up to 30% of the cost of qualified EV charging “property.” Internal Revenue Service and US Department of the Treasury have clarified that the \n\n (section 30C) EV charging tax credit applies to each charging \n\n and its “functionally interdependent components.” \n\n“This one simple clarification should positively impact infrastructure deployment as industry players can now more comfortably move forward with projects leveraging this tax credit,”  Suncheth Bhat, chief commercial officer at \n\n, told \n\n.\n\nThe US Treasury’s EV charger tax credit (which is claimed using \n\n) is limited to $1,000 for individuals claiming for home EV chargers and $100,000 – up from $30,000 – for business properties. That came into effect on January 1, 2023.\n\nThe credit may also be claimed by tax-exempt and governmental entities using \n\n.\n\nIn order to qualify for the 30C EV charging tax credit, individuals and businesses need to be located in an “eligible census tract.” The IRS defines an eligible census tract as: \n\n… any population census tract that is a low-income community or that is not an urban area. Approximately two-thirds of Americans live in eligible census tracts. \n\nBusiness and tax-exempt governmental entities claiming the Alternative Fuel Vehicle Refueling Property Credit can receive an enhanced credit if they are paying workers prevailing wages and using registered apprentices to install the equipment.\n\nThe US Department of Energy and \n\n released a \n\n to help individuals and businesses find out whether they’re eligible for the 30C EV charging tax credit. (Note that there’s a disclaimer on the map that says it’s not formal IRS guidance – and neither is this article! – so when the time comes to file your taxes, consult with a tax professional to confirm eligibility.)\n\nThe Zero Emission Transportation Association’s (\n\n) executive director, Albert Gore III, said, “Developing our nation’s charging network is crucial to transportation electrification. As one of the principal incentives for charging infrastructure, 30C will help fill in charging gaps and attract investment to rural and lower-income communities. It will also help comfort potential EV drivers with the transition as they see more publicly available infrastructure.”\n\nArgonne also has a \n\n \n\n ", "url": "https://electrek.co/us-treasury-released-ev-charger-tax-credit-guidance-heres-how-to-find-out-if-you-qualify/", "image": "https://electrek.co/wp-content/uploads/sites/3/2024/01/DOE-30C-mapping-tool.jpg?quality=82&strip=all&w=1200"},
{"title": "NIO (NIO) eyes buying Volkswagen plant in historic market shake up", "author": "Peter Johnson", "text": "China’s \n\n (NIO) is considering buying Volkswagen’s Audi plant in Brussels. Volkswagen’s plant is at risk of being shut down, and NIO wants to take advantage as the market shifts to EVs.\n\nVolkswagen may \n\n in Germany ever. Its Audi Brussels factory is also at risk. The last time the company closed a facility was back in 1988 in Westmoreland, Pennsylvania.\n\nHowever, VW is facing an overcapacity crisis amid sluggish EV sales and a slew of new competitively priced electric cars from China.\n\nCEO Oliver Blume warned that Germany’s competitive advantage is at risk as the industry shifts to electric vehicles. Volkswagen has already canceled plans for a new EV facility and delayed key model launches as it falls further behind Chinese automakers.\n\nAccording to a Belgian media report, China’s NIO is in talks to buy Volkswagen’s plant in Brussels.\n\nThe report from \n\nclaims NIO representatives recently visited the plant and are already working on a bid. NIO needs to submit its offer to VW by next Monday at the latest.\n\nVolkswagen plans to stop building cars at the facility after the last Audi Q8 e-tron rolls off the production line next year. If the plant closes, the nearly 3,000 workers will lose their jobs.\n\nNIO already sells vehicles in Germany, Norway, the Netherlands, Sweden, and Denmark. Although it doesn’t sell cars in Belgium yet, NIO plans to launch there soon.\n\nAlthough NIO faces an additional 20.8% tariff on imports to the EU, the Chinese EV maker is committed to expanding in the region.\n\nNIO buying out Volkswagen’s Brussels plant would be symbolic of the market’s shift to EVs. European automakers, including VW, are facing stiff competition from China.\n\nEven with tariffs, several Chinese EVs are expected to still be cheaper than their European rivals.\n\nAlthough NIO is known for its “smart electric vehicles,” it’s launching new lower-cost models. Its new electric SUV, the \n\n, is widely viewed as a true Tesla Model Y Challenger. Starting at around $30,000 in China, NIO’s new electric SUV undercuts the Model Y by about $4,000 (30,000 yuan).\n\nNIO plans to launch the competitively priced electric SUV globally later this year. Next year, the company will follow up with its new \n\n for under $32,000 (30,000 Euro).\n\nMeanwhile, Volkswagen’s struggles are not limited to Europe. The company is also facing a plant closure in China with its joint venture partner, SAIC.\n\n ", "url": "https://electrek.co/2024/09/19/nio-nio-eyes-volkswagen-plant-historic-market-shake-up/", "image": "https://electrek.co/wp-content/uploads/sites/3/2024/06/NIO-third-EV-plant.jpeg?quality=82&strip=all&w=1400"},
{"title": "Your electric car will fall apart before its battery pack does, study finds", "author": "Fred Lambert", "text": "A new study of 10,000 electric cars shows that their battery packs should outlast the vehicles themselves.\n\nGeotab, an automotive telematics company, is using its in-depth access to EV data to track battery health.\n\nWe reported on \n\n, which showed 2.3% EV battery degradation per year.\n\n5 years later, the company now has a lot more data, and it just released \n\n that shows the average degradation per year is actually 1.8%. The company believes that it could translate to EV batteries lasting 20 years:\n\nGeotab research shows that EV batteries could last 20 years or more if they degrade at an average rate of 1.8% per year, as we have observed.\n\nConsidering electric cars, like gasoline-powered vehicles, tend to break down for mechanical reasons much sooner than 20 years, the average vehicle lifespan is 15 years, this could mean that EV batteries should outlast their vehicles.\n\nThe company wrote in the study:\n\nAccording to our data, the simple answer is that \n\n. If an average EV battery degrades at 1.8% per year, it will still have over 80% state of health after 12 years, generally beyond the usual life of a fleet vehicle.\n\nHowever, Geotab does mention that more data would be needed as while there are quite a few high-mileage EVs out there, there are not many older EVs, and both time and mileage affect battery degradation.\n\nAlso, not all EVs are equal.\n\nWithout revealing the specific models, Geotab found significant differences in battery degradation between 11 different EV models:\n\nThe study does compare a few specific models, like a 2015 Tesla Model S and a 2015 Nissan Leaf, which is interesting in order to compare active temperature battery management, which the Leaf didn’t have back then.\n\nThe impact on battery degradation is clear:\n\nGeotab’s study also dives into what environmental and usage factors impact battery degradation.\n\nFrequent DC fast-charging and climates are mentioned. The former doesn’t have a massive impact, but using EVs in hot climates appears to have a more significant impact:\n\nThis highlights the need for EVs with great active cooling in hotter climates. Active cooling also helps reduce the impact of DC fast-charging at higher rate.\n\nGeotab also mentions that EVs have different “battery buffers”, which is term used to refer to the battery capacity that is not used. This can affect known battery degradation as it can be adjusted with over-the-air software updates.\n\nThanks to early battery degradation data, this has been suspected for a while, but I’m happy to see that it’s getting even better with more data.\n\nNow, while the battery might still be viable, I understand that some may be worried about excessive battery degradation resulting in shorter range.\n\nThat’s why automakers offer warranties against excessive battery degradation, which has been extremely rare so far. In my 10 years of reporting every day on electric cars, I can count on one hand the stories of EV owners reaching out about excessive degradation.\n\nI think this reinforces the idea that battery-powered electric vehicles, combined with ethical sourcing of battery material, battery recycling, and renewable electricity production, is the way to go to make transportation sustainable long-term.\n\n ", "url": "https://electrek.co/2024/09/19/electric-car-will-fall-apart-before-its-battery-pack-does-study-finds/", "image": "https://electrek.co/wp-content/uploads/sites/3/2021/01/Tesla-structural-battery-pack.jpg?quality=82&strip=all&w=1600"}
]