[
{"title": "GM releases its approved NACS adapter, giving its drivers access to Tesla’s charging network", "author": "Scooter Doll", "text": "More than a year after legacy automakers announced a transition from the CCS charging port to Tesla’s \n\n, GM EV customers are finally able to purchase an approved adapter and gain access to hundreds of thousands of Tesla chargers.\n\nToday’s news has been a long time coming for GM-branded EV drivers. It is another massive step in the American auto industry’s adoption of a truly universal charging plug.\n\nIn June 2023, GM was one of the first OEMs to announce a transition from the CCS plug to Tesla’s NACS. It shared that future BEV models will feature the port natively, and existing BEVs could access the charging network via an adapter.\n\nSince then, we’ve seen virtually all automakers adopt NACS and begin sourcing approved Tesla adapters, including Ford, Hyundai, BMW, \n\n, to name a few. \n\nUS charging networks like ChargePoint have also begun rolling out \n\nof all makes and models, helping increase the versatility of local networks and alleviate some of the stressors EV drivers currently face when they need a charge and don’t have the correct plug or aren’t certified to access a specific charging network.\n\nWhile we await future GM models with Tesla NACS plugs built in, the American automaker has begun selling an approved adapter that gives its EV drivers immediate access to many Level 2 and DC fast chargers on Tesla’s current network.\n\nAccording to a release from GM today, its approved NACS adapter is on sale now through GM vehicle brand apps, offering those drivers access to Tesla’s Supercharger network – one of the largest and most dependable in the US right now.\n\nThe NACS adapter allows GM customers to access nearly 232,000 public chargers, including 17,800 Tesla Superchargers. GM Energy vice president, Wade Sheffer, spoke:\n\nGM’s ongoing efforts to help accelerate the expansion of public charging infrastructure is an integral part of our commitment to an all-electric future. Enabling access to even more publicly available fast chargers represents yet another way GM is focused on further improving the customer experience and making the transition to electric more seamless.\n\nPer GM, EV drivers of its portfolio of marques will be able to purchase the Tesla adapter through their respective apps for $225. They can then use that same app to locate the nearest available Tesla Superchargers, check station status, initiate a charge and pay for their session.\n\nGM states that each Tesla adapter has been developed to ensure customers can charge their EV at any charger that offers the North American Charging Standard. The American automaker is leveraging several suppliers to produce them to ensure everyone who wants one can get one.\n\nThe automaker states that the adapters will begin rolling out in the US immediately, followed by Canada later this year. You can \n\n.\n\n ", "url": "https://electrek.co/2024/09/18/gm-releases-approved-nacs-adapter-givingaccess-tesla-charging-network/"},
{"title": "Chinese electric truck maker SANY partners with Alltrucks to conquer Europe", "author": "Jo Borrás", "text": "Chinese heavy equipment manufacturer SANY has signed a strategic Agreement with European brand Alltrucks to fuel its expansion into the European market. (Probably.)\n\nWith this Agreement, the well-known brand Alltrucks will take on responsibility for the maintenance, diagnosis, and repair of the Chinese \n\n eTruck vehicles in the EU. The company hopes an alliance with a trusted brand will help to alleviate customers’ concerns about adding “unknown” Chinese-built heavy equipment to their fleet.\n\n“In Alltrucks, we have found a partner that shares our vision of sustainable mobility and has the necessary expertise and infrastructure to provide our customers with the best possible support,” explains Kevin Eichele, Head of Business Development at SANY eTrucks Europe. “Together, we will shape the future of freight transport in Europe.”\n\nAlltrucks is a joint venture between Bosch, Knorr-Bremse, and ZF that offers 24-hour breakdown service, technical and marketing support, and an OEM-quality replacement parts network to truck fleets across the EU.\n\n“We are delighted to be partnering with SANY eTrucks,” says Homer Smyrliadis, Managing Director of Alltrucks. “Our goal is to always offer our customers the best service. By working with such an innovative partner as SANY, we can further expand our service portfolio in the field of electromobility and make our contribution to sustainable mobility.”\n\nThe E-mixer shown (above) \n\n. It sends power to its wheels through a 6-speed transmission with significant torque multiplication, enabling it to claw up a 30% grade, even when fully loaded. (!)\n\nAs a semi-professional journalist and passably professional person in general, I like to find at least two sources for any story. In this case, though, I couldn’t do that. As such, I feel like I need to tell you that the quotes used in this story are translated from a German email reportedly received by \n\n. The story does not appear on either the \n\n or \n\n news pages, or (from the Google searches I tried) anywhere else.\n\nIt’s a significant story if it’s true – one that solves for the question of, “\n\n?” with a very neat and tidy, “The same place you get your truck serviced now,” and I’m hoping that we’re just ahead of an embargo or something and that verification will come soon.\n\nThat said, take this one with a bit more than a \n\n of salt until that verification comes. Call it a teaspoon.\n\n: SANY (allegedly), via \n\n.\n\n ", "url": "https://electrek.co/2024/09/15/chinese-electric-truck-maker-sany-partners-with-alltrucks-to-conquer-europe/"},
{"title": "Dodge’s first electric Charger Daytona is now officially open for orders", "author": "Peter Johnson", "text": "The all-electric muscle car you’ve been waiting for is finally here. You can now officially order \n\n first electric muscle car, the 2024 Charger Daytona R/T. Dodge is offering a “VIP Experience” and other exclusive First Call content for those who order early.\n\nDodge shook the internet earlier this year after \n\n, the Dodge Charger Daytona.\n\nThe 2024 electric Charger Daytona Scat Pack remains “the world’s quickest and most powerful muscle car,” Dodge claims. With up to 670 hp and 627 lb-ft of torque, the Charger EV packs “SRT-like performance” for a 0 to 60 mph sprint in 3.3 seconds.\n\nDodge’s Scat Pack model comes with a Direct Connection Stage 2 upgrade straight from the factory. The base R/T model has a Stage 1 kit for 496 hp and 404 lb-ft of torque for a 0 to 60 mph time in 4.7 secs.\n\nLast month, we learned \n\n $73,190. Both models qualify for the $7,500 EV tax credit.\n\nNow, you can finally order Dodge’s electric Charger. Dodge opened orders for the 2024 Charger Daytona on Monday with an exclusive First Call VIP experience.\n\nWith 670 hp and 627 lb-ft of torque, the Charger EV can only achieve 0-60mph in 3.3 seconds, slower than even a pedestrian Model S. What gives ? \n\nYou can find Charger Daytona-certified dealers on \n\n that have vehicles en route or can help you order one. The company said models will begin arriving at dealerships in the fourth quarter.\n\nDodge also released a new Charger configurator tool for an immersive look at the interior and exterior options.\n\nThose who take delivery of a Dodge Charger Daytona sold order placed by October 31, 2024, get exclusive First Call content and a VIP experience. Dodge will provide two days of performance driving school for the new electric Charger.\n\nYou will also receive an exclusive VIP concierge to help with any questions and guide you through the delivery process. The First Call welcome kit includes an official letter of authenticity stating you own a First Call Dodge Charger Daytona, Dodge-branded driving gloves, “and more.”\n\n ", "url": "https://electrek.co/2024/09/16/dodges-first-electric-charger-officially-open-orders/"},
{"title": "Lectric ONE long-range e-bike with extra battery $2,299, exclusive Anker F3800 bundle $2,000 off, Hyper BMX e-bike, more", "author": "Reinette LeJeune", "text": "We’re kicking off this week’s Green Deals with the biggest bundle package we’ve seen on \n\n that comes with a free extra battery for 100+ miles of travel and $220 in further free gear. Following close behind it is a \n\n-exclusive discount from Wellbots on the \n\n that comes with an expansion battery at just \n\n. We’ve also spotted a one-day sale on \n\n, a new low price on the \n\n alongside its edger attachment for \n\n, and a bunch of great deals on \n\n that start from \n\n. Bringing up the rear, while not necessarily a Green Deal, we did also notice \n\n hitting a 2024 low, which makes a welcome support alongside your electric yard tools. Plus, all the other hangover Green Deals that are still alive and well, like the latest \n\n, or the best price we’ve seen this year on the \n\n, and more.\n\nHead below for other New Green Deals we’ve found today and, of course, \n\nand \n\n. Also, check out the new \n\n.\n\nLectric is giving folks one of the best bundle deals we’ve seen on its \n\n that adds $720 in free gear to your purchase at \n\n. This massive package would normally cost you $3,019 in all, which is the biggest addition of add-on accessories that we’ve seen for this model. What makes this such a great deal is the inclusion of a free extra battery that ramps up its long-range traveling capabilities even further – plus, you’ll also be getting a rear cargo rack and fenders for both wheels. Learn more about this micromobility solution below or in our \n\n.\n\nLectric’s \n\n is the company’s premium commuter solution that was designed to bring high-quality parts like the Pinion auto-shifting electric gearbox and a carbon fiber-reinforced drive belt into a more budget-friendly price range. It’s been given a 750W rear hub motor that peaks at 1,310W, as well as a 48V 14Ah battery that can power the motor up to 60 miles on a single charge normally (extended to 100+ miles thanks to the extra battery). It tops out at speeds of 28 MPH when permitted by state laws and comes supported by five levels of PWR pedal assistance with 96 magnet cadence sensors, which is well over the typical 12 you see on a lot of standard e-bikes.\n\nIt’s been equipped with a 24A potted motor controller that better ramps up to its peak power output for inclines and bursts of speed when needed. There’s a thumb throttle for when you want to just cruise around with little effort (though keep in mind this does lower its travel range), 20-inch puncture-resistant city tires that have been designed to take hits and keep going, an integrated LED headlight and taillight, hydraulic mineral oil brakes, hidden cable routing, a kickstand, and a new color LCD display.\n\nYou can check out all the other \n\n – with models receiving up to $727 in free gear.\n\nWellbots is giving \n\n readers another exclusive chance at massive savings on the \n\n, \n\n Already seeing a steep fall from its normal $5,598 price tag (with Anker’s online storefront starting at a higher $6,498 list price), we’ve only tracked a handful of previous discounts on this bundle since hitting the market in January, with the biggest of them coming in at the tail-end of July from Wellbots and dropping $200 lower, while direct-from-Anker sales have only seen it fall as low as $4,199. You can score it here today with this exclusive offer at the second-best rate we’ve seen, and giving you nearly $2,000 in savings ($2,899 in savings off Anker’s storefront).\n\nWith \n\n, you’re getting a mobile backup solution that dishes out up to 6,000W of power output from its doubled 7,680Wh LiFePO4 battery capacity, courtesy of the bundled expansion battery. The unit itself sports plenty of ports to cover your needs for traveling, camping, and even total home support during blackouts – with eight ACs, three USB-Cs, two USB-As, one DC, and one car port. There are also connections to hook up and support your RV, an electric car, and your home’s circuit breaker. One thing to note about the latter support: you will need either a Home Backup Kit for sectional home support or you can utilize the Home Power Panel that keeps your entire household up and running (Both sold separately).\n\nThe F3800 comes with a variety of recharging options, with the main two being a 2.7-hour charge when plugged into a standard wall outlet or a quicker two-hour charge when connected to its maximum 2,400W solar input. The unit features a rollable design, with wheels along its bottom for extra convenience, along with an LCD display that lets you monitor and adjust its settings – plus, there are remote smart controls that you can access via the companion app too.\n\nThrough its \n\n, Best Buy is offering a great entry-level e-bike option with some alternative style in the form of the \n\n. Normally priced at $1,000 most days, with a higher $1,198 MSRP direct from Hyper, we’ve seen very few discounts on this particular model, often coming from Hyper themselves and often at much higher rates orbiting $1,000. Today, you’re looking at the chance to score a 40% markdown, saving you $400 off its Best Buy rate (and $598 off its full MSRP) while landing it at the lowest price we can find.\n\nHyper’s \n\n delivers a fun mash-up between e-mobility solutions and a 26-inch BMX platform, giving folks a colorfully stylish change-up from many models on the market that also makes a great first-time ride for teens and adults alike. It has been given a 250W rear-hub motor alongside an integrated flush-mount 36V 10.4Ah battery and three levels of pedal assistance. It tops out at 20 MPH and can carry the rider up to 20 miles on a single four-hour charge. It’s been equipped with 26-inch multi-surface fat tires for enhanced traction for wherever you’re riding – streets, off-road trails, bike parks, etc. It also sports front and rear disc brakes, a premium BMX padded seat, and a simple handlebar-mounted controller to switch between its settings.\n\nAmazon is bringing down the costs on the \n\n, with the model more regularly fetching $420. Husqvarna is one of the higher-end tool brands that see less frequent discounts than others, with this model, in particular, seeing a few price cuts over 2024, but still keeping above $335. Today though, we’re seeing a bigger markdown than ever before as $127 is being taken off its tag, landing it at a new all-time low that gives fans of the brand a great chance to upgrade at only 70% the usual cost.\n\nThis \n\n is one of several versatile models that falls within Husqvarna’s Combi Switch family, with the edger attachment able to switch out with over 14 others in a matter of moments, giving folks a more manageable system to perform their garden and lawncare duties without needing an individual tool for each job. The edger attachment sports an 8-inch steel cutting blade that provides a 2.5-inch cutting depth, along with a 6-inch adjustable wheel for smooth operations to keep your lines on a straight and narrow path. There’s no cords here to worry about either, with the Combi Switch motor ready to also take any other Husqvarna batteries you’ve invested in for longer runtimes too. \n\nAmazon is offering the \n\n. More recently fetching $80 at full price after falling from its $110 MSRP at the tail-end of last year, we’ve seeing this model drop as low as $35 direct from AeroGarden, and as low as $40 from Amazon, with the prices keeping around $80 since May. Today, costs are dropping a bit lower to usher in fall, with a 25% markdown that lands it among its lowest Amazon rates and gives you a great option to enjoy fresh veggies and herbs during the colder months ahead.\n\nOn the smaller and more compact end of AeroGarden’s lineup of hydroponic indoor gardens, \n\n utilizes a grow deck and water bowl to cultivate your favorite vegetables, herbs, or flowers so you can do away with messy soil for a tidier experience. You can grow up to three different plants at once to a size of up to 10 inches tall here, with a full-spectrum 10W LED grow light that expediates growth at up to five times faster a rate than if you were to use soil. It also comes with a Gourmet Herb Seed Pod kit to get you started, with all you need to grow and enjoy fresh Genovese Basil, Curly Parsley, and Dill.\n\nYou can go even bigger with your plant cultivation with \n\n which is currently going for \n\n. In this model, you can grow a total of six plants up to 12 inches tall – coming with its only six-pod seed kit for Genovese Basil, Curly Parsley, Dill, Thyme, Thai Basil, and Mint. It also includes a vacation mode that helps you keep your plants growing when you’re away from the house for longer periods. There’s also a special promotion on the \n\n that give you \n\n one unit when buying two or more, which you can \n\n.\n\nCourtesy of its \n\n, Best Buy is offering the popular \n\n. You’ll normally find this handy yard cart at $230 most days, with discounts only dropping every few months. We’ve seen costs this year brought down to $170 at the lowest during one of Best Buy’s previous one-day sales back in July, with the others keeping between $172 and $179 (the latter being its recent Prime Day rate). Today is bringing us the best price we’ve seen so far in 2024 at a $70 markdown – which is also \n\n too.\n\nAdding \n\n to your tool shed will make enormous jobs around your yard and/or garden far more manageable than your average wheelbarrow, with it sporting multi-use functionality and a 300-pound payload. It’s been designed to provide eight different configurations, able to transform in a few moments between a lightweight wheelbarrow to a yard cart, or even a bag holder, dolly – which extends further out too for larger transport jobs – as well as a cylinder carrier, rock/plant mover, or a trailer tote. If you’ve got some large-scale plans for your gardens/yard, you’re going to want a larger scale of support so you can properly show off your green thumb and/or landscaping prowess.\n\nThe savings this week are also continuing to a collection of other markdowns. To the same tune as the offers above, these all help you take a more energy-conscious approach to your routine. Winter means you can lock in even better off-season price cuts on electric tools for the lawn while saving on EVs and tons of other gear.\n\n ", "url": "https://electrek.co/2024/09/16/lectric-one-long-range-e-bike-exclusive-anker-f3800-bundle-hyper-bmx-e-bike-more/"},
{"title": "Wärtsilä makes a quantum leap with Quantum 3 utility scale BESS", "author": "Jo Borrás", "text": "The new Quantum 3 battery energy storage system (\n\n) from Wärtsilä is being describes as an intelligent, cutting-edge solution designed to meet the ever-evolving needs of \n\n.\n\nHoused in a 20-foot ISO container with single-side access, Quantum 3 is a complete AC block solution, with fully integrated and internalized batteries and string-based power conversion systems (PCS). That size was strategically chosen to facilitate global shipping and on-site transport using (relatively) small wheel loaders and \n\n, aiding in efficient on-site deployment and back-to-back configuration.\n\n – and if you haven’t ready about \n\n, you need to.\n\nQuantum 3 also features a sustainably designed housing (read: aluminum) for low weight, as well as advanced thermal controls that include low noise levels and a low global warming potential (GWP) cooling system, makes it a groundbreaking offering for meeting customers’ environmental and decarbonisation goals.\n\nWärtsilä built-in enhanced fire safety features are designed to ensure customer facilities are both fire-proof \n\n future-proof.\n\n“These are features we have worked extremely hard on and are very proud of. We have a proven track record of safe and reliable delivery worldwide,” says Andrew Tang, vice president of Energy Storage & Optimisation, Wärtsilä Energy. “Quantum 3 will help to further strengthen confidence among customers (utilities), local communities, and first responders that Wärtsilä’s systems will stand the test of time.”\n\nWärtsilä is sourcing Quantum 3 components from a geographically diverse set of suppliers, with manufacturing capacity across different regions of North America, Asia, and Europe. This should enable the company’s customers to take advantage of any local tax incentives while avoiding the kind of tariffs currently impacting global battery markets.\n\n: \n\n, via \n\n.\n\n ", "url": "https://electrek.co/2024/09/15/wartsila-makes-a-quantum-leap-with-quantum-3-utility-scale-bess/"},
{"title": "Kia eyes even cheaper $22K entry-level EV and new brand-building Stinger GT-like model", "author": "Peter Johnson", "text": " wants to change the game with a series of cheaper EVs set to hit the market. Several are already rolling out, like the new EV3, but Kia aims to lower the bar further with a new entry-level EV, starting around $22,200 (€20,000). On the other end of its EV lineup, Kia is eyeing a new Stinger GT-like model.\n\nWe got our first glimpse into Kia’s electrifying future during its \n\n last October. Kia revealed several new low-cost concepts, including the EV3, EV4, and EV5.\n\nKia is already calling the EV3 a “game-changer” as it rolls out to new markets. After opening EV3 pre-orders in Korea starting at just $30,700 (KRW 42.08 million) in June, Kia’s compact electric SUV secured \n\n in 23 days.\n\nLast month, Kia opened \n\n. Starting at $42,300 (£32,995), Kia deemed it the “brand’s most adorable EV yet.”\n\nBased on Hyundai’s E-GMP platform with its fourth-gen batteries (81.3 kWh), the EV3 offers up to 372 miles (600 km) WLTP range. In Korea, it gets up to 311 miles (501 km) driving range.\n\nNext year, Kia will follow it up with the EV4 hitting the market. The EV4 is Kia’s take on an electric sedan. It’s expected to start at around $35,000 to $40,000.\n\nAlthough these prices are already below or on par with a comparable gas-powered model, Kia plans to lower the threshold with even cheaper EVs set to join the lineup.\n\nKia has already confirmed that it will launch an EV2 model, priced around $30,000, within the next three years. However, the brand is eyeing an even lower-priced model.\n\nCEO Ho-Sung Song told \n\n during an EV3 test drive that Kia wants to launch an entry-level EV priced around $22,200 (€20,000).\n\nKia trademarked the names EV1 through EV9, opening up the possibility for cheaper EVs following the EV3. Song said the entry-level EV was the brand’s “next, next target” as it looks to lower the threshold for driving electric.\n\nAccording to Song, an EV priced below €20,000 would not be likely until after 2030. As new battery and EV powertrain tech emerge, Kia plans to continue lowering the price tag.\n\nThe EV3 starts at around €35,000 ($39,000) in Europe, while Kia’s EV2 is expected to start below €30,000 ($33,400).\n\nThe EV3 starts at 36k€ here in Germany. It is more affordable, but prices are still too high.\n\n“Our next target is an EV model starting from €30,000,” Song said. Yet Kia still believes “we need sub-€25,000 in our EV cars, and maybe we can leverage around €20,000,” Song explained. That “cannot happen in the next two years,” Kia’s CEO added.\n\nKia is also considering a brand-building electric car, like the Stinger GT, to top off the other end of the lineup.\n\n“What kind of model can help build the brand? This is what we are now studying,” Song said. While more incentives are needed, Song explained, “most OEMs are trying our best to reduce the cost of EVs” in the meantime.\n\nSong also confirmed that Kia is developing solid-state batteries that look “in every aspect quite better” than current EV battery tech. However, Kia’s CEO did not say when the company would put electric cars with solid-state batteries on the road.\n\n ", "url": "https://electrek.co/2024/09/16/kia-eyes-cheaper-22k-entry-level-new-brand-building-evs/"},
{"title": "Here’s when Ram’s first electric pickup will hit US dealerships", "author": "Peter Johnson", "text": " is preparing the all-electric Ram 1500 REV pickup for deliveries. According to CEO Christine Feuell, Ram’s first electric pickup is expected to arrive at US dealerships early next year. Here’s what to expect.\n\nThe Ram 1500 REV is about ready for customer deliveries. Feuell (via \n\n) said that Ram’s first electric pickup will begin arriving at US dealerships in early 2025.\n\nEven before \n\n during the Super Bowl last February, the company boasted that the electric pickup would outperform the competition.\n\nStellantis CEO Carlos Tavares claimed in 2022 that the Ram 1500 REV would “outperform all competitors” with best-in-class range, towing, payload, and charging times. Last April, Ram unveiled further details during \n\n at the New York International Auto Show.\n\nRam said the 2025 1500 REV will have \n\n – 168 kWh or 229 kWh. The former has a 350-mile targeted range, while the latter targets up to a 500-mile driving range.\n\nThe company also claims its all-electric pickup can tow up to 14,000 lbs with a 2,700 lbs max payload. With 800V fast charging, the Ram 1500 REV can gain around 110 mi range in roughly 10 minutes.\n\nIn comparison, Ford’s 2024 Lightning, with an extended range (131 kWh) battery pack, offers up to 320 miles EPA-est range and up to 10,000 lbs towing. Rivian’s R1T gets up to 420 miles range with 11,000 lbs max towing.\n\nTesla’s Cybertruck, which is taking the US market by storm, has an estimated driving range of up to 340 miles and can tow up to 11,000 lbs.\n\nAccording to \n\n latest data, 5,175 Tesla Cybertrucks were \n\n in July, nearly topping all other EV pickups combined with 5,546 registrations.\n\nWill Ram’s first electric pickup find its place in the US market? We will find out early next year. Ram has yet to reveal pricing, but the electric pickup is expected to start at upwards of $60,000. The 2024 Ram 1500 (gas-powered) starts at $41,415.\n\nFollowing the REV 1500, the company will launch the \n\n, an extended-range (gas-powered) model. The Ramcharger is essentially a hybrid pickup with a 3.6 liter V-6 engine.\n\nFollowing the REV 1500, the company will launch the \n\n, an extended-range (gas-powered) model. The Ramcharger is essentially a hybrid pickup with a 3.6 liter V-6 engine.\n\nTechnically not wrong as it is a form of hybrid (plug-in series hybrid to be specific), but the RAMcharger will have a 92 kWh battery and and its powertrain is 100% electric. I don't believe they've released all-electric range yet, but it will (at least) be in the 100 to 200+ mile range based on the fully electric version battery sizes.\n\nIt would be far more appropriate to describe the RAMcharger as an EV with a built in generator that takes the form of 3.6 liter V-6 engine. It think this is the direction full size trucks should go for now. 200 kWh battery packs just aren't practical right now. You can make 2 RAMchargers with the batteries for one REV and both will run full-electric almost all the time. Until battery prices come way down, a gas engine is a better option for the rare occasion that the owner needs to tow something than adding an extra EVs worth of batteries to the truck is.\n\nAfter that, Ram is expected to launch a mid-size electric pickup. However, production was delayed at its Belvidere, IL factory until 2027.\n\nRam owner Stellantis announced an over \n\n last week to retool three Michigan plants for EV production. Stellantis confirmed its Sterling Heights Assembly Plant (SHAP) will be the first in the US to build an all-electric vehicle, the Ram 1500 REV.\n\nStellantis also invested nearly $100 million into its Warren Truck Assembly Plant to prepare for Jeep’s first global EV, the Wagoneer S. It will be one of four Jeep EVs to launch by the end of 2025.\n\n ", "url": "https://electrek.co/2024/09/16/when-rams-first-electric-pickup-us-dealerships/"},
{"title": "BYD would still have the cheapest EV in the US, even with a 100% tariff", "author": "Peter Johnson", "text": "Even with the new 100% tariff on electric vehicles imported from China, \n\n would still have the cheapest EV in the US. According to a new report, BYD’s lowest-priced EV would still undercut all US automakers at under $25,000.\n\nAfter discontinuing the production of vehicles powered entirely by internal combustion engines in March 2022, BYD has been at the forefront of the industry’s shift to EVs.\n\nHowever, BYD has been building its supply chain for much longer. The company began building lithium-ion batteries in 1996. BYD’s batteries powered Motorola and Nokia’s popular smartphones in the early 2000s.\n\nIts early ventures into the battery industry helped BYD become the industry juggernaut it’s known as today.\n\nSince releasing its breakthrough Blade EV battery in 2020, BYD has continued introducing more efficient, lower-cost tech to drive down prices.\n\nBYD’s cheapest electric car, \n\n, starts at under $10,000 (69,800 yuan) in China. Its affordable electric and hybrid models are squeezing gas-powered vehicles out of China’s auto market, especially from foreign automakers.\n\nBYD has no plans to enter the US passenger vehicle market (it already sells electric buses), the company’s North American CEO Stella Li said. If it did, it could hold an advantage over US automakers.\n\nAccording to \n\n CEO Joe McCabe (via \n\n), BYD would still have the cheapest EV in the US, even with the new 100% tariff on Chinese electric vehicle imports.\n\nThe tariff will take effect on September 27 and is intended to “protect American manufacturers from China’s unfair trade practices,” according to a \n\n from The White House.\n\nMcCabe said BYD’s lowest-priced EV for the US would be $12,000. Even with a 100% tariff rate, BYD would have the cheapest EV in the US at under $25,000.\n\nTesla, which still holds a commanding lead (48% share in July) in the US EV market, has yet to break the $30,000 threshold.\n\nChinese automakers, like BYD, have an advantage with established supply chains, enabling lower prices.\n\nElectric vehicles accounted for over 50% of passenger vehicle sales in China in July. In the US, EVs \n\n of the light vehicle market during the same period, according to the latest \n\nfigures.\n\nChinese companies, including BYD and CATL, also dominate the global battery market. According to \n\n, CATL (35.9%) and BYD (16.5%) led global EV sales in the second quarter based on shipment.\n\nThrough the first eight months of 2024, CATL accounted for 37.6% of the global EV battery market, while BYD took second with 16.1%.\n\nBYD is not planning to launch passenger EVs in the US, at least not in the near term. However, McCabe’s comments should spark concern among some US rivals.\n\nAs BYD continues launching lower-priced EVs with more range and advanced features, several US automakers continue delaying significant projects.\n\nFord \n\n, opening the door for overseas rivals like Kia and Hyundai to take advantage. GM is also pushing back its battery factory in Indiana and could turn to CATL for LFP batteries in the US, like Ford and Tesla.\n\n“Instead, investing in building a domestic supply chain, as it has with recent legislation, like the Bipartisan Infrastructure Law, will incentivize US automakers. A stable US domestic supply chain would help reduce the price of EVs, lowering the threshold and promoting adoption.”\n\nThis is exactly what a small group of extreme right-wing Texas oil drillers don’t want. They are stuffing the pockets of a group of politicians  and friendly media outlets to demonize the EV industry, and it’s having a devastating effect on EV sales nationwide. \n\nThey and their PR teams are successfully getting mainstream media to include toxic FUD words such as “range anxiety” in every article and video, effectively scaring consumers. \n\nThey have made their demonization a political issue, resulting in knuckle-dragging, smooth-brained pickup truck owners to block public charging stations. \n\nThis polarization and FUD is protecting the status quo by dominating a false narrative. It saddens me. It’s caused companies like Ford to retreat, allowing foreign competitors to step into the void. Will a once in a lifetime opportunity be lost forever?\n\nFord is shifting its focus to smaller, more profitable EVs after seeing the success of Chinese automakers like BYD. Ford’s CEO Jim Farley called BYD’s Seagull “pretty damn good” as he warned rivals of BYD’s advantage.\n\nThe fact is tariffs will likely only lead to more EV delays, putting the US further behind as the global auto industry shifts to electric.\n\nInstead, investing in building a domestic supply chain, as it has with recent legislation, like the Bipartisan Infrastructure Law, will incentivize US automakers. A stable US domestic supply chain would help reduce the price of EVs, lowering the threshold and promoting adoption.\n\nSource: \n\n ", "url": "https://electrek.co/2024/09/17/byd-would-have-cheapest-ev-us-100-tariff/"},
{"title": "A Tesla Semi has already traveled 250,000 miles: here’s what we learned about the electric truck", "author": "Fred Lambert", "text": "We learned a lot about Tesla Semi thanks to a new presentation from the head of the electric truck program at Tesla, including the fact that Tesla ran one of the trucks 250,000 miles (400,000 km) already.\n\nTesla Semi has already been “in production” for almost 2 years, but the production has been very limited and one could even argue that it was a “pilot” run until Tesla brings the vehicle to volume production at\n\n.\n\nThe automaker is believed to have built a fleet of about 100 Tesla Semi trucks and it is mostly using them internally and with its customer-partner PepsiCo.\n\nNow, Dan Priestley, the head of the Tesla Semi program, has given a presentation at the IAA conference in Germany today to give an update on how the program is going.\n\nA video of the presentation hasn’t surfaced yet, but people attending the event have released images of the slides and some of the highlights of the statistics revealed by Priestley:\n\nFor example, we learn that the Tesla Semi fleet has already traveled 7.5 million miles and that a single truck has traveled 250,000 miles (400,000 km) over the last 1.5 years.\n\nThanks to the resurgence of consumer electric vehicles, we already know that electric powertrains could deliver better performance in commercial trucks, but many still doubt that the batteries will have the energy capacity and longevity to make commercial electric trucking viable.\n\nThis data should help convince more people.\n\nWith \n\n with virtually the same capacity of a diesel truck, Tesla is making the argument that a Tesla Semi can replace a diesel class 8 truck one-for-one.\n\nPriestley also claimed that Tesla is seeing 95% uptime with the trucks, which is important as downtime means losing money for trucking companies.\n\nThe arguably most important information to come out of the presentation is that the current Tesla Semi fleet is proving an efficiency of 100 kWh to travel 100 km (62 miles):\n\nAt 1.6 kWh per mile, this is a little better than the 1.7 kWh per mile that Tesla previously predicted.\n\nThe engineer said that Tesla plans to deliver the electric trucks to more customers this year, but volume production is going to come with the new factory next year.\n\nThe goal is to reach an annualized production capacity of 50,000 trucks in 2026.\n\nThis is awesome. Again, Tesla Semi is the program I am most excited about at Tesla right now. Based on its history of delivering efficient electric vehicles in volume profitably, I think Tesla is the one to make commercial electric trucks happen at scale.\n\nThere are already many competitors out there, but none are currently talking about 50,000 units per year, which would make a real impact on the industry, by 2026.\n\nIt's not a question of if it is more efficient or not, it is. Electric vehicles are. But the real question is from an economic standpoint, does it make sense from a total trade off of payload? Diesel is expensive, but in terms of payload, it ain't that expensive.\n\nIf these numbers are accurate, I think it could actually work,\n\nNow, the bigger problem to solve is going to be the infrastructure as we are going to adapt truck stops to support megawatt charging at scale. It’s not an easy problem, but it is solvable and worth doing to decarbonize commercial transportation.\n\nIf we couple that charging to cheap renewable energy, we have a winning solution.\n\n ", "url": "https://electrek.co/2024/09/17/tesla-semi-traveled-miles-presentation-electric-truck/"},
{"title": "Maersk, PepsiCo, others to pilot a heavy-duty EV charging corridor between LA and El Paso", "author": "Michelle Lewis", "text": "Some of the world’s largest shippers and carriers will pilot heavy-duty EV charging along the “first-ever US over-the-road electrified corridor.”\n\nGlobal nonprofit \n\n today announced the launch of the shipper-carrier coalition, which includes AIT Worldwide Logistics, DB Schenker, Maersk, Microsoft, and PepsiCo. \n\nThe coalition will test long-haul heavy-duty BEV operations along the I-10 corridor between Los Angeles and El Paso, Texas. \n\n will provide charging infrastructure, including software, operations, and maintenance support, at six of its owned charging hubs along the I-10 corridor. \n\nNeha Palmer, CEO and cofounder of Terawatt, said, “As we continue to build out the I-10 electric corridor and utilize the recent $63.8M in grant funding alongside [New Mexico Department of Transportation] to develop reliable charging infrastructure solutions, we have a historic opportunity to work with global leaders who share our vision and investment into the sustainable future of mobility.”\n\nThe point of the pilot is, of course, to learn by putting the charging infrastructure in place and deploying heavy-duty EVs in a real-life situation. The bigger-picture aim is to share learnings with other shippers and carriers so that they, in turn, also transition to electrification at scale. The shipper-carrier coalition also wants to encourage technology providers to accelerate the development of turn-key solutions for electric transport.\n\nThe launch of this coalition aligns with the federal government’s National Zero-Emission Freight Corridor Strategy, which lays out a framework for electric truck adoption and charging infrastructure deployment.\n\nChristoph Wolff, CEO of the Smart Freight Centre, said, “Through this coalition, we seek to jointly accelerate the uptake of long-haul EV heavy-duty trucks. Together with Terawatt and other coalition partners, we look forward to accelerating freight decarbonization and proving that the electric truck corridor can promptly become operational at low volumes and rapidly scale up afterward.”\n\n \n\n ", "url": "https://electrek.co/2024/09/17/maersk-pepsico-heavy-duty-ev-charging-corridor/"},
{"title": "Exclusive Bugatti 10 Max e-scooter $350 off, GoTrax Everest dirt bike $2,000 off, Jackery Explorer 100 Plus $89, more", "author": "Reinette LeJeune", "text": "Today’s Green Deals are jam-packed with returning and new lows alike – and even an exclusive deal leading the pack in the form of \n\n that drops to \n\n once you’ve taken advantage of the promo code below. \n\n is returning after so many months at $2,000 off for a \n\n. There’s \n\n that fits in your hand (and stores away in your bag) at a \n\n, as well as a new low price on the \n\n for the rest of the day that also has a parallel bundle option with the brand’s \n\n that drops it to \n\n. The last of these deals is on the \n\n which has returned to its \n\n. Plus, all the other hangover Green Deals in the links at the bottom of the page that are still alive and well, like yesterday’s \n\n that gives you an extra battery for 100+ miles of travel, and more\n\nHead below for other New Green Deals we’ve found today and, of course, \n\nand \n\n. Also, check out the new \n\n.\n\nWe’ve got another exclusive discount for \n\n readers coming to us from Wellbots, this time on a powerful commuter solution in the form of \n\n, \n\nNormally priced at $1,599 here, with a higher $1,600 MSRP direct from Bugatti, we’ve only seen one previous discount on this particular model that came from Costco for a short period and dropped costs down to the $1,000 low. Today’s deal comes in as a 22% markdown that lands it at the second-lowest price we can find, giving you a chance to shave $350 off this higher-end e-scooter.\n\nComing in four colorways, \n\n arrives “inheriting the DNA of the world’s fastest production car” and sporting a sleek, aerodynamic design with a lightweight, magnesium alloy frame. It cruises into view with a 500W motor that peaks at 1,000W to provide faster acceleration times, tackle inclines up to 18%, and challenge any rougher terrain – with extra support from the hidden suspension and 10-inch self-healing tires. The scooter’s 36V 15.6Ah battery ensures a travel range of up to 37 miles on a single charge, with three riding modes (eco, city, sport) to set different speed limits and prolong/shorten travel distance depending on your chosen setting.\n\nThe 10 Max e-scooter has also been given lighting all around its frame for added safety while riding at darker hours, with front headlights, dual turn signal lights, base lights around its sides, and a rear brake light – plus, in true Bugatti fashion, the back-end also projects an “EB” monogram logo onto the ground behind you. There’s also a beautifully integrated touchscreen display to adjust settings, activate its cruise control functions, and lock/unlock the scooter via a passcode for added security.\n\nCollected together in its \n\n, Best Buy is offering a huge one-day deal on the \n\n for the rest of the day. Regularly fetching $6,000 at the moment after falling from its $6,500 MSRP a few months ago, this model has seen very few discounts since first releasing a year ago, first to $6,000 during its first month on the market and again during Christmas sales. We’ve also seen two previous one-day sales from earlier in 2024 that only ever brought costs down to $5,500 at most. Well today, folks are getting the best deal we’ve seen yet at a massive $2,000 markdown that lands it at a new all-time low price.\n\nThe \n\n jets out of the gates with a massive 4,000W rear-drive motor that peaks at 8,000W of terrain-conquering power and tops out at speeds of 53 MPH. The 72V removable battery gives this model 50 miles of traveling range, which can be fully recharged in about four hours. It’s been given plenty of additional features for an even more enhanced motocross experience, like multiple riding modes, hydraulic disc brakes, dual-shock suspension, and deep-tooth off-road tires. There’s also the dual headlights, a taillight that provides braking and turn signal functionality, mudguards, and an LED digital display. It’s also surprisingly lightweight for a dirt bike – even an electric model – with everything totaling up to 172 pounds.\n\nComing to us through its official Amazon storefront, Jackery is offering its \n\n, \n\n. Normally priced at $149, we’ve seen two different rates dropping across 2024, with most of them dropping to $100 and one short-term instance of it falling further to $90 during July’s Prime Day event. Today though, Prime Day is taking a back seat as costs get taken $1 lower with this combined $60 markdown that etches out a new all-time low price.\n\nJackery’s \n\n is a great alternative for folks in need of far more juice for their personal devices than most of the pocketable power banks can provide, delivering a 99Wh LiFePo4 capacity (31,000mAh) and a 128W power output. Its more compact size can easily be stashed away inside your bag to carry with you throughout your everyday life on top of covering you for fun trips camping and the like. There’s dual USB-C ports and a single USB-A port here for your device’s charging needs, with the unit itself only taking an hour to fill 70% of its battery when connected to a standard wall outlet (under two hours for 100%). If you plug in a 100W solar panel, you can expect a full battery via solar charging in about two hours – or, you can plug it into your car’s auxiliary port for a full charge in up to three hours.\n\nThere’s a couple bonus offers here to consider too, with the first being a bundle that gives you the \n\n, \n\n You can also receive a \n\n when purchasing \n\n.\n\nWe’ve just spotted amazing one-day back-to-back deals for folks in need of a powerful solution to clean up their driveways, walkways, and more. Available as part of its \n\n, Best Buy is offering the popular \n\n. Normally priced at $450, this standalone model has seen far more discounts over at Amazon than it has at Best Buy, where its fully-detailed combo kit is more frequently featured. It’s mainly been keeping around $360 throughout 2024, with some discounts taking things further to the former $300 low in July and $310 just two weeks ago. Today though, we’re seeing those prices beaten out in strides by this $160 markdown that drops things lower than ever to a new all-time low – \n\n too. Head below to learn more about this model, as well as the bundle option to increase its cleaning power with extra savings.\n\nThis \n\n systems come housed within a heavy-duty frame, sporting a 14A TruBrushless motor to max out at an impressive 3,000 PSI with a 1.1 to 2.0 GPM flow rate too. If the higher pressure rating wasn’t enough, there’s also an onboard one-gallon detergent tank and a bunch of included accessories too – with five versatile nozzles that can be stored inside the provided space alongside the 25 feet of non-marring hose. To help save you money while ensuring a longer lifespan for its motor, it’s been given Greenworks’ Total Stop System that shuts off the pump the moment the trigger is disengaged.\n\nThe second of these Deals of the Day is the \n\n that starts at \n\n down from $80 – plus, if you bundle it here today with the above pressure washer, you’ll save even more as the price drops down to \n\n. It has an easy quick-connect feature for a faster and more effortless setup, with dual cleaning nozzles on its underside to level up the pressure washer’s cleaning power and coverage area. You can also buy this attachment separately for any Greenworks pressure washer that is rated for up to 3,100 PSI.\n\nAmazon is now offering an electrified fun time in the form of \n\n. Normally fetching $900, with an even higher $950 price tag coming directly from Razor, this model has seen a rare handful of discounts over the year so far, first hitting $689 in 2024 back at the start of the year and slowly climbing higher in price since. From March through July, we’ve only seen it riding along at $831, with August bringing steady increases up to $900. Today, we’re getting a much-needed break from these higher rates with a 23% markdown that cuts $211 off the tag and returns costs back to the lowest price we have tracked in 2024.\n\nThis \n\n is more tailored for fun rather than getting you out and about town for your appointments, though if you’re only going a short distance, it can still get the job done in that regard. The miniaturized supersport motorcycle-inspired frame houses a 650W chain-driven motor and a 36V battery that work together to offer up to an hour of runtime before it needs a recharge. You or your kids will be able to cruise around at an impressive 17 MPH, with added features for your comfort (It is a micro model afterall). There’s 14-inch street tires, a rear suspension, a variable speed twist-grip throttle, and rear disc brakes to ensure a fun joyride for all who jump aboard, and even includes a surprise hidden storage compartment too.\n\nThe savings this week are also continuing to a collection of other markdowns. To the same tune as the offers above, these all help you take a more energy-conscious approach to your routine. Winter means you can lock in even better off-season price cuts on electric tools for the lawn while saving on EVs and tons of other gear.\n\n ", "url": "https://electrek.co/2024/09/17/exclusive-bugatti-10-max-e-scooter-350-off-gotrax-everest-dirt-bike-2000-off-jackery-explorer-100-plus-89-more/"},
{"title": "The US announces the Gulf of Maine’s first offshore wind lease sale", "author": "Michelle Lewis", "text": "The US Department of the Interior (DOI) will hold an offshore wind energy lease sale in the Gulf of Maine for up to 13 GW of clean energy capacity. \n\nThe offshore wind lease sale in the Gulf of Maine will be held on October 29, 2024, for eight areas on the Outer Continental Shelf off Massachusetts, New Hampshire, and Maine, as per the Final Lease Areas in green on the map below:\n\nThe Bureau of Ocean Energy Management (BOEM) notes that a lease provides the right to submit project-specific plans. Submitted plans are subject to environmental, technical, and public reviews prior to a decision on whether the project proposals should be approved.  \n\nIf fully developed, these eight areas have a potential capacity of approximately 13 gigawatts (GW) of clean offshore wind energy that could power more than 4.5 million homes.\n\nThe area included in the Final Sale Notice (FSN) is approximately 120,000 acres less than the nearly 1 million acres announced by BOEM in April in its \n\n. BOEM says it “prioritized the avoidance of offshore fishing grounds, sensitive habitats, and existing and future vessel transit routes while still retaining sufficient acreage to support the region’s offshore wind energy goals.”\n\nThe DOI has approved more than 15 GW of offshore wind since the start of the Biden-Harris administration – half the capacity needed to achieve President Biden’s goal of 30 GW of offshore wind by 2030.\n\nLiz Burdock, CEO of the offshore wind nonprofit Oceantic Network, said in an emailed statement, “Oceantic Network fully supports BOEM’s advancement of offshore wind in the Gulf of Maine. Today, they’ve established eight Wind Energy Areas capable of generating up to 13 GW – nearly half of the nation’s 30 GW goal and the majority of its 15 GW floating offshore wind goal. This represents a monumental step forward for floating offshore wind technology not only in the US, but globally.”\n\n \n\n ", "url": "https://electrek.co/2024/09/17/us-announces-the-gulf-of-maine-first-offshore-wind-lease-sale/"},
{"title": "What do you think of Kim Kardashian’s painted Tesla Cybertruck?", "author": "Fred Lambert", "text": "Kim Kardashian had her Tesla Cybertruck modified and even painted – a rare thing for the electric pickup truck.\n\nDope or nope?\n\nTesla is starting to ramp up cybertruck production significantly, with tens of thousands of them on US roads. \n\nUnless the owner decides to modify their Cybertrucks after purchasing them from Tesla, they will all look the same because the only factory finish is the natural stainless steel of the vehicle’s body. This incentivizes aftermarket modifications.\n\nWe have seen plenty of wrapped Cybertrucks by now. It is the most popular way to change the truck’s color since stainless steel is difficult to paint.\n\nBut that didn’t stop Kim Kardashian.\n\nThe ultra-popular media personality has been an early Cybertruck owner, but she has now got hers modified (or bought a new one, unclear) and it is one of the most interesting aftermarket modifications that we have seen to date.\n\nPlatinum Motorsport Group, a LA-based custom vehicle tuner, unveiled the modified Cybertruck on their \n\n:\n\nIf one is going to paint it, why does it still look like not painted 🙂\n\nThe most interesting thing about this is that it is the first, or one of the first, painted Tesla Cybertruck. Both the body and the trims were painted in a custom gray color, like most of Kardashian’s extensive car fleet.\n\nThe fact that the body and the trims, including the bumpers, which are normal black on the Cybertruck, were painted gray to match the body.\n\nThe Cybertruck also sports 26” Forgiato Travis Scott forged wheels, a stark contrast to the electric truck’s base 20″ wheels.\n\nWhat do you think of this modified Tesla Cybertruck? Let us know in the comment section below.\n\n ", "url": "https://electrek.co/2024/09/17/kim-kardashian-painted-tesla-cybertruck-dop-nope/"},
{"title": "GM’s top-selling EV in China is getting an update leaked images reveal", "author": "Peter Johnson", "text": "GM’s joint venture \n\n (SGMW) is launching an updated Wuling Hongguang Mini EV in China. Once the best-selling EV in China, with starting prices around $4,000, sales of the mini EV have slipped as new competition enters the market. The company hopes an updated model can help turn things around.\n\nAfter hitting the market in 2020, the Wuling Mini EV quickly climbed the sales charts in China. In 2021, the electric mini car topped \n\n to become the top-selling EV in China.\n\nDespite its extremely small size at just 2,918 mm long, 1493 mm wide, and 1,621 mm tall, starting at just $4,000 (28,800 yuan), the mini EV was hard to pass up.\n\nHowever, that was over three years ago, and China’s auto market is moving quickly. New competition has led to aggressive EV price cuts from market leaders like BYD, making it hard for foreign automakers to keep up.\n\nIt looks like GM’s SGMW has a plan to revamp sales. The new Wuling Hongguang Mini EV was leaked by China’s \n\n latest release.\n\nThe data reveals the new model is slightly bigger at 3,256 mm long, 1,510 mm wide, and 1,578 mm tall.\n\nYou will also notice the Mini EV is getting a facelift. The new exterior design is an improvement with a slightly less boxy, more modern shape.\n\nAccording to the regulatory filing, the mini EV will be powered by a single rear electric motor and lithium iron phosphate (LFP) battery.\n\nAlthough prices are yet to be revealed, the current model starts at about $4,600 (32,800 yuan). With discounts, prices can fall as low as $3,500 (25,000 yuan). The new model is expected to launch with similar ultra-low prices.\n\nSales of the mini electric car have fallen from nearly 395,500 in 2021 to about 405,000 in 2022, and last year, only 237,863 Wuling Hongguang Mini EVs were sold. GM’s joint venture hopes an updated version of its top-selling EV can help charge up sales in China.\n\n ", "url": "https://electrek.co/2024/09/17/gms-top-selling-ev-china-getting-upgrade/"},
{"title": "CATL launches ultra-high-energy-density EV bus battery that lasts nearly 1 million miles", "author": "Peter Johnson", "text": "CATL launched its newest battery, the Tianxing Bus version, opening a new era for buses. With “the highest energy density in the bus industry,” \n\n claims its new EV battery can last 15 years and 1.5 million kilometers (932,000 miles).\n\nThe world’s largest EV battery maker is not slowing down. Over the weekend, CATL released its new “tailor-made” battery for the bus industry.\n\nCATL said it improved the energy density by 22% compared to the previous generation. With 175 Wh/kg, CATL claims its new Tianxing Bus battery leads the industry.\n\nThe new Tianxing battery is designed specifically for buses and can last up to 1.5 million km (932,000 miles) and 15 years. CATL also said it has an “ultra-long warranty” of ten years or 1 million km (621,400 miles).\n\nCATL already has 13 companies waiting for the new battery, which will enter mass production soon. According to CATL, it will power 80 electric buses.\n\nHao Huan, CTO of CATL’s domestic passenger division, said the new electric bus battery “pays tribute to the 10 years of vigorous development of China’s commercial vehicle market.”\n\nThe new battery is the latest from CATL’s Tianxing (Tectrans) commercial brand. In July, CATL launched the new series with its first \n\n designed for light commercial vehicles.\n\nAfter dominating the passenger EV segment, CATL is looking to new segments to boost growth. Its new target is commercial vehicles.\n\nAccording to the latest \n\n data, CATL accounted for 31.6% of \n\n in the second quarter. China’s BYD was second with 14.7% of global battery sales. As of August 2024, CATL held a 37.6% share of the global EV battery market\n\nAccording to a recent report, CATL is \n\n to its six already planned globally. CATL is planning new factories in Germany, Thailand, Hungary, Indonesia, and two in the US (Ford and Tesla). \n\nA third in the US could be possible with \n\n with Japan’s TDK that would license tech from CATL for LFP batteries.\n\n ", "url": "https://electrek.co/2024/09/16/catl-launches-new-ev-battery-lasts-nearly-1-million-miles/"},
{"title": "Tesla is pulling heavy financing weaponry in end-of-quarter push", "author": "Fred Lambert", "text": "Tesla has pulled the heavy weaponry when it comes to financing to boost sales during its regular end-of-quarter push.\n\nTesla has regularly introduced price cuts and incentives at the end of every quarter in order to boost sales and lower inventory.\n\nIt helps quarterly financial results look better as Tesla has already spent the money to build those vehicles and if they are not delivered by the end of the quarter, they end up in its “inventory” without generating any revenue.\n\nRecently, Tesla introduced, or reintroduced, incentives across its entire EV lineup except for the Cybertruck. \n\nFor example, \n\n, which basically result in a $1,000 discount on new cars.\n\nLately, Tesla has been subsidizing financing on its vehicles as a incentive.\n\nNow, the automaker has introduced zero down payment on Model 3 and Model Y vehicles, which can be combined with much lower APR:\n\nIf you put an ‘excellent’ credit rating in Tesla’s online configurator, you get a 5.59% interest rate, but if you choose the new “promotion” credit rating, Tesla is offering 0$ down payment and APR at 2.49%.\n\nWith a small down payment, you can get the rate down to 1.99%.\n\nThe promotion is running until September 30, which coincides with the end of the quarter.\n\nThis might be Tesla’s biggest promotion of the year. Compared to current interest rates, 2% is basically free money and the fact that nothing is due at delivery should attract a lot of people.\n\nI would expect that it will help Tesla clear its US inventory this quarter.\n\nBasically this is another \n\n discount, but done in a way that does not \n\n show up in the profit margins or operating margins this quarter due to the way Tesla does its financial accounting. Basically this is just creating losses for the next 2 years just to pad the numbers for this quarter.\n\nHowever, as we have previously reported, \n\n.\n\nTherefore, it is still unclear if Tesla can grow sales this quarter. The automaker delivered 444,000 vehicles last quarter and 435,000 vehicles in Q3 2023.\n\nTesla is currently tracking to have its first year with a reduction in EV deliveries in a decade.\n\nInvestors will also be tracking profit margins as this new referral program and the subsidizing of financing should negatively impact margins. \n\n ", "url": "https://electrek.co/2024/09/16/tesla-pulling-heavy-financing-weaponry-in-end-of-quarter-push/"},
{"title": "Hyundai’s adventure-ready 2025 IONIQ 5 XRT spotted for the first time [Video]", "author": "Peter Johnson", "text": "Hyundai’s aggressive new IONIQ 5 XRT model was spotted in Korea for the first time ahead of US deliveries. The off-road XRT trim will arrive at US dealerships alongside the updated 2025 IONIQ 5 this fall. With deliveries coming up, \n\n new EV was finally caught out in the wild. Check out the video to see a closer look.\n\nAfter launching the IONIQ 5 in Seoul in February 2021, Hyundai’s midsize electric SUV has steadily climbed the EV sales charts globally.\n\nThe IONIQ 5 was the \n\n in the US last year. Through the first eight months of 2024, Hyundai has sold nearly 27,000 IONIQ 5’s in the US, up 26% from last year. Despite its success, the electric SUV is getting an upgrade.\n\nHyundai unveiled the \n\n earlier this month, which offers more driving range, features, and style. It will also come with a rugged new off-road-focused XRT trim.\n\nThe XRT model “adds rugged capability to America’s most awarded EV lineup,” Hyundai said during the reveal. \n\nHyundai said the off-road model is for those “who want to play in the first and have all-electric adventures.”\n\n“We designed this IONIQ 5 XRT to offer more Protection, Connection, and Functionality,” Hyundai’s senior design manager of exteriors, Brad Arnold, explained.\n\nThe XRT trim includes unique features like digital camouflage cladding, +23mm suspension lift, 18″ black wheels, and XRT-exclusive front and rear bumpers.\n\nOn the inside, it features XRT-badged all-weather floor mats, H-Tex seating with the XRT pattern and logo, and exclusive colors (Ultimate Red and Cosmic Blue Pear).\n\nAhead of deliveries, the Hyundai’s new IONIQ 5 XRT was spotted in Korea for the first time. The video from the folks at \n\n gives us our closest look at the rugged new trim.\n\n.\n\nYou will also notice it sits slightly higher for off-roading. Hyundai’s XRT model has 7″ of ground clearance compared to the standard model’s 6″.\n\nBased on the updated 2025 IONIQ 5 (Hyundai’s E-GMP platform), the XRT trim is equipped with its fourth-gen 84 kWh battery and has an EPA-estimated range of up to 280 miles (451 km). It also includes a dual-motor (AWD) powertrain with up to 300 hp.\n\nOne of the biggest changes in the updated IONIQ 5 is the new \n\n to access Tesla Superchargers.\n\nThe XRT trim is expected to start at around $49,000. It will be built alongside the updated 2025 IONIQ 5 as the first model range produced at its new Metaplant America facility in Georgia.\n\nHyundai said vehicles built at the facility will qualify for a $3,750 federal tax credit. Once the battery unit opens at the facility next year, Hyundai’s US-made EVs are expected to qualify for the full $7,500 credit.\n\nWould you buy Hyundai’s rugged new IONIQ 5 XRT? Let us know your thoughts in the comments below.\n\n ", "url": "https://electrek.co/2024/09/16/hyundais-new-ioniq-5-xrt-spotted-first-time-video/"},
{"title": "Lotus’ wild 200mph ‘Theory 1’ EV signals return to form for the brand", "author": "Jameson Dow", "text": "Lotus has unveiled a new EV concept which it calls “Theory 1,” a lightweight(-ish) electric sportscar concept inspired by the Lotus Esprit with nearly 1,000hp and capable of speeds up to 200mph.\n\nHere at \n\n, we see and report on a \n\n \n\n \n\n \n\n \n\n. These concepts are often accompanied by long treatises on how the design incorporates various “core principles,” unnecessary branding of things that will never make it to production, and \n\n.\n\nIn a way, the Theory 1 is no different. My eyes glazed over at the 2,000+ words in Lotus’ \n\n before reaching the table of technical specs.\n\nAnd yet, there is still something here, because this is Lotus – a company with an incredibly significant motorsport heritage… and a significant electric car heritage too.\n\nLotus is the company that provided the lightweight “gliders” on which the original Tesla Roadster, the car that started the modern electric vehicle era, was built.\n\nAnd lately, Lotus has gotten into electric cars on its own, with the \n\n and the consumer-focused \n\n and \n\n.\n\nBut you’ll notice – one of those things is not like the others. Despite being a company famous for its focus on small cars, owing to founder Colin Chapman’s theory to “simplify, then add lightness,” the Eletre and Emeya are both over 5,500lbs, more than twice the weight of the original Tesla Roadster.\n\nAnd so, Lotus’ new Theory 1 – packed full of probably-unrealistic concept features, but also clearly going downmarket from the Evija’s eyewatering $2million pricetag – could signal somewhat of a return to form for the wayward small-car maker.\n\nThat’s because its curb weight is listed at a much more reasonable 1600kg, or 3,527lbs. This is still hefty compared to the absolute lightest vehicles on the road right now, but it’s on the lower end of most powerful sportscars available today (including lighter than the Evija), quite low compared to other EVs, and significantly less than some \n\n.\n\nIt’s also a lot more than the original Lotus Esprit which the Theory 1 takes inspiration from, which began at around 2,000lbs. But later versions of the same vehicle weighed as much as around 3,000lbs, not too far off from the Theory 1.\n\nIn that relatively small package, Lotus claims it has fit some great performance specs.\n\nIts 986hp powertrain is capable of sprinting 0-100km/h (62mph) in less than 2.5 seconds, with a top speed of 320km/h (198mph).\n\nEnergy comes from a 70kWh battery with a 250 mile range. This is a little smaller than some of the larger batteries we’ve seen around (the Eletre has a 112kWh battery, for example), but that’s the benefit of having a light, low-slung vehicle.\n\nBut specs don’t tell everything about how a vehicle feels to drive. And Lotus is promising to bring exceptional driving dynamics to this vehicle, through methods like including the motor and battery as stressed members and mounting the rear wing directly to the suspension assembly.\n\nIt also wants to use steer-by-wire, a technology which has been thought about for a long time but only recently has made its way into production vehicles, like the Lexus RZ and Cybertruck.\n\nBut perhaps the most striking part of the driver experience on the Theory 1 is its 3-seat design, seating the driver in the center of the vehicle, similar to the famed McLaren F1.\n\nThe car’s light weight comes from extensive use of advanced materials like carbon fiber and titanium, which are sure to boost the price of this vehicle if they make it to production. In that previously-mentioned 2,000 words, there’s plenty of talk about 3D printing and recycled materials as well.\n\nBut Lotus says that it wants to reduce the amount of “A-surface materials” – those you can touch – down to 10 or fewer, compared to the 100-or-so in most cars.\n\n“There’s been this period of maximalism, and people having to do one-upmanship and go above, above, above. And I think we’ve reached that point where it plateaus in stylistic terms, and also in the demonstration of tech. We’re not in a crazy numbers race with this car.”\n\n -Lotus design VP Ben Payne, as \n\nSo the original Lotus philosophy of “simplify, then add lightness” is certainly present in this concept, signaling a return to form for the brand after a few years of wandering in the desert.\n\nFinally, while we are just talking about a concept here, we’ve certainly seen plenty of EV concepts \n\n in some way or another. Even particularly wild ones like the \n\n ended up being made into the \n\n sportscar.\n\nSo we might even see this Theory 1 show up on the road at some point. But, even if we don’t, at least it shows that Lotus is back to thinking about \n\n (as they should have been all along…), and we’ll hopefully get a real EV sportscar out of them in a few years.\n\n ", "url": "https://electrek.co/2024/09/17/lotus-wild-200mph-theory-1-ev-signals-return-to-form-for-the-brand/"},
{"title": "Tesla produces 100 millionth battery cell, here’s what it means", "author": "Fred Lambert", "text": "Tesla has announced that it produced its 100 millionth 4680 battery cell. Here’s what it means for its production growth.\n\nThe 4680 battery cell is a new format, 46mm x 80mm, enabled by a few new technologies that Tesla announced at Battery Day in 2020.\n\nIt’s the first time that Tesla is manufacturing its own battery cells – although other cell manufacturers have since announced plans to build batteries in this new format.\n\nAs with any new technology, the production ramp has been difficult. Four years later, Tesla has yet to reach its goal for the 4680 cell, but it did announce an important milestone this weekend.\n\nTesla says that it produced its 100th millionth 4680 cell:\n\nThe Tesla Optimus humanoid robot holding the cell has reportedly played a small, emphasis on “small”, role in manufacturing the cell.\n\nCumulative production is not a very useful metric to track battery production, but it is a new data point.\n\nTesla announced that \n\n.\n\nPrior to that, \n\n. However, the early production was at Tesla’s pilot plant in California rather than Gigafactory Texas. It’s unclear if these count into the total.\n\nBut we now know that Tesla produced 90 million battery cell in the last 14 months.\n\nThe bulk of that production is expected to have happened more recently as Tesla is ramping up production to support Cybertruck production.\n\nTesla’s 4680 cell is believed to have an energy capacity of roughly 100 Wh, which would mean that Tesla has produced about 9 GWh worth of 4680 cells over the last 14 months or enough for over 60 ,000 Tesla Cybertruck.\n\nAlthough, some of those cells were likely used for Model Y production before Tesla switch to Cybertruck production.\n\nA month ago, \n\n – an important step toward achieving its goals for the cell.\n\n100M cells would enough for around 75K cyber trucks with around 1344 cells each. So, that matches their production ramp-up since the beginning of the year and a few model Ys. And perhaps a few semis.\n\nInteresting to note that the market is heading for over production. Bloomberg NEF is tracking multiple twh of battery factory related investments for next year. So, that means prices might drop. Which is not necessarily beneficial for this particular cell as long as they are still trying to scale up production and reduce cost. Part of the promise of this cell was to use it as a structural component; which means you cannot easily swap it for something else.\n\nWhen this cell was originally announced, there was actually a battery shortage. And LFP is now pretty common. And soon some solid state battery production should ramp up; possibly to similar levels soonish. So, there is a bit more choice in the market.\n\nTesla appears to be making real progress in terms of ramping up production of 4680 cells.\n\nHowever, that’s just part of the puzzle. The cell is supposed to bring cost improvements, energy density improvements, and longevity improvements. Those remain to be seen.\n\nWe previously shared a report that stated CEO Elon Musk gave Tesla’s 4680 team by the end of the year to deliver on those improvements. The CEO himself noted that the need for Tesla to produce its own cell has been reduced as other automakers reduced their EV goals – freeing up battery production capacity from manufacturers.\n\nTesla aims to reach cost parity with those manufacturers with its own battery cell by the end of the year.\n\n ", "url": "https://electrek.co/2024/09/16/tesla-produced-100-millionth-battery-cell-heres-what-it-means/"},
{"title": "Tesla Cybertruck deliveries start in Mexico, in a month in Canada", "author": "Fred Lambert", "text": "Tesla Cybertruck deliveries are starting in Mexico this week and the automaker says that Canada should follow in about a month.\n\nDrone flyovers of Gigafactory Texas show that Cybertruck production has ramped up as of late.\n\nAs we previously reported, Tesla has worked through its reservation backlog in the US, and now \n\n.\n\nHowever, Tesla is still only delivering the Foundation Series Cybertrucks, which package all options together for $20,000 extra. The automaker is likely soon going to run out of people willing to pay $100,000 and more for the electric pickup truck, and it will have to start delivering the non-Foundation Series Cybertrucks.\n\nBut before it does, Tesla is expanding Cybertruck deliveries to other North American markets.\n\nTesla is starting deliveries of Cybertrucks in Mexico this week:\n\nFirst Cybertruck deliveries about to start in 🇲🇽 😎⭐️ \n\nThere are already a few Cybertrucks being prepared for deliveries at service centers in the country, according to the local owners club.\n\nCanada is also expected to follow soon.\n\nWe reported that \n\n.\n\nShould add negligible sales to the CT. I don't see the CT selling well after the initial wave of enthusiasts. \n\nSiddhant Awasthi, Tesla Cybertruck program manager, now says that deliveries are planned for “late October” up north. \n\nThe market for Foundation Series in Canada and Mexico are likely going to be extremely limited, especially with the pricing Tesla released in Canada.\n\nI am surprised Tesla has yet to shift to the non-Foundation Series in the US, but maybe the automaker is waiting for deliveries of the Foundation Series across North America before switching to the regular versions.\n\nWhat do you think? Let us know in the comment section below.\n\n ", "url": "https://electrek.co/2024/09/17/tesla-cybertruck-deliveries-start-in-mexico-month-canada/"},
{"title": "Ford F-150 Lightning drivers can now rock out with built-in Karaoke, Mach-E to follow soon", "author": "Peter Johnson", "text": "There’s nothing better to pass the time on a road trip than singing tunes with friends and family. \n\n drivers can enjoy Karaoke for the first time through the Stingray Karaoke app. Here’s how it works.\n\nFord is introducing Karake for EV drivers through a software update in the US, Canada, Mexico, and Europe.\n\nF-150 Lightning owners will be the first to receive access, and the feature will soon roll out to the Mustang Mach-E.\n\nWith the \n\n, you can browse a wide catalog of songs to sing along to. You can choose your favorite from Rock, Country, Pop, R&B, Latin, K&J Pop, or family-friendly songs to sing along to.\n\nThe songs are available in 38 languages, including 10 in local characters like Thai, Hebrew, and Greek.\n\nFord Lightning owners can access the Karaoke feature while parked or charging. Once they select a song, the lyrics are displayed on the infotainment screen so they can sing along with friends and family.\n\nFord’s engineers worked with Stingray to develop a “unique drivetime experience” for passengers. To use it, you can tap the new Stingray Karaoke app.\n\nOnce the vehicle detects that the passenger is buckled, a QR code will appear on the screen. You can use your smartphone to scan the code, which will take you to a webpage where you will find the catalog of songs without having to log in to an app.\n\nThe \n\n will be available to all Ford Lightning owners starting with the 2024 model year. However, to be eligible for the update, you must have the SYNC 4A infotainment system.\n\nFord follows several automakers like \n\n and Tesla, which also have in-car Karaoke and other fun features. Although it may seem like a minor update, it’s a fun way to pass time while charging or parked.\n\nThe new feature also shows Ford’s commitment to using software for a better driving experience.\n\nWhat new features will Ford EV drivers gain next? We will likely find out shortly as Ford doubles down on software-defined vehicles.\n\n ", "url": "https://electrek.co/2024/09/17/ford-f-150-lightning-drivers-can-now-rock-out-built-in-karaoke/"},
{"title": "Global wind turbine order intake reached new highs in H1 2024", "author": "Michelle Lewis", "text": "Global wind turbine order intake reached new highs in H1 2024, with 91.2 gigawatts (GW) of activity, a 23% increase year-over-year, thanks to the Asia-Pacific region. \n\nGlobally, investment by wind energy developers in H1 2024 totaled $42 billion, a 3% increase year-over-year, according to new analysis from Wood Mackenzie. Much of that activity occurred in Q2, which saw 66 GW of wind turbine order intake, due in large part to demand in China’s northern region.\n\nIn fact, the Asia-Pacific region accounted for a whopping 85% of global intake in the first half of 2024. China saw 70 GW of orders for its domestic market and captured 5 GW of wind turbine orders abroad. Developers in India made great strides in the first half as well, yielding a 69% increase year-over-year. \n\nIndia’s Envision was the leader for overall order intake, followed by China’s Windey and Goldwind, all with more than 12 GW of activity. \n\nHowever, Western wind turbine OEMs struggled due to intensifying competition over more modest demand and contributed just 13% of global order intake in H1. In total, order intake outside of China decreased 16% (-2.3 GW) in the first half. Intake in the Americas and Europe dropped 42% year-over-year, with less than 10 GW combined ordered in H1.\n\n“Chinese OEMs continue to break records for order intake on activity both domestically and aboard,” said Luke Lewandowski, vice president, global renewables research at Wood Mackenzie. \n\n“Conversely, western OEMs are struggling to keep pace, challenged by China’s competitive advantages in pricing and availability. Soft demand in Western markets as well as policy uncertainty, inflation, and other cost pressures have also driven down activity in the US and Europe. China remains the undisputed leader in the industry.”\n\nWhile global onshore order activity increased in the first half, the offshore sector struggled, with order intake decreasing 38% year-over-year through the first half (-4.1 GW) as challenging project economics have curbed the market.\n\n“The offshore market has almost 30 GW of conditional orders globally, 21 GW of which are for projects in Europe and the US, but challenging economics continue to delay conversion into firm orders,” said Lewandowski.\n\n \n\n ", "url": "https://electrek.co/2024/09/17/global-wind-turbine-order-intake-reached-new-highs-in-h1-2024/"},
{"title": "VinFast launches its cheapest VF3 EV overseas to take on low-cost Chinese EV makers", "author": "Peter Johnson", "text": "A new low-cost electric car is rolling out to global markets, and it’s not from China. Vietnam’s VinFast officially launched its most affordable EV, \n\n, overseas as it expands its presence in the Philippines.\n\nAfter \n\n in January, VinFast’s mini electric SUV instantly became a hit in its home market and across the internet.\n\nWith a compact but still rugged (almost mini Ford Bronco-like) design, the VF 3 is aimed at “young drivers who value practicality alongside personality,” according to Ms. Tran Mai Hoa, VinFast’s Deputy CEO of Sales and Marketing.\n\nIn May, VinFast opened VF 3 pre-orders in its home market with a special introductory price of 235 million VND, or around $9,248.\n\nThe promo price was for the battery subscription model. For the battery included, VinFast’s VF 3 was available for 315 million VND, or around $12,390, for those who placed deposits between May 13 and May 15.\n\nWithin 66 hours, VinFast \n\n, a new record in Vietnam. The company said its mini electric SUV became a “social media phenomenon” in Vietnam, topping trend rankings with the most online discussions.\n\nVinFast began VF 3 shipments last month, with prices starting at 322 million VND ($12,800). The company said it aimed to deliver at least 20,000 models this year.\n\nOn Tuesday, VinFast \n\n the VF 3 in the Philippines. Those who reserve the VF 3 from September 19 through September 30 will get special pricing and other incentives.\n\nThe special promo price is 605,000 pesos ($32,000) for the battery subscription model and 705,000 pesos ($36,900) for the battery included.\n\nAfter this month, prices will go up to 645,000 pesos ($33,800) for the subscription and 745,000 pesos ($39,000) with the battery included.\n\nThose who opt for the battery subscription can choose from various monthly plans based on how much they travel.\n\nVinFast also offers early VF 3 buyers the ability to choose from nine exterior paint colors free of charge. Premium paint colors will cost 20,000 pesos ($1,000) following the promo.\n\nDuring the promo, VinFast said VF 3 buyers can customize the exterior paint design beyond the nine colors. VinFast is now accepting deposits of 5,000 pesos ($260) on its website or at authorized dealers.\n\nAt 3,190 mm long, 1,679 mm wide, and 1,622 mm tall with a wheelbase of 2,075 mm, VinFast’s VF 3 is even smaller than the \n\n (4,145 mm long x 1,765 mm wide x 1,611 mm tall).\n\nWith an 18.64 kWh battery, the VF 3 can travel up to 130 miles (210 km) on a full charge. It can also fast charge from 10% to 70% in around 36 minutes.\n\nVinFast’s mini electric SUV will challenge low-cost EVs from China in the \n\n.\n\nBYD’s \n\n electric SUV starts at around $28,600 (P 1,598,000) and accounts for 44% of EV sales in the Philippines so far this year. It is available with 49.9 kWh or 60.48 kWh battery options and has a driving range of up to 255 mi (410 km) or 298 mi (480 km), respectively.\n\nCan VinFast’s VF 3 compete overseas with BYD and other Chinese EV makers? Let us know what you think of the mini electric SUV in the comments.\n\n ", "url": "https://electrek.co/2024/09/17/vinfast-vf-3-launches-overseas-take-low-cost-chinese-evs/"},
{"title": "Kia’s first electric PBV spotted as new Volkswagen ID.Buzz rival [Video]", "author": "Peter Johnson", "text": " first electric Platform Beyond Vehicle (PBV) was spotted charging ahead of its official launch. The new video shows Kia’s new PBV could be a potential Volkswagen ID.Buzz rival.\n\nWe got our first look at \n\n at the 2024 CES in January. Kia claimed its PBVs are designed as “a total mobility solution” that blends fit-for-purpose EVs with advanced software.\n\n“Kia’s PBV business represents our vision of going beyond the traditional concept of automobiles,” CEO Ho Sung Song explained.\n\nIts new purpose-built electric vans, with custom interiors and modern tech, “open the door to new businesses and lifestyles.”\n\nPromoted as “the answer to all your mobility needs,” Kia PBVs can be used to start a business, carry cargo, or provide delivery services.\n\nKia plans to cover all segments with three models (PV1, PV5, and PV7). The first to launch will be the PV5, Kia’s mid-size electric people mover.\n\nKia’s PV5 will be available in different configurations, including basic (for passengers), van (for delivery/ transport), or chassis cab (like a pickup truck bed). In the future, Kia also plans to launch an autonomous PV5-R designed for ride-hailing.\n\nAfter we \n\n in July, a new video from \n\n gives us a closer look at Kia’s first dedicated electric van.\n\nA PV5 prototype was spotted charging with a big boxy design. Despite the camouflage, you can see some design elements peeking through.\n\nKia’s first PBV maintains much of the design shown in the concept in January. The electric van features a modern, almost futuristic-like design built for the electric era.\n\nAll PBV models will be built on Kia’s dedicated e-CCPM (Electric Complete Chassis Platform Module) from Hyundai Mobis.\n\nKia will build PBV models at its new dedicated plant in Autoland Hwaseong, Korea. The factory is expected to open next year and have an annual capacity of up to 150,000. By 2030, Kia aims for output to reach 300,000.\n\nKia’s PBV business will challenge rivals like Volkswagen with the ID.Buzz. Ford, GM, Rivian, and others are also advancing purpose-built electric vans.\n\nIt took VW 7 years from concept to US version on the ID Buzz.\n\nThen they thought $62,000 and 230 mile range would be a hit.  Wrong.\n\nTrust KIA can deliver a van that is useable and has a second row of seats that are removable.\n\nThe Volkswagen ID.Buzz costs around $70,000 (€64,581) in Germany, including VAT. In the US, it starts at $61,545.\n\nAlthough Kia has not revealed official prices, the PV5 is expected to start at around $35,000. Kia showcased the PV5 and PV7 this week during the \n\n of its new PBV business.\n\nKia plans to introduce the production version next summer. At IAA Hannover, Kia announced every PBV will be covered by a seven-year/ 150,000 km warranty.\n\nKia has already secured its first PBV customer, Uber. The \n\n aims to offer ride-hailing PBVs on Uber’s platform.\n\n ", "url": "https://electrek.co/2024/09/17/kias-first-electric-pbv-spotted-volkswagen-id-buzz-rival-video/"}
]