[
{"title": "Used Tesla Model 3 Prices Have Biggest One-Year Drop", "author": "Kevin Williams", "text": "The used car market is reversing fast. The era of used cars surpassing the pricing of new ones during COVID is over. This isn’t just me chatting or pulling facts out of my rear end\n\n that shows that used cars are getting more affordable. The selection of used cars under $20,000 has increased dramatically. One car leads the charge, though: the Tesla Model 3. The Tesla Model 3 has lost the most value of any used vehicle on the market.\n\nOf course, every vehicle is subject to the law of depreciation; \n\n But \n\n has noticed that the Model 3 has had the biggest drops percentage-wise in a year, regardless of propulsion type. From 2023 to 2024, the average price of a Tesla Model 3 went from $37,548 to $29,045, a dramatic 22.6% reduction in price. The next worst single-year depreciating vehicle was the Jeep Grand Cherokee, which went from an average price of $34,107 in 2023 to a price of $30,956 in 2024, or a reduction of 9.2% in average pricing. \n\nMore Tesla Price Drops\n\nThere are two ways to interpret this. On one hand, this is not great news for current Tesla Model 3 owners, especially those who purchased during peak COVID pricing. Those buyers will likely see severely depressed trade-in or private-party sale prices on cars that aren’t that old or used.\n\nOn the other hand, this is a boon for used car bargain hunters. \n\n says that the stock of used cars on the market is cheaper and less used than in years past. The average mileage of a used car is down 2.8%, which iSeeCars says suggests that people are paying less money for cars that aren’t as well used.\n\nWe’re still up, though. The average price of a 1 to 5-year-old car has been up more than 40% since 2019, before COVID rocked the world and caused prices to skyrocket. “Limited supply and high demand saw used car prices skyrocket during the pandemic,” said \n\n Executive Analyst Karl Brauer. Brauer continued in the study, alluding to an increase in the number of units available, which lowered the average prices of used vehicles. The fleet dumping of Teslas by Hertz and others has no doubt added a huge supply of used Model 3s to choose from. This is good news for buyers searching for a good used car.\n\nThat’s still not great for current Tesla Model 3 owners who may or may not have \n\n But this is probably a good thing for us all when it comes to getting more people behind the wheel of EVs. The average price of a Tesla Model 3 is $29,000, which no doubt includes well-equipped dual-motor and performance variants. J\n\n Facebook Marketplace seller; chances are it won’t be hard to find a Model 3 slightly above $20,000. That’s a big deal, which means driving a used EV for the same price as a used compact ICE car is possible. Love or hate Tesla, we can’t ignore the fact that a used Model 3 has more power, capability and refinement compared to any ICE compact of the same price. \n\nNew EVs may not have entirely reached price parity with ICE cars, but used EVs already have. In many ways, that’s a good thing.", "url": "https://insideevs.com/news/734989/tesla-model-3-used-price-drop/", "image": "https://cdn.motor1.com/images/mgl/pb33JJ/s3/m3-decline-topshot.jpg"},
{"title": "Xiaomi To Woo Tesla Model Y Buyers In China With Ferrari-Inspired Crossover", "author": "Andrei Nedelea", "text": "To keep up with the surprisingly high demand, Xiaomi had to double the planned production numbers for its first-ever electric car, the SU7 performance sedan. It is set to exceed its target of selling 100,000 SU7s in 2024, but it’s also getting ready to reveal a model that may prove even more successful.\n\nWhile driving enthusiasts will always prefer a performance sedan over a higher-riding crossover, the vast majority of car buyers both in China and globally will choose the latter for the practicality benefits—\n\n was the \n\n. That’s why the upcoming Xiaomi MX11 crossover will probably become an even bigger hit than the sedan.\n\nThe MX11 hasn’t been officially revealed yet, but the spy shots hint at a vehicle that will be even sportier-looking than its future main rival, the Model Y, which should receive a facelift sometime next year. Even with heavy camouflage on, the MX11’s sporty proportions shine through. It bears a striking resemblance to \n\n, featuring a long hood with bulging wheel arches and a pushed-back greenhouse, reminiscent of a traditional luxury car with a large longitudinally mounted engine.\n\nXiaomi hasn’t even revealed the MX11 or any technical details, but the spy shots and subsequent renderings based on them got a lot of attention in China. Local reports suggest the model could be revealed before the end of this year (possibly during a large-scale event that Xiaomi has planned for the end of October) and make its official market debut in the first quarter of 2025.\n\nMore On This\n\nThe 800-volt platform will likely be shared with \n\n, which is available with three battery pack sizes ranging from 73.6 to 101 kilowatt-hours, either rear- or all-wheel drive configurations, and up to 497 miles of CLTC range. The most powerful variant, the SU7 Max, has 664 horsepower and 618 pound-feet of torque, and it can accelerate to 62 mph (100 km/h) in 2.78 seconds before topping out at 165 mph. \n\n with \n\n-rivaling performance is on its way.\n\nXiaomi has said in the past that it plans to release even larger 132 and 150 kWh batteries, although we don’t know if they will be available when the MX11 debuts. The model’s name will also change for production. While testing, the SU7 had the internal designation MS11, so the MX11’s production name could be XU7 based on the same logic.", "url": "https://insideevs.com/news/734931/xiaomi-mx11-electric-crossover/", "image": "https://cdn.motor1.com/images/mgl/QevvXY/s3/68plmg4qbfq.jpg"},
{"title": "New Rivian EVs Come With A Tesla Charging Adapter", "author": "Iulian Dnistran", "text": "Rivian now includes a free NACS to CCS1 charging adapter with every \n\n and \n\n delivery, according to the California-based startup’s website. The change is reflected in the order summary for both custom builds and inventory vehicles.\n\nThis means that new \n\n customers won’t have to figure out a way to get a charging adapter to top up their EVs at compatible Tesla Supercharger stations across North America. As a reminder, the \n\n currently come equipped with a Combined Charging System 1 (CCS1) port from the factory, while \n\n’s DC fast-charging network uses the so-called North American Charging Standard (NACS). As a result, an adapter is required for non-Tesla EVs.\n\nMore Stuff Like This\n\nPreviously, \n\n to customers who already owned an R1S or R1T to take advantage of the 16,000+ Supercharger stalls in the United States, but the rollout has been pretty slow and there are still \n\n in the mail.\n\nNow, new customers won’t have to deal with the wait or pay extra to a third party because they’ll have the adapter already in the car when it gets delivered. To the best of our knowledge, Rivian is the first automaker in the United States to offer such a package. \n\n and \n\n are shipping Tesla-made adapters to their customers after taking delivery of the vehicle, either for free or for a fee.\n\n2025 Rivian R1T has a CCS1 charging port\n\nStarting next year, however, American EV manufacturers–including Rivian, Ford and GM–will fit a NACS port on their battery-powered cars, making the use of an adapter at Tesla Superchargers redundant. That said, owners of these vehicles will need another adapter, this time a NACS to CCS1 one, to recharge at stalls that only have CCS1 cables.\n\nThe first non-Tesla EV in the U.S. to come with a NACS plug from the factory is the ", "url": "https://insideevs.com/news/735069/2025-rivian-r1s-r1t-nacs-adapter-included/", "image": "https://cdn.motor1.com/images/mgl/40EEVY/s3/2025-rivian-r1s-and-r1t-now-come-with-a-nacs-dc-adapter.jpg"},
{"title": "Kia EV9 Recalled For Faulty Remote Parking Assist That May Not Brake Properly", "author": "Iulian Dnistran", "text": " is recalling certain 2024 \n\n electric SUVs because of an issue with the Remote Smart Parking Assist (RSPA) feature that allows drivers to remotely move the car forward or reverse by holding a button on the key fob without anyone inside the vehicle.\n\nThe feature is particularly useful for very tight parking spots where you could ding the doors when getting in and out, but an issue with the car’s software might cause the car to not stop properly.\n\nAccording to the \n\n, due to an error with the Integrated Electronic Brake (IEB) software, if the driver repeatedly stops the car using the remote at or less than approximately two miles per hour, the vehicle could then apply insufficient brake pressure, which could lead in extended stopping distances and even injuries for pedestrians sitting in the car’s way.\n\nMore Software Glitches\n\nIn total, 12,400 \n\n models sold in the United States are affected by this recall and a visit to the dealer will be needed to fix the issue. The dealer will upgrade the braking system software with improved logic that will apply high brake pressure in all scenarios where the remote start parking assist is used. \n\nThe affected EV9s were built between September 25, 2023, and May 28, 2024. Cars manufactured after May 28, 2024, already have the updated IEB software installed and are not part of this recall.\n\nHere’s how Kia’s RSPA works:\n\nThe 2024 Kia EV9 is \n\n on the market today. With a starting price of around $55,000, the EV9 has seating for seven and a driving range of up to 304 miles on a full charge, depending on the size of the battery pack. Thanks to its E-GMP 800-volt platform, Kia’s electric family hauler can ", "url": "https://insideevs.com/news/734883/kia-ev9-recall-parking-assist/", "image": "https://cdn.motor1.com/images/mgl/zxQ228/s3/kia-ev9-first-drive-topshot.jpg"},
{"title": "General Motors EV Sales 'Outstrip' The Industry", "author": "Suvrat Kothari", "text": "After selling a record number of electric vehicles in the second quarter of this year, \n\n looks poised for another quarter of record EV sales.\n\nAccording to sales data obtained by \n\n, the automaker sold almost 21,000 EVs in July and August combined in the U.S.\n\nThat means GM is now on track to outpace \n\n and become America's third-largest EV maker behind Tesla and the Hyundai Motor Group.\n\nEVs have been somewhat of a turbulent chapter for GM so far, with the automaker facing setbacks in the software department, \n\n, and delaying production of several models. However, the latest sales data suggests that GM EVs currently on sale and are gaining strong momentum.\n\nAccording to the report, GM sold 59,303 EVs through the first eight months of the year, whereas Ford sold 61,366 EVs. While the Dearborn automaker continues to rely on heavily discounted \n\n and \n\n, GM now offers a far more robust line-up of EVs.\n\nDuring the same period last year, GM's EV portfolio looked barren, with the popular \n\n nearing its end of production and models like the \n\n delayed. But the tide has turned ever since.\n\nSeveral GM models across segments are on sale now. That includes the Chevy Equinox EV, \n\n, \n\n, \n\n, \n\n, \n\n (SUV and pickup) and the \n\n delivery vans. Deliveries of the \n\n and \n\n are imminent as well.\n\n“We are definitely outstripping the industry in terms of growth, in terms of EVs,” Rory Harvey, GM president of global markets told the outlet.\n\nThere are more reasons to be optimistic. The Equinox EV's base \n\n, promised to start at $35,000 (including destination) before tax credits, is not even on sale yet. It's expected to become one of the cheapest EVs with over 300 miles of estimated range. GM said it will be available as a 2025 model-year car later this year.\n\nThe Hyundai Motor Group still has a considerable lead over GM in terms of EV sales thanks to the Ioniq 5, Ioniq 6 and the Kia EV6 and EV9—all of which can be driven home with \n\n if you're lucky enough to find a cooperative dealership.\n\nHowever, GM might be chipping away slowly from Hyundai-Kia as well.\n\nThrough August, Hyundai sold some 20,000 more EVs than GM did. As per \n\n estimates, Hyundai and Kia sold 21,760 EVs in those two months, whereas GM sold 20,948 EVs.\n\nAll said, Tesla still reigns supreme. CEO Elon Musk's company sold over 304,000 EVs in the first half of 2024 in the U.S., more than double what GM, Ford, and Hyundai-Kia sold combined during the same period.\n\nSo at least for the foreseeable future, automakers in the U.S. will be battling for the number two spot.", "url": "https://insideevs.com/news/734827/gm-july-august-record-ev-sales/", "image": "https://cdn.motor1.com/images/mgl/xqKnMz/s3/gm-record-ev-sales-july-august-2024.jpg"},
{"title": "Lucid Needs Legacy Auto Expertise, So It Opened A New Hub In Detroit", "author": "Rob Stumpf", "text": "Lucid makes some pretty cool cars. They're flashy, fast, and a \n\n (don't believe me? \n\n). It's like the early stages of Tesla, just with more attention to build quality and more investments from \n\n.\n\nDespite building an impressive machine, Lucid has been struggling to gain market share with its \n\n. It's looking to solve that problem with the release of the \n\n and a \n\n. However, the California-based automaker knows that it needs more than just high-tech engineering to scale up and make its dreams come true. That's where legacy auto excels. And if you can't beat 'em, poach 'em.\n\nLucid officially opened its so-called \"Michigan office\" this week. Officially, the location is in Southfield, Michigan, which is, give or take, 15 miles from Detroit. Unofficially, it's in the Big Three's backyard.\n\nThe automaker says it opened this plant to grow its R&D, engineering, and operations teams...which is tongue-in-cheek for poaching the core auto workers in the Detroit metro area who have been key in the success of designing, building, and launching cars for legacy carmakers.\n\nLucid doesn't need Detroit to teach it how to build the underlying tech for a car. It's already done that and done it extremely well. The automaker has earned its stripes by building out electric drive units capable of, quite frankly, \n\n. It's also earned a reputation for being a premium brand with some rather eye-catching styling. None of these are the departments in which Lucid needs help.\n\nDetroit is crawling with automotive expertise. After all, Ford, GM, and Stellantis have spent literally a century perfecting the craft of large-scale production. Lucid, on the other hand, isn't even old enough to vote. Naturally, it's still going through some growing pains largely surrounding how difficult it is to scale up vehicle production. Tapping into local talent gives Lucid insight into how to effectively scale from producing vehicles by the thousands to the tens (and eventually, hundreds) of thousands.\n\nSo while Lucid may be gaining some engineers and R&D experts, the real talent to be gained here are those who have connections in supply chains, logistics, and production planning. That's where some of the biggest secrets in automotive manufacturing hide, and Lucid is hellbent on turning over every stone to find the right people for the job.\n\nIs it possible for Lucid to succeed on its own? Sure. But it's not going to be a walk in the park. Lucid has already missed some crucial production targets. For example, it anticipated building 49,000 vehicles in 2023 and 90,000 in 2024. Last year, it built just 8,428 vehicles and sold them to 6,001 customers.\n\nPerhaps Tesla CEO Elon Musk was right when he said \"\n\n.\"\n\nEither way, Lucid is showing that it's putting its investments to good use. It wants to succeed, but it needs the right people to keep the company's head above water. And the move to Michigan is a clear signal: Lucid wants to play on the same level as the big dogs and isn't afraid to pull from Detroit's talent pool to do so.", "url": "https://insideevs.com/news/734677/lucid-detroit-hub-poach-talent/", "image": "https://cdn.motor1.com/images/mgl/E6x393/s3/lucid-gravity-coming-to-detroit.jpg"},
{"title": "Pulling The Plug On EVs? The Wild Fight Over Ending Subsidies", "author": "Rob Stumpf", "text": "The U.S. has been kicking government funding of electric vehicles and supporting infrastructure into high gear lately. From \n\n to \n\n to \n\n, the moves have been quite clear. But there's something important to remember: Federal cash will eventually dry up. And in other countries, we're seeing what happens to the EV transition when it does.\n\nWelcome back to \n\n, your daily roundup for all things EV and automotive tech. Today, we're chatting about countries considering ditching EV subsidies, Stellantis' supposed search for a new CEO, and Cruise firing its robotaxis backup (kind of). Let's jump in.\n\nGovernment subsidies have always been a polarizing topic. Just ask \n\n—even those for the EVs that his company sells. He might just get his wish.\n\nThere's growing talk among governments across the globe about ending the subsidies that have been powering the EV industry for years. The chatter comes at a crucial time when EVs have just started to become mainstream, partly thanks to the very tax credit that many want to do away with. But here's the thing—ending EV subsidies now could mean throwing a considerable wrench into adoption before the cars reach cost-parity to their outgoing ICE siblings.\n\nHere's what the \n\n has to say on the matter, starting in Europe:\n\nOne of the main reasons traces back to mid-December 2023, when the German government gave less than one week’s notice before ending its subsidy program for electric vehicles. The program had given drivers small grants (up to around €6,000) toward the purchase of new battery-electric and plug-in hybrid cars.\n\nThe end of the subsidy program isn’t the only factor contributing to Germany’s EV slowdown, but the abrupt axing certainly had an effect: While many countries across Europe saw steady or growing sales of new EVs in the past year, Germany’s sales fell.\n\nThe review points out that Germany isn't the only country that has officially scraped its credit. Sweden and New Zealand have also done away with their own EV subsidy programs, and—surprise—both countries started to see a slowdown or outright decline in EV sales. \n\n, but the lack of people buying electric (especially from their own automakers) is making the entire continent nervous.\n\nUnsurprisingly, the main driver behind the lack of EV adoption comes down to the almighty dollar. \n\n\"Cost is the main driver,\" confirmed Robbie Orvis, senior director at policy research firm Energy Innovation. And to Orvis' point, cost parity isn't there yet, meaning EVs are still significantly more expensive than their gas-powered counterparts. \n\n. However, it could inadvertently delay mass-market adoption and climate goals if government support is pulled at a crucial time.\n\nIn case we forgot, the whole point of subsidies is to help push people away from fossil fuels and towards something that won't set the planet on fire in a few generations. But there's also a hidden agenda to ensure that the automotive industry stays competitive.\n\nGovernments know that if they don't push for change and accept a stalemate, the manufacturing sector could suffer. Other countries are more than willing to pick up the slack to gain new market share. We're seeing it happen with \n\n \n\n. \n\n, so that makes the choice for carmakers simple: innovate or die.\n\nThe U.S. doesn't seem to be at risk—yet. The Biden administration just announced plans to safeguard against a \"flood\" of EVs in China, in part by \n\n with links to the country (something that could \n\n, too). It also \n\n to help automakers retool for the EV future.\n\nIt turns out that new car buyers make their buying decisions based on getting a good deal. Who knew? Naturally, incentivizing buyers also incentivizes automakers. For governments, that means dusting off the old checkbook and spending some taxpayer cash to help prop up the new propulsion tech.\n\nSo, is the EV market ready to fly solo? Maybe. But pulling these subsidies too soon can also sabotage many future manufacturing and climate goals. It's a tough call to say \"enough is enough\"—and one day, enough \n\n be enough. It might not just be today.\n\nBig changes could be on Stellantis' horizon. But it's not a wave of new, unannounced cars or even the \n\n. No—it's decisions happening behind the curtain at the top of the company's food chain. Word on the street is that the board is seeking a new CEO.\n\nThe company's chairman and Fiat heir, John Elkann, is reportedly putting feelers out for current CEO Carlos Tavares' replacement. Now, don't get it twisted; Tavares isn't out, at least not yet. His contract with the automaker runs until 2026, but if Elkann succeeds in finding a suitable successor, well, the company may have a new figurehead at the helm by then.\n\nIt turns out that the brands under the Stellantis umbrella aren't doing so hot. Sales across most of the company's 14 brands aren't doing so hot right now, especially those sold in North America.\n\n explains:\n\nPressure on Tavares is rising due to Stellantis' poor performance in markets including the U.S., its biggest single profit pool.\n\nElkann has no plans for an immediate leadership change and Tavares will be included in the search process, according to people familiar with the matter.\n\nStill, Elkann is increasingly dissatisfied with the situation in North America, where sales have been slowing and several executives left the company, said the people, who asked not to be identified discussing internal matters.\n\nInvestors have been out for blood. Elkann, who is also the CEO of Stellantis' largest shareholder, Exor, appears to be no anomaly in that department. Some of the investors have even \n\n against the manufacturer alleging that the company kept its stock artificially inflated by concealing rising inventories and other weaknesses across its brands in North America.\n\nPerhaps Tavares's comments from last year—like being \"in the black\" on EVs—weren't the most accurate representation of the parent company's standing, especially when \n\n.\n\nMeanwhile, Tavares has become increasingly outspoken about the tough battle that Stellantis—and the rest of the industry—will need to fight to make ambitious electrification goals a reality.\n\nOther legacy automakers like Ford and GM have already begun their assault on the electrification sector. Stellantis is lagging, though it's hard to deny at least \n\n. It's also \n\n, but the lack of forward momentum for the automaker leaves Stellantis in a constant state of catch-up.\n\nTavares is fixated on duking it out with Chinese brands encroaching on the automaker's European presence. He's previously said that Stellantis expects to be \"\n\n\" by automakers that, according to Europe, receive \"\n\n\" from the Chinese government. This has led to some extreme cost-cutting measures across the portfolio and has caused some critics to believe that \n\n.\n\nThe North American market has felt a bit neglected. There has been little progress on the consumer EV front, slumping sales, and a board that has it out for its CEO. Things aren't looking great. And who knows, maybe Tavares can work some magic that puts him back in the board's good graces. Whatever that magic is has to happen very soon, though. \n\nIn the meantime, at least we get the \n\n!\n\nNot long ago, GM had to push that big red \"pause\" button on its self-driving subsidy, Cruise. The company was \n\n, causing \n\n and even \n\n. California regulators finally put their foot down and \n\n.\n\nSince then, the company has cleaned house. Its CEO? \n\n. Co-founder? Quit. Nine hundred more folks working for the company? \n\n. After some serious self-reflection (and a scathing \n\n that was hired to critique its response to the pedestrian incident), the automaker has been slowly working to build itself back up to the point where it can resume automated testing.\n\nEarlier this year, the company resumed testing in Arizona, albeit with drivers behind the wheel instead of autonomous rides.\n\nIt plans to start slow. Five vehicles, each with drivers behind the wheel and not carrying any public passengers. Cruise says this is for research—for mapping—and to help get it ready to launch its driverless service again. But first, there are some major hurdles to overcome, like learning how to \n\nfire trucks, staying out of \n\n, and \n\n. You know, the usual.\n\nMeanwhile, its permits remain suspended. In order to resume testing in California (even with human backup drivers behind the wheel), Cruise will need to apply to have the permits reinstated.\n\nCruise undoubtedly wants that to be ASAP. It's still \n\n with nothing to show for it. This isn't about turning the key and riding off into the autonomous sunset. The company learned from its mistakes and is banking on being one of the first companies to solve the self-driving long game.\n\nThe bigger question is whether or not Cruise's high-stakes bet will pay off. And, of course, if it can avoid any crashes—\n\n or otherwise. With months off the road, GM's self-driving arm has much catching up to do.\n\nWe already talked about the highs and lows of subsidized EV purchases, plus taxpayer-funded infrastructure, and even government-sponsored uplifts for the auto manufacturing sector. I get it, there's a ton of money being poured into battery-electric cars right now. And we all know that money is eventually going to dry up.\n\nThe more important question that's on my mind is: when is it \n\n? When 25% of all new vehicle registrations are EVs? 50%? More? Or maybe it's based on infrastructure. Do we need to have more bolstered charging infrastructure to convince people that it's okay to buy an EV?\n\nObviously, there are a lot of variables in play here. So let me know in the comments what metrics governments should use to gauge when to stop shelling out subsidies.", "url": "https://insideevs.com/news/734863/governments-begin-ending-ev-subsidies/", "image": "https://cdn.motor1.com/images/mgl/6ZoozX/s3/cm-fiat-plug-type.jpg"},
{"title": "U.S. Chinese Car Tech Ban Will Hit General Motors And Ford Too", "author": "Tim Levin", "text": "The Biden Administration is pulling out all the stops to prevent China's growing auto industry from gaining a foothold in the U.S. And the new rules, if implemented, wouldn't just impact homegrown Chinese companies. \n\nOn Monday, the U.S. Commerce Department proposed \n\n, citing fears that internet-connected and autonomous vehicles could wreak havoc if they could be remotely controlled by theoretically malicious actors. \n\nBut a Commerce Department \n\nthat the regulations would effectively ban all vehicles made in China from being sold in the U.S. Liz Cannon, who leads the department's information and communication technology office, told the outlet that the rules would force \n\n and \n\n to stop selling vehicles they import to the U.S. from China. \n\n\"We anticipate at this point that any vehicle that is manufactured in China and sold in the U.S. would fall within the prohibitions,\" Cannon said.\n\nFord makes the \n\n Nautilus in China through a joint venture with China's Changan Automobile. GM's \n\n Envision also hails from China and is manufactured through a joint venture with SAIC Motor. \n\nThe two U.S. automakers did not return a request for comment. We'll update this story if we hear back. We've also reached out to the Commerce Department to learn more.\n\nOther made-in-China vehicles sold in the U.S. are the Volvo S90 and Polestar 2 sedans. Both those brands are under the umbrella of China's Geely Group.\n\nA Volvo spokesperson told InsideEVs on Monday: \"Volvo Cars is and always will be about safety, including the protection of data. All data is processed in accordance with applicable law. We are reviewing the proposal from the U.S. Commerce Department and are analyzing any potential impact it might have on us and the auto industry in the U.S.\" \n\n\"All vehicle data is processed in accordance with applicable law. We will review any proposals presented by the U.S. Commerce Department and analyze what potential impact these might have on us and our operations in the U.S.,\" a representative for Polestar said.\n\n take aim at the hardware and software that underpin a vehicle's connectivity system—that is, the components and code that enable modern cars to connect to WiFi, satellite and cellular networks. They also restrict certain software that allows for automated driving. When the regulations kick in, they'll prohibit the sale of hardware, software or entire so-called \"connected vehicles\" made by companies with ties to China or Russia.\n\nThe 2024 Polestar 2, which is made in China by the Geely Group. \n\nThey will effectively shut the door on vehicles made by Chinese companies, even if they're produced in the U.S. And even if a Chinese carmaker sources the relevant software and hardware from a non-Chinese outfit, the Biden administration says those cars will be prohibited. \n\nThe fear, \n\n, is that those adversaries could use connected vehicles and their sensors to conduct surveillance on U.S. citizens and critical infrastructure. Or they could remotely assume control of a vehicle's key functions—like braking and acceleration—or its self-driving system.\n\nThe rules may also help prop up America's domestic automakers (and foreign ones already operating here) by shielding them from the emerging threat of inexpensive Chinese imports. Though the Commerce Department says these particular regulations—unlike the \n\n recently—are all about national security. \n\nStill, a senior Biden Administration official told InsideEVs there isn't much Chinese software and hardware currently on the U.S. car market that would be prohibited by the new rules. Rather, the department is positioning the regulations as preventative. \n\nThe Volvo EX30 was delayed after the U.S. announced steep new tariffs on Chinese-made EVs. \n\nThe \n\n, a trade group that represents Ford, GM and a host of other major automakers and suppliers, said that its members are on board to protect national security by cutting \"China and other countries of concern\" out of the supply chain for connected vehicles. \n\n\"There’s actually very little technology—hardware or software—in today’s connected vehicle supply chain that enters the U.S. from China. But this rule will require auto manufacturers in some cases to find alternate suppliers,\" John Bozzella, the group's president, said on Monday. \"I’ve said this in other contexts, but it applies here too: you can’t just flip a switch and change the world’s most complex supply chain overnight. It takes time.\" As an example, he cited the slow but steady process of wresting control of battery-material supply chain from China. \n\nThe hardware restrictions are set to take effect for 2030 model year, while the software rules are slated for the 2027 model year. The administration is giving the public 30 days to comment on the proposal. They would join a raft of restrictions aimed at the Chinese car industry, including the new tariffs and \n\n without certain Chinese components. ", "url": "https://insideevs.com/news/734845/chinese-connected-car-software-rule/", "image": "https://cdn.motor1.com/images/mgl/wlqZmm/s3/buick-envision-china.jpg"},
{"title": "Kia EVs Will Get Tesla Supercharger Access Early Next Year", "author": "Iulian Dnistran", "text": " electric vehicles sold in the United States will gain access to the \n\n network on January 15, 2025, the company said in a statement released today. The South Korean automaker will follow in the footsteps of \n\n, \n\n and \n\n by striking a deal with \n\n to use its expansive DC fast-charging network that has over 16,500 stalls in the U.S.\n\nCustomers who took delivery of a new 2024 or 2025 \n\n or 2024 \n\n from September 6 will get a free adapter that will allow them to use the Supercharger network. Deliveries for the complimentary adapter are slated to start in early 2025.\n\nHowever, people who bought an \n\n, \n\n or \n\n before the aforementioned date will have to pay for an adapter, although Kia didn’t say how much it would cost. For reference, the Tesla-made NACS to CCS1 adapter sold by General Motors costs $225, while third-party adapters are slightly less expensive.\n\nMore Stuff Like This\n\nKia will offer three adapters: one that allows current Kia EVs to fast-charge on Tesla Superchargers, one that allows future Kia EVs equipped from the factory with the Tesla plug to charge at CCS1 stalls like those offered by Electrify America and EVgo, and one that allows NACS-equipped Kia EVs to AC-charge on non-Tesla Level 2 chargers. In other words, there will be NACS to CCS1, CCS1 to NACS and J1772 to NACS adapters available from Kia starting next year.\n\nAs a reminder, current Kia electric vehicles come from the factory with the Combined Charging System 1 (CCS1) plug, while Tesla’s Supercharger network uses the so-called North American Charging Standard (NACS), except for the few stalls that are equipped with a built-in adapter known as the \n\n.\n\nThe refreshed EV6 is slated to become the first Kia EV sold in the U.S. with a native NACS charging port. The European-spec 2025 EV6 shown here has a CCS2 port.\n\nIf you’re wondering why Kia mentions NACS-equipped EVs, it’s because it will start making them pretty soon. As with the recently revealed \n\n that comes with a NACS plug, \n\n will ditch the CCS1 connector in favor of the more compact plug designed by Tesla, at least in North America. Other models, like the EV9 will follow suit.", "url": "https://insideevs.com/news/734928/kia-ev-tesla-supercharger-2025-adapter/", "image": "https://cdn.motor1.com/images/mgl/qkllWg/s3/the-ev9-will-be-one-of-the-kia-evs-to-gain-access-to-the-tesla-supercharger-network.jpg"},
{"title": "U.S. Aims To Ban Cars With Software, Hardware Links To China", "author": "Patrick George", "text": "Tough new tariffs on electric vehicles made in China were one thing. But if new proposed rules from the U.S. Department of Commerce go into effect, the sale or import of cars with hardware or software links to China would be banned by the close of this decade.\n\nOfficials with the Commerce Department’s Bureau of Industry and Security (BIS) announced the proposed new rules today, saying that cars, trucks and buses with connected features linked back to China present risks to U.S. national security and to its citizens' data privacy. The proposed rules specifically target vehicle connectivity systems and automated driving systems, both in terms of hardware and software. \n\n\"Malicious access to these systems could allow adversaries to access and collect our most sensitive data and remotely manipulate cars on American roads,\" Commerce Department officials said in a statement. \"The prohibitions on software would take effect for model year 2027 and the prohibitions on hardware would take effect for model year 2030, or Jan. 1, 2029, for units without a model year.\" \n\nPut more simply, these new rules—if finalized—could pose a mortal blow to Chinese automakers seeking to enter the U.S. market, even though potentially made in Mexico (or even domestically, as former President Donald Trump has suggested during his reelection bid.) After all, it's difficult to fathom a world where any U.S.-market cars from Chinese automakers would not have hardware or software links back to their country of origin.\n\nThe proposed rule covers software that enable automated driving (but not lesser driver-assistance features) and vehicle connectivity to satellite, cellular and Wi-Fi networks, a senior administration official said. The hardware component takes aim at vehicle connectivity systems but only parts with connectivity capability, they said. The proposed rule defines automated driving systems as those rated Level 3 through 5 by auto industry standards. Level 1 and 2 systems, which involve cruise control and lane keeping but always require driver supervision, would not restricted by the rule. \n\nThe rules also target automotive hardware and software from Russia, also under the premise of national security, although Russia is hardly the global automating and technology titan that China is. \n\nAdministration officials began investigating the risks of connected Chinese cars and car technology \n\n. \n\n“Cars today have cameras, microphones, GPS tracking, and other technologies connected to the internet,\" U.S. Secretary of Commerce Gina Raimondo said in the statement. \"It doesn’t take much imagination to understand how a foreign adversary with access to this information could pose a serious risk to both our national security and the privacy of U.S. citizens. To address these national security concerns, the Commerce Department is taking targeted, proactive steps to keep [People’s Republic of China] and Russian-manufactured technologies off American roads.\"\n\nPhoto: Kevin Williams\n\nThe proposed rules are the latest crackdown by the Biden Administration on the potential entry of Chinese cars—specifically EVs—into the U.S. market. Earlier this year, officials announced \n\n, leading to the delay of the Volvo EX30 in the U.S. market until it can be manufactured in Europe. The tariffs also seem to delay the entry of Chinese automakers like BYD, Nio, XPeng and the various members of the Geely Group into the U.S. as they continue to soak up market share in Europe and Latin America.\n\nChina's automakers are widely regarded as significantly ahead in the EV and software race, \n\n after traveling to the Shangai Auto Show earlier this year. \n\nIn theory, if those automakers were to build factories in Mexico—as several of them are either doing or considering—with the goal of exporting to the U.S., they would sidestep those tariffs. But cracking down on software and hardware specifically from China could seek to keep those cars off American roads even longer, if not indefinitely. So while the Commerce Department's proposed rule stresses national security concerns, it could also have the net benefit of keeping companies like General Motors from having to compete directly with the likes of BYD. \n\nA Ji Yue model with automated driving assistance tech.\n\nAdministration officials said the new rule relates to software and hardware that is designed, developed, manufactured or supplied by entities owned by, controlled by, or subject to the jurisdiction or direction of China or Russia. In other words, it also seems to target companies that may be set up to localize or even license those technologies as well. This would also likely keep Chinese suppliers from establishing a larger presence in the U.S. \n\nU.S. officials and China critics have long warned of the hypothetical risks of connected, camera-equipped cars from a major geopolitical adversary on American roads. One fear is that these cars could unknowingly collect location or visual data on sensitive areas like government installations or military bases, or even pose threats to driver safety with remote control of features like automated driving. \n\nThe proposed rule is also hardly the first time the Biden Administration has acted with national security in mind to target new services and technologies from China. Perhaps the most notable example as of late is what appears to be \n\n, which is owned by a Chinese company. TikTok has been arguing against either outcome in federal court, but a panel of three judges has appeared skeptical of its \"free speech\" arguments superseding national security concerns. \n\nAt the same time, the nuances of an effective ban on Chinese connected car tech remain extremely unclear. For example, what impact could they have on companies like Volvo or Polestar, which are owned by China's Geely Group and presumably have some hardware and software connections to that country? And what could it mean for Western automakers potentially engaging in new technological tie-ups with Chinese ones. How will China respond to this rule if it becomes finalized, and what could that mean for automakers like GM, Ford and others operating in China? \n\nAccording to \n\n, Commerce officials aim to finalize this rule in January after taking public comment for 30 days. How the auto industry responds, and how China responds, could define much of the global EV race for years to come.", "url": "https://insideevs.com/news/734717/china-ban-evs-software-commerce/", "image": "https://cdn.motor1.com/images/mgl/BXxeGA/s3/china-data.jpg"},
{"title": "Xpeng Is Gearing Up To Launch Two Super Efficient Electric Sedans", "author": "Andrei Nedelea", "text": "Xpeng will launch an all-new EV that replaces the P7i, which was the successor to the original P7. The new P7+ will grow in size compared to its predecessors, but it promises almost unbelievable electricity consumption numbers, which would make it one of \n\n in the world.\n\nAccording to information published by the Chinese Ministry of Industry and Information Technology, \n\n will use about 11 kWh/100 km, or 5.65 miles/kWh in its most efficient guise. That’s a truly remarkable number comparable to the most efficient current EVs, the \n\n, the \n\n and the \n\n.\n\nThe claimed efficiency number for the P7+ is based on the highly optimistic Chinese test cycle (CLTC), which yields figures that \n\n than the EPA estimate. Taking this into account, the P7+ would have an EPA-rated efficiency of around 3.7 miles/kWh, which is almost as good as a Tesla Model 3 and about the same as a Hyundai Ioniq 6 with all-wheel drive. It doesn’t come anywhere near the Lucid Air Pure’s 5 miles/kWh EPA rating, though.\n\nHowever, it’s worth noting that the difference between CLTC and EPA ratings isn’t exactly 35%, so the Xpeng P7+ might be about the same as the Tesla and Hyundai in the real world. The base model will have a 60.7 kWh battery pack good for a claimed range of 357 miles, and the optional 76.3 kWh pack increases that to 425 miles.\n\nThe P7+ isn’t the only new electric sedan coming from \n\n. The automaker is also getting ready to launch \n\n, which will feature 51.8 kWh and 62.2 kWh battery packs and a range of up to 385 miles. The base version with the small battery and a CLTC range of 320 miles will have a starting price equivalent to just $17,000.\n\n will also be an efficient EV. We calculated the efficiency of the small-battery version at 6.18 miles/kWh based on its CLTC range figure. Even if we apply the 35% difference to get a more accurate EPA-like efficiency number, it should still have no trouble getting over 4 miles/kWh on the combined urban and extra-urban cycle.\n\nXpeng plans to launch the P7+ in October and the more affordable M03 will arrive in 2025.", "url": "https://insideevs.com/news/734961/xpeng-electric-sedans-great-efficiency/", "image": "https://cdn.motor1.com/images/mgl/6ZooNX/s3/xpeng-p7.jpg"},
{"title": "A $1 Billion Fund Aims To Revitalize America's EV Suppliers", "author": "Suvrat Kothari", "text": "As the U.S. prepares to move its electric vehicle supply-chain away from China with \n\n on Chinese-made EVs and a \n\n on Chinese and Russian software and hardware, it's also boosting support for its homegrown EV supply-chain network.\n\nChicago-based investment firm Monroe Capital today announced plans to raise $1 billion to facilitate loans for small- and medium-sized auto suppliers. The White House lauded the \n\n, saying the fund aims to help small auto businesses make the tough transition towards EVs.\n\nThe Drive Forward fund, as Monroe Capital calls it, would be a \"government-guaranteed\" scheme to help smaller suppliers embrace electrification and diversify their businesses away from gas cars.\n\n\"A focus will be placed on manufacturers that are well-positioned to lead in the future of the automotive industry and need additional capital and support to grow their manufacturing capacity,\" the White House said in a statement.\n\nAuto suppliers have an outsized role in the transition towards electrification as they employ more than 250,000 workers across the country, including in Michigan, Ohio and other parts of the nation, the White House added.\n\nThey're the backbone of the shift to EVs but have struggled so far. They need to \n\n, retool plants, \n\n and on top of all that, help automakers comply with tough new EPA emissions rules that will kickstart in 2027.\n\nWithout a financial shot in the arm from the government, it would be tough. The White House added that the support would go to \"companies making critical investments in the transition from internal combustion engine (ICE) production to electric vehicles (EV).\"\n\nThis is in addition to the U.S. Department of the Treasury's $9.1 million grant to establish the Michigan Auto Supplier Transition Program to help the state's small businesses embrace EVs.\n\nThe announcements for local support for EVs comes in the wake of the Commerce Department's \n\n in cars sold in the U.S. from 2027 and hardware from 2030.\n\nThe U.S. believes that software and hardware with links to China or Russia, such as vehicle connectivity systems, cellular and WiFi network and advanced driver assistance systems pose a national security risk.\n\nIf the ban is finalized, the prospect of Chinese EVs ever landing on U.S. shores would get even slimmer.", "url": "https://insideevs.com/news/734860/one-billion-ev-fund-small-auto-suppliers/", "image": "https://cdn.motor1.com/images/mgl/L330RN/s3/ford-f-150-lightning-production.jpg"},
{"title": "Thor’s New Extended Range RV Packs Off-Grid Power For Days, 500 Miles Of Range", "author": "Iulian Dnistran", "text": "Thor Industries, one of the biggest manufacturers of recreational vehicles in the United States, and Harbinger Motors, a medium-duty hybrid chassis startup, worked together to come up with the world’s first Hybrid Class A Motorhome. That’s what the two companies claim, at least.\n\nSet to go on sale next year, the unassuming RV packs the same tech inside as the upcoming \n\n–a series hybrid setup that combines an electric motor, a battery pack and a combustion engine that has no mechanical connection to the drivetrain.\n\nBetter known as a range-extended EV or \n\n, the system can get power either from the charge port or the generator that’s connected to the gas engine. In the case of Thor’s RV, we’re dealing with a 1.4-liter inline-four lump, four 35-kilowatt-hour individual battery packs that together can store 140 kWh of energy and a rear-mounted electric motor developed by Harbinger that makes 440 horsepower peak and 280 hp continuous.\n\nMore EREV Stories\n\nTorque is rated at 1,140 pound-feet, which should be more than plenty for any situation–Thor says it’s roughly twice the torque of a diesel engine fitted in similar applications. The battery architecture is rated at 800 volts and the packs can be DC fast-charged in one hour.\n\nPower can also be exported from the battery pack, transforming the RV into a generator that can power a whole house during outages.\n\nThe prototype, called simply the Thor Test Vehicle, has a total estimated range of 500 miles with both the battery and the fuel tank full. On battery power alone, the RV can drive for about 150 miles, while the gas range-extender adds another 350 miles to the mix.\n\nAccording to \n\n, Harbinger delivers the frame, suspension, propulsion system, safety and vehicle systems, and the outfitters have the task of fitting the body and remaining systems. The chassis has an estimated service of 20 years, the oil-cooled drive unit is designed to last 450,000 miles in commercial truck applications and there’s a fully independent double-wishbone suspension system at the front. A steer-by-wire system is also part of the package, just like on the \n\n.", "url": "https://insideevs.com/news/734936/thor-harbinger-erev-rv/", "image": "https://cdn.motor1.com/images/mgl/VzggOL/s3/thor-hybrid-test-vehicle-on-track.jpg"},
{"title": "Charging A Chevrolet Bolt EV On A Tesla Supercharger: Here’s How It Works", "author": "Iulian Dnistran", "text": "Owners of \n\n-made EVs finally \n\n to \n\n’s expansive Supercharger DC fast charging network in the United States last week, which is great news for those long road trips, seeing how the number of Superchargers in North America exceeds 17,000.\n\nThe list of cars that can be recharged at Tesla stalls includes names like the new \n\n, \n\n and \n\n. It also includes the venerable \n\n and \n\n, which were once America’s most affordable new battery-powered cars before being discontinued (don’t fret, though, as \n\n with Ultium tech and an LFP battery.)\n\nAnd it’s the Bolt that I’ll focus on here because, with over 200,000 units sold in the U.S. during its eight-year journey, it’s safe to say that there are still many of them on American roads today. It may not be the fastest-charging, the biggest or the most luxurious EV out there, but it’s always been the safe and affordable choice for those looking for an urban runabout.\n\nMore Stories Like This\n\nOur own Tom Moloughney was one of the first people in the U.S. to charge the Bolt EV on a Tesla Supercharger. He made a rather helpful video, which I’ve embedded at the top of this page, and I’ll give you the gist of it in writing as well. \n\nFirst, if you own a Chevrolet Bolt EV, you should know that \n\n at the dealer to work with Tesla Superchargers. You’ll also need a CCS to NACS adapter, either from General Motors or a third party like A2Z or Lectron–the video covers several adapters.\n\nAnother thing to note is that only V3 Superchargers can be used to top-up non-Tesla EVs. You can find them by going to \n\n and toggling the “Supercharger open to NACS” option.\n\nWith all this in mind, before you show up to a compatible Supercharger with your Bolt EV and an adapter at hand, you need to link your vehicle to a payment method in the MyChevrolet app, so that Tesla knows where to draw money from for the charging sessions. All apps must be up to date.\n\nThat’s a lot to take in, but once you get over all these initial steps, all you need to do is park front-first at a compatible Supercharger, plug in the cable, launch the MyChevrolet smartphone app, select the correct stall from the list and hit Charge Now.\n\nIn Tom Moloughney’s testing, both third-party adapters worked just fine, funneling the maximum charge rate that the Bolt EV supports–55 kW–without hiccups. The EV needed 49 minutes to charge from 20% to 80% state of charge, which, again, is normal Bolt EV behavior, but there was one issue where the car stopped charging at 70% SoC and needed to be unplugged and replugged to get to 80%. The charging curve was the same as on other charging operators such as EVgo and Electrify America, with the rate slowly going down after the battery state of charge passed the 55% mark.\n\nSo it’s all good. Almost. That’s because the Bolt EV’s charging port is on the front-left of the car, as opposed to the rear-left of Tesla EVs. This means you have to pull into the charger on the right, effectively taking up two stalls. It’s the same issue with \n\n EVs and the ", "url": "https://insideevs.com/news/734739/charging-chevrolet-bolt-ev-tesla-supercharger/", "image": "https://cdn.motor1.com/images/mgl/8AYvBW/s3/chevrolet-bolt-ev-charging-on-a-tesla-supercharger.jpg"},
{"title": "Tesla-Driving Teen Denied Driver’s License Because Car Has 'Too Many' Safety Features", "author": "Rob Stumpf", "text": "Here's a real head-scratcher for the books: an Arizona teen showed up to take her driver's test in a Tesla Model Y only to be denied because Tesla's Full Self-Driving feature made the car—get this—\n\n.\n\nYou read that right. The Model Y, loaded with cutting-edge safety features designed to help prevent accidents, was deemed too helpful to the teen during the test. And if this sounds like something straight out of a parody, buckle up because it gets better.\n\nAccording to a \n\n by her father, who owned the Model Y, the teen passed the practical portion of the driving exam. There was a problem, though. The computers at the DMZ were supposedly down, so the newly licensed teen was asked to return the following day to pick up her shiny new Arizona license.\n\nFast-forward to the following day, when the teen returned to the DMV with her mom. That's when the DMV staff pulled them aside to let them know that the daughter wouldn't be getting her license that day. The reason? She was using Tesla's Full Self-Driving feature.\n\nTo the DMV's credit, a retest was probably warranted if the teen was using FSD or even Autopilot for the test. But that couldn't be true, according to the father, since the family's Model Y \n\n.\n\nAfter pushing back, the DMV reportedly changed its tune. The teen was still denied their license; however, this time, it was for using one-pedal driving.\n\nIf you're unfamiliar with the concept, let me explain: rather than using the physical brakes to slow the car down using the friction between the brake pads and a car's rotor, EVs can use the car's electric motors to return energy into the battery pack. It feels very similar to hitting the brake and is more efficient to turn kinetic energy back into stored energy rather than heat and brake dust. This requires only one pedal (hence the name) and has been how I've been driving my Tesla since the day I bought it. And if you own a Tesla built after January 2024, it's impossible to turn off regenerative braking altogether.\n\nAccording to the DMV, that wasn't a good enough reason not to use the brake pedal more. Here's what the dad \n\n:\n\nI talked the the person that made the final decision and her main point was something along the lines of... If we don't know she can brake with the brake pedal, then how do we know she can drive a non-Tesla. When I brought up that if someone driving an automatic transmission takes the test, how do you know they can drive a standard? She had nothing to say about that.\n\nAt one point an employee said that they might have to ban Teslas from taking the road test because they have too many safety features.\n\nI wish I could afford another Tesla for our daughter due to \"too many\" safety features!\n\nBelieve it or not, this isn't the first time a driver has failed their license test over the use of regenerative braking. \n\n instances \n\n in California during 2021 which sparked quite a bit of controversy at the time. One user on Reddit even \n\n that their girlfriend was flunked for using the car's onboard cameras—a Tesla will display the side repeater cameras and trunk camera when performing certain functions like engaging the turn signal or reversing—rather than the mirrors during the test.\n\nFortunately for this Arizona driver, dad's pushback was enough to get the DMV to reconsider their position and grant the teen her license. The DMV also mentioned that it would reevaluate how to administer the test moving forward.\n\nNow, listen, we get it. These tests have to follow a set standard. Check the mirrors, use the brake, parallel park within so many inches of the curb. DMVs are, if nothing else, a cog in the bureaucratic machine. However, automotive technology is progressing much more quickly than certain processes or, in some cases, even \n\n.\n\nIn the meantime, maybe it's a bit smarter to stick to something more old-school when taking a driver's test—at least for now.", "url": "https://insideevs.com/news/734678/arizona-teen-denied-license-safe/", "image": "https://cdn.motor1.com/images/mgl/zxqVmq/s3/tesla-model-y-arizona-drivers-license-denied.jpg"},
{"title": "This Tool Shows You All The Incentives You Could Get When Buying An EV", "author": "Iulian Dnistran", "text": "The \n\n for a new electric vehicle is probably the best-known car-related incentive in the United States right now, but did you know that there are a bunch of other, smaller benefits you could get your hands on when buying an EV?\n\nThere are tax credits and rebates you could be eligible for if you’re getting a used EV or if you’re installing a Level 2 charger at your house, but it all depends on where you live and sometimes on your income. In other words, it can be a bit daunting to go through your state’s legislation, but there’s an easy fix for that.\n\n is a website put together by Veloz, a nonprofit organization, that has an interactive section dedicated to the incentives offered in your area including tax credits, rebates, charging rebates, local utility programs and other special perks for going electric.\n\nMore Stuff Like This\n\nAs reported by \n\n, all you need to do is put in your zip code and check out the list of potential money-saving perks. For instance, a Washington resident who buys a new EV could get the $7,500 federal tax credit, an instant state rebate of up to $9,000, a state tax exemption of up to $975, a $1,000 federal tax credit for installing a home charger and a state tax exemption for installing said charging station, as well as rebates of up to $2,600 from Puget Sound Energy for a Level 2 charger.\n\nIn New York, the state offers a rebate of up to $2,000 when buying or leasing a new EV as well as an income tax credit of up to $5,000 for installing a charger. There are also federal incentives such as the $7,500 tax credit for new EVs and a tax credit of up to $1,000 for installing an \n\n.\n\nLiving in California? You could get up to $12,000 off a new EV if you're replacing an old gas guzzler. That's in addition to the $7,500 federal tax credit and the exemption to drive on the HOV lane without any passengers inside the car.\n\nAdd everything up and you could save more than you originally thought when setting out to buy an EV.", "url": "https://insideevs.com/news/734795/ev-incentives-tool/", "image": "https://cdn.motor1.com/images/mgl/nAb631/s3/the-tesla-model-y-may-be-eligible-for-multiple-federal-and-state-incentives.jpg"},
{"title": "It Turns Out Charging Stations Are Cash Cows For Nearby Businesses", "author": "Rob Stumpf", "text": "When people ask me how long it takes me to top off while charging, I often give them the same spiel: \"Long enough for me to use the bathroom, grab a snack or drink, and walk back to the car.\" It turns out I'm not alone.\n\nA \n\n has confirmed what most of us have already suspected: EV charging stations aren't just better for the environment; they're also money printers. And it's not just charging network providers who see green—so do nearby shops.\n\nThe study drilled in on spending patterns for businesses around EV charging locations. It turns out that businesses located within a mile of an EV charger saw a notable increase not just in customer traffic, but also customer spending. From the \n\n:\n\n[I]n California, opening a charging station boosted annual spending at each nearby business by an average of about $1,500 in 2019 and about $400 between January 2021 and June 2023. The spending bump amounts to thousands of extra dollars annually for nearby businesses, with the increase particularly pronounced for businesses in underresourced areas.\n\nIt turns out that when drivers plug in their cars for a few minutes, they also plug into their wallets to drop spare cash at nearby coffee shops, food joints, and retail stores while their car charges.\n\nThink about it: what else are you doing while waiting for your battery to juice up? That \"dwell time,\" as it's known, is what's propping up local businesses. You \n\n twiddle your thumbs or pop on Netflix for a bit. You could also engage in consumerism by visiting Starbucks for your favorite drink and then doing impulse shopping at Target.\n\nWhat's fascinating is how charging is reshaping local economies as EV traffic becomes heavier across the U.S. The research found that existing businesses were seeing a bump in customers, and new businesses began to pop up in the area as it became more of an EV hot spot.\n\nGas stations simply don't have the same effect—but then again, those are quick stops that take just a few minutes between fill-ups. Even with that come-and-go model, most gas stations still have a convenience store attached, and that's a parallel that can be explored for EV chargers as well:\n\n\"The joint gas station and convenience store business model could also be adapted to EV charging stations,\" said Yunhan Zheng, the lead author of the study. \"Traditionally, many gas stations are affiliated with retail store chains, which enables owners to both sell fuel and attract customers to diversify their revenue stream. EV charging providers could consider a similar approach to internalize the positive impact of EV charging stations.\"\n\nEV chargers create this weird downtime between plugging in and charging up enough to take off. While many \n\n (and, boy, do consumers want that), a small break is plenty of time away from the wheel to stretch your legs, wake up, and check out that small boutique you passed on the way in.\n\nNot all businesses feel the love equally. MIT's findings note that coffee shops, restaurants, and convenience stores are seeing the most increase in revenue. Basically, the places where people can kill 20 or so minutes while using a DC Fast Charger. So while that bookshop might not be swimming in cash, the taco place next door probably is thanking Tesla as every new car pulls up to the nearby Supercharger.\n\nThis study is a wake-up call for businesses on the fence of setting up shop near a charging station. These small stations are creating mini mile-wide economic hubs across America, and with more charging infrastructure coming online as EV adoption continues to ramp up, proximity to an EV fast charger might just become prime real estate. It's almost like \"charging, charging, charging\" is the new version of \"location, location, location.\"\n\nSo remember the next time you're at a charging station: it's not just your car getting a boost; it's also the local shops.", "url": "https://insideevs.com/news/734705/ev-chargers-cash-cow-nearby/", "image": "https://cdn.motor1.com/images/mgl/qkl6Ry/s3/electricy-america-mit-ev-charging-economic-study.jpg"},
{"title": "Fisker Owners May Have To Pay For Recalls Out Of Pocket After All", "author": "Tim Levin", "text": "Fisker Ocean owners may have to foot the bill for recall-related repairs after all. On Monday, the failed EV startup \n\n about the recalls to specify that customers will be on the hook for the labor costs associated with those fixes. \n\nThe company says it's working on pulling together the money to take care of labor costs—on top of the free parts it's providing—but that that isn't a sure thing. Here's what the section titled \"Will I be charged for the recall-related inspections or repairs?\" now reads (emphasis ours):\n\n- For the software updates delivered over the air, there will be no cost to you as the owner of the vehicle. These updates are part of our commitment to ensuring the ongoing safety and performance of your Fisker Ocean.\n\n- For the two recalls that require physical inspection and repair related to the outer door handles and electric water pumps, Fisker will provide the necessary parts and diagnostic tools at no cost to you, \n\n. Through the bankruptcy process, Fisker was able to fund the purchase of service parts while funding for labor costs is not currently available. It was a priority to make service parts available to avoid delaying these two safety recalls. \n\nMonday's revision marks the second time Fisker has reversed course on whether its customers \n\n for these recall-related fixes. When it was initially published earlier this month, the FAQ page stated basically what it says now—that parts would be free but labor wouldn't be covered. \n\nFollowing media reports and outrage from customers, Fisker swiftly backtracked. It updated the page to say: \"Regarding the recalls that require physical inspections and potential repairs, Fisker will provide the necessary parts (including the labor) at no cost to you.\" A week later, that's no longer the case. \n\nFisker Ocean\n\nIn a statement to InsideEVs on Wednesday, the National Highway Traffic Safety Administration said that it \"is aware of Fisker’s statement and is working to ensure vehicle owners receive recall remedies without charge, as required by federal law.\" \n\nFisker did not respond to a request for comment. We'll update this story when we hear back. \n\nFisker, the second EV startup started by car designer Henrik Fisker, launched the \n\n in the summer of 2023 as its debut model. The company struggled with sales, service and a buggy car. It has issued \n\n, including two that may require new hardware to be installed. One concerns the door handles, while the other is for faulty water pump that can result in a loss of drive power if it breaks. \n\nThe company filed for Chapter 11 bankruptcy protection in June. Shortly thereafter, it \n\n to a firm that leases cars to ride-hailing drivers in New York. It recently reached an agreement to liquidate its assets and pay off its creditors, which may be approved next month. ", "url": "https://insideevs.com/news/735072/fisker-owners-pay-for-recall/", "image": "https://cdn.motor1.com/images/mgl/pbYmP1/s3/fisker-ocean-on-a-brick.jpg"},
{"title": "The McMurtry Speirling Is 'Not So Much A Car As It Is A Cheat Code'", "author": "Andrei Nedelea", "text": "Many electric vehicles are designed with a track focus these days, but the McMurtry Speirling makes them look basic. The latest version, the Speirling Pure prototype, has been \n\n around the world with its unmatched combination of power, lightness and downforce.\n\nIt has 1,000 horsepower from two motors driving the rear wheels and can hit 60 mph from a standstill in under 1.5 seconds. However, its most interesting (and performance-enhancing) feature is its fan that effectively sticks the car to the tarmac (even when it’s standing still), providing up to 4,400 pounds of downforce.\n\nThis allows the Speirling to corner at absurd speeds, subjecting drivers to over 3G of lateral force. For context, the very best track-focused road cars like a Porsche 911 GT3 RS struggle to reach 1.3G through corners, while a Formula 1 car will go up to 6G through a very high-speed corner where its aero is working at peak capacity.\n\nDriving a Speirling is a one-of-a-kind experience since there isn’t another car that creates downforce the way it does. It’s also really quick in a straight line, and unlike a car with conventional aero, whose rate of acceleration slows as speed builds due to drag, in the Speirling it feels just as relentless all the way to its top speed.\n\nMore Track-Focused EVs\n\nTop Gear put its head of car testing, Ollie Marriage, behind the wheel of the Speirling Pure, and he was left gobsmacked. He tried the three different fan settings, which change not only the amount of downforce but also the power provided by the motors to mimic different racing series. The lowest fan setting simulates a GT3 car, after which you can move up to LMP1 and then to F1 levels of acceleration and grip.\n\nThe way you can corner in a Speirling is remarkable, and even though it feels surefooted and undramatic, the forces at work on your body do take their toll. Marriage does note in his track test of the Speirling Pure that after a few laps, he is beginning to feel the strain of all those lateral and longitudinal forces.\n\nMcMurtry won’t build either \n\n or the newer Speirling Pure in this exact form. The production Speirling will have a longer wheelbase and a larger 100-kilowatt-hour battery pack, and it will be slightly heavier than the prototypes, weighing in at about 2,650 pounds. Even with the extra weight, it will still be able to smash through the quarter-mile in about 8 seconds and reach a top speed of 185 mph.\n\nWith a price tag of £895,000, or over $1.1 million, the McMurtry Speirling is very expensive for a single-seater track toy. The manufacturer says only 100 will be built, and the first are expected to arrive in 2025. McMurtry has also revealed that \n\n of making ", "url": "https://insideevs.com/news/734674/mcmurtry-speirling-top-gear-track/", "image": "https://cdn.motor1.com/images/mgl/YAg3Pl/s3/hpzxcfglu2q.jpg"},
{"title": "Tesla Supercharger Extension Cable Maker Addresses Cybertruck Engineer's Warning", "author": "Rob Stumpf", "text": "Remember when Tesla's head Cybertruck engineer \n\n? Wes Morrill advised \"against\" using them, resulting in the cable manufacturer, A2Z EV, reaching out to him to discuss specifics—now they're back with their own update.\n\nIn a recent series of posts, A2Z EV addresses the safety concerns first-hand, assuring the public that their cable does have safety measures built-in to protect against overheating and other issues brought up by Morrill.\n\nThat's not all. A2Z EV also doubled down by accepting legal liability should something go wrong and it determined to be caused by the extension cord. That's right, they're willing to put their money where their, erm, extension cord is.\n\nFirst off, if you missed the original drama, let's recap.\n\nMorrill took to X on Wednesday to give his opinion—as Tesla's \n\n and an overall subject matter expert—that folks shouldn't touch a Supercharger extension cord, or any DC Fast Charger extension cable, with a ten-foot pole. The concern? When connected to high-output EV chargers, these kinds of extension cords could cause power issues, overheating, or even shorts (potentially resulting in fires). Overall, they have the potential to create an unsafe charging environment.\n\nWell, that caused a bit of rippling across the EV community among non-Tesla owners who now have access to the Tesla Supercharging network. Since their vehicles have charge ports placed in locations not optimized for the Supercharger's short cables, these owners saw an extension cable as an opportunity to make the charging experience easier. Morrill's advice may have made them about-face.\n\nA2Z EV chimed in after chatting with Morrill to assure the public that they have nothing to worry about. According to the company, their extension cord has multiple safety features built-in to prevent any sort of thermal issues. For starters, the cable has its own temperature sensors on both ends. A2Z says that if a sensor determines that the cable is too hot, it will shut down, potentially preventing the cable from overheating should the charging session go sideways. It's their way of clapping back by saying, \"Yeah, we thought of that.\"\n\nThe company also confirmed that it would be held legally liable if things were to go awry and the cable was deemed to be at fault—be it for damage to the cars or from fires. That's a pretty bold statement, as it shows that A2Z is confident in its product even if Tesla's top Cybertruck engineer has his own concerns.\n\nThis debate isn't going to disappear overnight. Despite A2Z's reassurances, introducing any variable into an otherwise seamless charging experience could introduce some technical challenges that would otherwise go unnoticed. The question of whether or not these cables affect the charging process is still valid. Plus, if something goes wrong, would Tesla void a car's warranty, or an insurance company deny a claim?\n\nFor now, A2Z EV says that it won't release its product without extensive testing. It also says that it's open to working with Tesla to ensure that its product meets its standards. Keep in mind that \n\n, so we're not sure how much Tesla would be willing to eat into sales of its own first-party product.\n\nEven if the company determines that this cable is safe for release, it now has to fight past the stigma introduced by Morrill's recommendation. And that's not to say that Tesla might not introduce some sort of detection method in the future that disables the cable for perceived safety purposes. Regardless, this certainly won't be the last time we hear about the Supercharger extension cable debacle.", "url": "https://insideevs.com/news/734672/cybertruck-engineer-supercharger-extension-cable/", "image": "https://cdn.motor1.com/images/mgl/rKEZkO/s3/tesla-supercharger-extension-cable-a2z-ev-response-hero.jpg"},
{"title": "General Motors' CEO 'Surprised' EVs Have Become Political", "author": "Patrick George", "text": "Here in America, we invent all kinds of new and fantastic ways to get mad about the things we see on cable news. For approximately half the country, \n\n. People are mad that they might be \"forced\" into buying EVs, and even if that's not actually the case, even the CEO of General Motors admits she's been caught off guard by the backlash. \n\nGM CEO Mary Barra's latest comments on the EV race headline this Monday edition of Critical Materials, our morning roundup of tech and auto industry news. We'll also look at Nissan's new plug-in hybrid plans and why South Korea's recent EV battery fire scare may even have an upside.\n\nGM CEO Mary Barra with the 2024 Chevrolet Equinox EV\n\nI have to hand it to Barra: I think she struck the right tone during an interview \n\n this past weekend. GM has actually been having a pretty good do-over year for EVs: it's been launching new models like the Equinox EV and several upcoming electric Cadillacs, all while preparing for the reboot of the Bolt EUV next year. And Tesla's Supercharger network \n\n with the use of a new adapter. \n\nBut GM certainly hasn't been immune to the headwinds of the EV sector, mainly that sales haven't taken off as quickly as they and other automakers expected. (And increasingly, I wonder what it was they all seemed to expect.) Barra \n\n and that it will delay several new models and factories as it waits for the market to \"develop.\" \n\nAs disappointing as that is, Barra at least reaffirmed the overall goal on CBS:\n\nBut it was her promise three years ago to stop selling gas-powered vehicles by 2035 – and GM's ability to live up to it – that will likely define her legacy.\n\nAsked if she anticipates GM will be all-electric by 2035, Barra replied, \"For our light-duty vehicles, yes. We'll be guided by the consumer, but the plans that we have in place will get us there.\" Nonetheless, in the face of slowing EV sales, Barra said, \"I don't think we ever thought it was gonna be linear.\"\n\nThe \"light duty\" caveat, \n\n, is interesting. GM seems to be as skeptical of the electric heavy-duty work truck as Ford is—and I'm fairly unconvinced on giant, 200 kWh batteries for trucks too—but that's just me reading the lines there.\n\nBut Barra's also in a tough spot because she's seeking to get more customers for very mainstream American brands like Chevrolet and GMC into EVs. I don't mean to generalize too much, but that's a very different customer base than Rivian or Tesla, and the politicization of EVs may be tougher for GM to navigate. It certainly caught Barra by surprise: \n\nBarra was surprised that EVs have become a political issue: \"I never thought the propulsion system on a vehicle would be,\" she said. \"Again, I think one of the strengths of General Motors is we're giving people choice. We're not telling you what you have to have. We're saying, if you want this, we have it.\"\n\nThen again, the Bolt EV and EUV \n\n. If you build it, and it's cheap enough and good enough, they will come. \n\nNissan EV Timeline at the Nissan Crossing store in Ginza, Tokyo. Photo: Patrick George\n\nIf you believe in an electrified future, there are reasons to be optimistic about GM these days. Less so for Nissan, which blew an early lead in the EV race to keep making anodyne-looking gas cars powered by engines that they were running when I was in high school. (Which was over 20 years ago, for context.)\n\nWhile the staying power of the VQ35 family of V6 engines is certainly a master class in cost amortization, Nissan does feel quite behind the curve on its powertrain strategy. It sells one EV in the U.S. and no hybrids here. But it is planning to join GM in offering some plug-in hybrids in the back half of this decade, \n\n. \n\nLike the rest of the auto industry in Japan, a country that struggles with scarce natural resources and has a challenged relationship with electricity generation, Nissan has lagged on cars with plugs. Even Toyota's PHEV sales are drop in the bucket compared to conventional hybrids. But Nissan may soon lean on partners at Mitsubishi to get properly in the PHEV game:\n\nNissan Motor plans to develop its own plug-in hybrid electric vehicles, preparing to reach the market as soon as the late 2020s, Nikkei has learned, and also is considering having partner company Mitsubishi Motors supply PHEVs to Honda Motor, which does not offer that type of vehicle in the Japanese market.\n\nAs sales of fully electric vehicles stall globally amid high prices, Nissan sees highly profitable PHEVs as an important bridge to the time EVs achieve wide adoption.\n\nSales are rising for PHEVs, which combine an electric motor with a conventional fuel-powered engine. General Motors also has begun to consider developing plug-in hybrids for the U.S. market.\n\nElectric vehicles are broadly classified into EVs, PHEVs and hybrids. These environmentally friendly autos emit less carbon dioxide than cars powered solely by petrochemicals.\n\nPHEVs have a longer driving range than EVs because they also carry an engine. Unlike hybrids, they can be charged from household electrical outlets. Despite offering the advantages of both technologies, Japanese PHEVs have been limited to a few models offered by Toyota Motor and Mitsubishi Motors.\n\nThen again, Nissan has made big promises on EVs before, and the late 2020s may as well be 500 years away considering how fast the tech market moves—and how far ahead China is all sorts of plug-in cars. \n\nSouth Korea EV Fires\n\nMeanwhile in South Korea, a country that is quite advanced at EVs, a recent spate of underground parking garage fires has buyers on edge. Sales of EVs are now plummeting there, while they had been on the rise before this. \n\nHowever, the Korean government seems to be acting swiftly to reassure car buyers that EVs are safe, and it has enacted groundbreaking rules around battery sourcing transparency. \n\n Heesu Lee, based in Seoul and an EV owner herself, manages to find an upside here: \n\nWith the investigation still underway and the cause of the Mercedes fire yet to be identified, some carmakers, including Hyundai, General Motors and Porsche have taken the matter into their own hands by voluntarily disclosing their battery suppliers and offering free safety inspections to EV owners.\n\nThe government has also pledged to strengthen safety measures in parking lots and require more EV makers and battery charging operators to have adequate insurance cover. Whether those measures are enough to calm the unease around EVs is yet to be seen. As for me, I’m content to keep driving my EV.\n\nAnd the flip side of risk is opportunity. If South Korea pushes forward and ends up with effective and comprehensive regulations in place, it could be a chance for the country to build a more resilient environment for EVs in the future. \n\nAnd it could serve as an example for the rest of the world. \n\n2026 Chevrolet Bolt Rendered\n\nIf you're GM, how do you get past the knee-jerk anti-EV politics that are out there? I'll say it again: people want a good deal. Give them something really affordable and also means they'll never have to pay for gasoline again and just see how fast they lose any misconceptions.\n\nIt's just technology, folks. It doesn't need to get political. \n\nMore EV News\n\n ", "url": "https://insideevs.com/news/734720/mary-barra-politics-cm-election/", "image": "https://cdn.motor1.com/images/mgl/g4zM9N/s3/escalade-iq-top.jpg"},
{"title": "Tesla Full Self-Driving 'Occasionally Dangerously Inept' In 1,000-Mile Independent Test", "author": "Iulian Dnistran", "text": " and its outspoken CEO have long promised \n\n, but we’re still not there yet. Despite the two available advanced driving assistance systems (ADAS) being called Autopilot and Full Self-Driving (Supervised), they still aren’t classified as Level 3 systems on \n\n, meaning the driver still has to be attentive and ready to take over control at any time.\n\nWhile the so-called FSD can run flawlessly for the majority of situations, as attested by \n\n, it can sometimes hit the mark, and it’s these occasional hiccups that can become dangerous.\n\nThat’s what \n\n, an independent research firm, concluded after testing Tesla’s FSD on over 1,000 miles of city streets, rural two-lane highways, mountain roads and highways. The company used a 2024 \n\n fitted with the automaker’s latest hardware and running the latest software iterations, 12.5.1 and 12.5.3.\n\nMore Stuff Like This\n\nDuring testing, AMCI drivers had to intervene over 75 times while FSD was active, resulting in an average of once every 13 miles. In one instance, the Tesla Model 3 ran a red light in the city during nighttime even though the cameras clearly detected the lights. In another situation with FSD (Supervised) enabled on a twisty rural road, the car went over a double yellow line and into oncoming traffic, forcing the driver to take over. One other notable mishap happened inside a city when the EV stopped even though the traffic light was green and the cars in front were accelerating.\n\nHere’s how Guy Mangiamele, Director of AMCI Testing, put it: \"What's most disconcerting and unpredictable is that you may watch FSD successfully negotiate a specific scenario many times–often on the same stretch of road or intersection–only to have it inexplicably fail the next time.\"\n\nAMCI released a series of short videos which you can watch embedded below (just try to ignore the background music.) The clips show where FSD (Supervised) performed very well, like moving to the side of a narrow road to let incoming cars pass, and where it failed.\n\n\"With all hands-free augmented driving systems, and even more so with driverless autonomous vehicles, there is a compact of trust between the technology and the public,” said David Stokols, CEO of AMCI Testing's parent company, AMCI Global. “Getting close to foolproof, yet falling short, creates an insidious and unsafe operator complacency issue as proven in the test results,\" Stokols added.\n\nAMCI’s results come as Tesla is preparing to launch its \n\n. On several occasions, CEO \n\n alluded that the company’s cab would be able to drive autonomously anywhere because it doesn’t rely on \n\n and instead uses a camera system that intelligently assesses situations and makes decisions on the fly.\n\nHowever, \n\n and famed Tesla hacker \n\n recently reported that Tesla is actively collecting data in the Los Angeles area where the Robotaxi event is scheduled to happen. Several \n\n on the same roads where ", "url": "https://insideevs.com/news/735038/tesla-fsd-occasionally-dangerously-inept-independent-test/", "image": "https://cdn.motor1.com/images/mgl/6Zoo1r/s3/tesla-s-fsd-supervised-falls-short-after-1-000-mile-independent-test-by-amci.jpg"},
{"title": "Tesla Model Y Inches Closer to Dethroning Ford F-150 As U.S.' Best-Selling Vehicle", "author": "Rob Stumpf", "text": "It sure looks like the Tesla Model Y is just a breath away from becoming America's number-one-selling vehicle. That should come as no surprise if you've been keeping an eye on the EV market. After all, the \n\n—just not its home market.\n\nThe latest Experian data collected by \n\n shows that the Model Y is coming for that title back home, too. In fact, recent sales figures put Tesla's crossover above not only the venerable Toyota Rav4 but also the crowned king: the Ford F-150.\n\nLast year, the Model Y placed fifth in the highest sales volume by model. It was bested by the Toyota Rav4, the Ram 1500, the Chevrolet Silverado, and the Ford F-series. Mid-year sales data from \n\n placed the Model Y in fourth, behind last year's top three. However, new data from Experian puts the Toyota Rav4 at the top with 2.8% of all new registrations and the Model Y nearly neck-and-neck with 2.6%—its highest share of new vehicle registrations in the U.S. \n\n.\n\nYou must be wondering by now how the Model Y is disrupting the status quo. The reason is simple: Tesla made a car that people actually want.\n\nNow, sure, there's a lot of \n\n. And \n\n to new brands. But in the interim, Tesla's sales of the Model Y continue to be impactful even as a \n\n and the \n\n.\n\nSo it's no longer just Tesla fanboys with Model Ys in the driveway. It's everyday Americans who are turning to Tesla at a time when EVs are growing in popularity enough to become mainstream. It's almost as if people aren't as spooked by range anxiety, the lack of charging stations, or the perceived brand negatives. It turns out that the Model Y just happens to fit a lot of average people's needs really, really well.\n\nClimbing to the top is a big deal, but perhaps the most unspoken bragging right that Tesla could achieve is breaking a streak held for nearly a half-century. The Ford F-series, which includes the F-150, has been the number one vehicle sold in the U.S. for the \n\n. The Model Y—let alone any vehicle that isn't a pickup—taking its place speaks volumes about where Americans' heads are at.\n\nElectrification? Check. An insatiable appetite for SUVs? Check. Are new truck prices going through the roof and \n\n? Check.\n\nThe formula is all there. All Tesla has to do is keep pumping out new vehicles without spooking away buyers with its controversial figurehead or threats of a refreshed nameplate (\n\n). If Tesla manages to dethrone the king, let's just say that it better wear that crown with pride because that's something no automaker has managed to do in decades.", "url": "https://insideevs.com/news/734706/tesla-model-y-best-selling/", "image": "https://cdn.motor1.com/images/mgl/KbmyyG/s3/white-tesla-model-y-parked.jpg"},
{"title": "These 12 EVs Were Driven Until They Died. A Polestar Surprised The Most", "author": "Andrei Nedelea", "text": "Range anxiety is not as big a concern with the current crop of electric vehicles sold in Europe. Even the lowest-range cars can now easily exceed 200 miles on one charge thanks to bigger batteries and improved efficiency.\n\nThe UK's \n\n? gathered a group of 12 electric vehicles, of which 11 were brand new models, together with a high-mileage \n\n 90D and drove them until they died.\n\nUnlike the similar-format tests performed by other outlets, which are done on public roads and some variables and results can’t be controlled, \n\n used a track instead.\n\nBy having a track with no traffic or other variables that could affect the result, all the cars in the test went through the same regime of simulated city and open-road driving—it’s just a little bit more scientific. That’s why it’s perhaps unsurprising that the vehicles with the highest claimed range also performed the best in this test, and the car that came in second is a brand-new EV that could soon become a favorite in Europe.\n\nIt’s \n\n, which for its latest generation abandons its minivan body and combustion power and becomes an all-electric crossover. It has a 92 kWh battery pack with a usable capacity of 87 kWh and a WLTP estimated range of 379 miles. It also looks great and was one of the roomiest and most practical vehicles of this test.\n\nRenault Scenic E-Tech Electric\n\nThe Scenic E-Tech managed 322 miles before it ground to a halt, missing its claimed range figure by 15.2% and it came in second place. Only \n\n in rear-wheel drive long-range guise, with its 82 kWh battery, beat it, covering 333 miles, or about 18% less than its claimed WLTP range of 406 miles.\n\nThe biggest-battery EV of the test, the 99.8 kWh \n\n in rear-wheel drive guise, took the third position. It stopped after 314 miles, or 10% short of its claimed WLTP range of 349 miles. This is actually better than the 304 miles the EPA says you should expect to achieve from a same-spec model in the U.S., so this really is an impressive result.\n\nComing in fourth position—and perhaps more relevant to any U.S. readers out there—was \n\n, which came closest to matching its WLTP range. It stopped after 314 miles of driving or about 8.1% short of the claimed 338 miles. It was followed by \n\n, which achieved 294 miles, or 11.9% less than its 334-mile WLTP claim.\n\nThe reviewers expressed their disappointment with the vehicle that came in sixth position, \n\n, a brand new model built on the PPE architecture shared with the Porsche Macan EV. Its 94.9 kWh battery, which makes it \n\n, took it 289 miles, missing its WLTP range of 344 miles by 16%. Next came \n\n rear-wheel drive, which was the most efficient vehicle of this test, but it recorded the biggest difference between its real-world range and the WLTP number.\n\nIt achieved 255 miles, or 19.7% less than the advertised 318-mile WLTP range. \n\n came within 9.7% of achieving its 282-mile WLTP range and stopped after 255 miles. This puts \n\n in a bad light with the 17.9% difference between its 242-mile test range and the 295-mile WLTP claim.\n\nThe oldie of the group test was a 2015 Tesla Model S 90D that had covered almost 260,000 miles. It kept going for 213 miles, surpassing the Peugeot e-308 SW (212 miles) and the Mini Cooper SE (211 miles). That’s quite a remarkable achievement for such an old EV whose battery had only lost 13% of its original capacity.", "url": "https://insideevs.com/news/734849/europe-evs-driven-range-test/", "image": "https://cdn.motor1.com/images/mgl/1ZEK8w/s3/w0cnbzd_fku.jpg"}
]